[
  {
    "title": "Sub-Zero Temperatures Didn’t Affect Madison’s Electric Bus Fleet This Year–A Major EV Milestone",
    "link": "https://www.goodnewsnetwork.org/sub-zero-temperatures-didnt-affect-madisons-electric-bus-fleet-this-year-a-major-ev-milestone/",
    "description": "In January, GNN reported on how the brain-disabling cold of the Norwegian winter couldn’t affect the performance of an all-electric ferryboat plying the waters in the country’s far northern district of Finmark. Well closer to home, a fleet of all-electric buses in Wisconsin have made it to the Vernal Equinox with similar performance statistics: the […]\nThe post Sub-Zero Temperatures Didn’t Affect Madison’s Electric Bus Fleet This Year–A Major EV Milestone appeared first on Good News Network.",
    "pubDate": "Fri, 27 Feb 2026 12:00:21 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/sub-zero-temperatures-didnt-affect-madisons-electric-bus-fleet-this-year-a-major-ev-milestone/",
    "category": "general",
    "positivityScore": 13
  },
  {
    "title": "Cell & Gene Therapy Manufacturing Services Market Set to Reach USD 74.41 Billion by 2035, Driven by Growing Demand for Advanced Therapeutic Manufacturing Solutions Globally – SNS Insider",
    "link": "https://www.globenewswire.com/news-release/2026/02/27/3246368/0/en/Cell-Gene-Therapy-Manufacturing-Services-Market-Set-to-Reach-USD-74-41-Billion-by-2035-Driven-by-Growing-Demand-for-Advanced-Therapeutic-Manufacturing-Solutions-Globally-SNS-Inside.html",
    "description": "Expanding Clinical Pipelines, Contract Manufacturing Adoption, and Automation-Led Process Innovation Fuel Robust Market Growth Globally. Expanding Clinical Pipelines, Contract Manufacturing Adoption, and Automation-Led Process Innovation Fuel Robust Market Gr…",
    "pubDate": "2026-02-27T10:34:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/27/3246368/0/en/Cell-Gene-Therapy-Manufacturing-Services-Market-Set-to-Reach-USD-74-41-Billion-by-2035-Driven-by-Growing-Demand-for-Advanced-Therapeutic-Manufacturing-Solutions-Globally-SNS-Inside.html",
    "category": "science",
    "author": "SNS Insider pvt ltd",
    "positivityScore": 12
  },
  {
    "title": "Monopoly World Champion Reveals His Secrets for Always Beating Your Family, as the Game Celebrates 90 Years",
    "link": "https://www.goodnewsnetwork.org/monopoly-world-champ-reveals-his-secrets-for-always-beating-your-family/",
    "description": "A Monopoly World Champion has shared his top tips for winning your next game—and his first piece of advice is to always buy the ‘orange’ properties. As the iconic board game celebrates its 90th birthday this year, Jason Bunn, who once won the world title, talked to SWNS news agency about his successful strategies. His […]\nThe post Monopoly World Champion Reveals His Secrets for Always Beating Your Family, as the Game Celebrates 90 Years appeared first on Good News Network.",
    "pubDate": "Sat, 28 Feb 2026 12:55:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/monopoly-world-champ-reveals-his-secrets-for-always-beating-your-family/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Astronomers Say They Have Solved One of Saturn’s Greatest Mysteries",
    "link": "https://www.goodnewsnetwork.org/astronomers-say-they-have-solved-one-of-saturns-greatest-mysteries/",
    "description": "A neat feat of calculation and deduction may have solved one of our solar system’s greatest mysteries. Titan, the largest moon of Saturn, is bigger than Mercury, yet for all its conspicuousness, scientists don’t know exactly how it came to be so large that it’s gravitational influence causes Saturn to tilt and wobble. There are […]\nThe post Astronomers Say They Have Solved One of Saturn’s Greatest Mysteries appeared first on Good News Network.",
    "pubDate": "Fri, 27 Feb 2026 19:30:51 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/astronomers-say-they-have-solved-one-of-saturns-greatest-mysteries/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "UK’s First Geothermal Power Plant Begins Using Underground Heat to Power 10K Homes",
    "link": "https://www.goodnewsnetwork.org/uks-first-geothermal-power-plant-begins-using-underground-heat-to-power-10k-homes/",
    "description": "The UK’s first geothermal power plant has just begun operations, using hot water from deep underground to create renewable electricity. The United Downs plant in Cornwall has been in development for nearly two decades, and will now begin providing enough electricity to power 10,000 homes. Geothermal power generation comes via energy stored in the form of […]\nThe post UK’s First Geothermal Power Plant Begins Using Underground Heat to Power 10K Homes appeared first on Good News Network.",
    "pubDate": "Fri, 27 Feb 2026 16:30:02 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/uks-first-geothermal-power-plant-begins-using-underground-heat-to-power-10k-homes/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Thailand’s Mythical ‘Fire Tiger’ Captured on Trail Cam, One of the Rarest Sightings in the Cat World",
    "link": "https://www.goodnewsnetwork.org/thailands-mythical-fire-tiger-captured-on-trail-cam-one-of-the-rarest-sightings-in-the-cat-world/",
    "description": "Thai conservationists were delighted with the news that a sighting of an Asian golden cat had been recorded by camera traps. The legendary “fire tiger” of Thai folklore and mythology, the Asian golden cat is one of the most scarcely seen of all wildcats. Filmed by a camera trap in the country’s northern Khao Luang […]\nThe post Thailand’s Mythical ‘Fire Tiger’ Captured on Trail Cam, One of the Rarest Sightings in the Cat World appeared first on Good News Network.",
    "pubDate": "Thu, 26 Feb 2026 14:00:04 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/thailands-mythical-fire-tiger-captured-on-trail-cam-one-of-the-rarest-sightings-in-the-cat-world/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Radioactive Isotopes Being Embedded in Rhino Horns Seen as ‘Magical’ Anti-Poaching Solution",
    "link": "https://www.goodnewsnetwork.org/radioactive-isotopes-being-embedded-in-rhino-horns-seen-as-magical-anti-poaching-solution/",
    "description": "Reprinted with permission from World at Large News In South Africa, a strategy 6 years in the making to protect rhinos from poaching, as ingenious as it is dramatic, is now being implemented on the ground in the country’s game reserves and parks. Called the Rhisotope Project, it involves embedding non-harmful radioactive isotopes into the […]\nThe post Radioactive Isotopes Being Embedded in Rhino Horns Seen as ‘Magical’ Anti-Poaching Solution appeared first on Good News Network.",
    "pubDate": "Wed, 25 Feb 2026 21:00:11 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/radioactive-isotopes-being-embedded-in-rhino-horns-seen-as-magical-anti-poaching-solution/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "5,000-yo Bacteria Shows Antibiotic Resistance Is Ancient, Which May Help Us to Combat it",
    "link": "https://www.goodnewsnetwork.org/5000-yo-bacteria-shows-antibiotic-resistance-is-ancient-which-may-help-us-to-combat-it/",
    "description": "Long before antibiotics were invented, biotics—i.e. bacteria—had developed resistance to them. When researchers examined a bacterial strain called Psychrobacter discovered in 5,000-year-old layers of cave ice, they found it was resistant to 10 modern antibiotics. Yet it also showed promising enzymatic activities and could inhibit the growth of ‘superbugs’ resistant to multiple antibiotics, and besides […]\nThe post 5,000-yo Bacteria Shows Antibiotic Resistance Is Ancient, Which May Help Us to Combat it appeared first on Good News Network.",
    "pubDate": "Wed, 25 Feb 2026 12:00:30 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/5000-yo-bacteria-shows-antibiotic-resistance-is-ancient-which-may-help-us-to-combat-it/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Good Samaritans Sprang into Action to Save Baby That Fell into Lake Michigan",
    "link": "https://www.goodnewsnetwork.org/good-samaritans-sprang-into-action-to-save-baby-that-fell-into-lake-michigan/",
    "description": "From Chicago comes the story of a pair of heroes rescuing an infant that had been blown into Lake Michigan. 30-year-old Lio Cundiff was on the phone with his aunt at Belmont Harbor when he felt the wind pick up fiercely, followed by a bloodcurdling scream from a woman close by. Cundiff knew exactly what […]\nThe post Good Samaritans Sprang into Action to Save Baby That Fell into Lake Michigan appeared first on Good News Network.",
    "pubDate": "Tue, 24 Feb 2026 19:00:05 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/good-samaritans-sprang-into-action-to-save-baby-that-fell-into-lake-michigan/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "What will urban living look like in the future?",
    "link": "https://www.positive.news/society/what-will-urban-living-look-like-in-the-future/",
    "description": "A new vision for urban living is taking shape, driven by an urgent need to make our cities more liveable, sustainable and resilient \nThe post What will urban living look like in the future? appeared first on Positive News.",
    "pubDate": "Wed, 25 Feb 2026 12:16:15 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/what-will-urban-living-look-like-in-the-future/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "What went right this week: a ‘powerful message’ against online abuse, plus more",
    "link": "https://www.positive.news/society/good-news-stories-from-week-8-of-2026/",
    "description": "A law to protect survivors of online abuse was proposed, two rare birds made a resurgence, and new psychedelics research emerged, plus more\nThe post What went right this week: a ‘powerful message’ against online abuse, plus more appeared first on Positive News.",
    "pubDate": "Fri, 20 Feb 2026 05:00:21 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/good-news-stories-from-week-8-of-2026/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "2 Dogs Rescued By ‘Animal Lover’-Plow Driver After He Saw Them Running Middle of a Blizzard",
    "link": "https://www.goodnewsnetwork.org/2-dogs-rescued-by-animal-lover-plow-driver-after-he-saw-them-running-middle-of-a-blizzard/",
    "description": "A snow plow driver was crawling through near-white out conditions on Long Island when he saw something strange. Kenny McGowan has had to stop his snow plow in the past for all manner of hidden obstacles and hazards, from buried cars to fallen branches. Instead, two slight figures were running along the asphalt/ice/snow/salt poutine that […]\nThe post 2 Dogs Rescued By ‘Animal Lover’-Plow Driver After He Saw Them Running Middle of a Blizzard appeared first on Good News Network.",
    "pubDate": "Fri, 27 Feb 2026 14:00:53 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/2-dogs-rescued-by-animal-lover-plow-driver-after-he-saw-them-running-middle-of-a-blizzard/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Chance Rediscovery of Fossils Found in the 1960s Retell the Story of Giant, Globetrotting Amphibian",
    "link": "https://www.goodnewsnetwork.org/chance-rediscovery-of-fossils-found-in-the-1960s-retell-the-story-of-giant-globetrotting-amphibian/",
    "description": "250 million years ago, the giant ancestors of today’s salamanders swam from the area of today’s Norwegian Arctic to the west coast of Australia. This monumental trip placed it, many years later, under the brushes and picks of paleontologists who incorrectly identified it. The fossils would later travel all over the world much like the […]\nThe post Chance Rediscovery of Fossils Found in the 1960s Retell the Story of Giant, Globetrotting Amphibian appeared first on Good News Network.",
    "pubDate": "Thu, 26 Feb 2026 12:00:43 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/chance-rediscovery-of-fossils-found-in-the-1960s-retell-the-story-of-giant-globetrotting-amphibian/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 26",
    "link": "https://www.goodnewsnetwork.org/events070226/",
    "description": "94 years ago today, Johnny Cash was born. The American singer-songwriter, guitarist, and author was widely considered one of the most influential musicians of the 20th century and one of the best-selling music artists of all time, having sold more than 90 million records worldwide. Although primarily remembered as a country music icon, his genre-spanning songs […]\nThe post Good News in History, February 26 appeared first on Good News Network.",
    "pubDate": "Thu, 26 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070226/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Bride Goes Viral on Wedding Night Dancing While Doing Vital Cystic Fibrosis Treatment (WATCH)",
    "link": "https://www.goodnewsnetwork.org/young-bride-goes-viral-on-wedding-night-as-she-dances-doing-lifesaving-cystic-fibrosis-treatment-watch/",
    "description": "A bride who was filmed dancing at her wedding reception while undergoing treatment for cystic fibrosis has gone viral. “CF doesn’t stop no party ✨” was Dannika Evans’ opinion when she posted the video to her TikTok account, where she was doing her best to dance while wearing a special oscillation vest with a nebulizer […]\nThe post Bride Goes Viral on Wedding Night Dancing While Doing Vital Cystic Fibrosis Treatment (WATCH) appeared first on Good News Network.",
    "pubDate": "Wed, 25 Feb 2026 14:00:51 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/young-bride-goes-viral-on-wedding-night-as-she-dances-doing-lifesaving-cystic-fibrosis-treatment-watch/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "What We’re Reading: Data Centers Meet Their Match in Maine",
    "link": "https://reasonstobecheerful.world/what-were-reading-data-centers-meet-their-match-maine/",
    "description": "Welcome back to our weekly behind-the-scenes glimpse at what’s getting our team talking. Tell us what you’ve been reading at info@reasonstobecheerful.world and we just might feature it here. Rural resistance As concerns grow over the global expansion of data centers driven by an unprecedented surge in demand for computing power,...\nThe post What We’re Reading: Data Centers Meet Their Match in Maine appeared first on Reasons to be Cheerful.",
    "pubDate": "Wed, 25 Feb 2026 14:56:45 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/what-were-reading-data-centers-meet-their-match-maine/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "New brain stimulation approach could treat depression in just 5 days",
    "link": "https://www.sciencedaily.com/releases/2026/02/260224023103.htm",
    "description": "A weeklong, high-intensity version of TMS may work nearly as well as the standard six-week treatment for depression. In a UCLA study, patients who received five sessions a day for five days experienced meaningful symptom relief comparable to those on the traditional schedule. Some who didn’t improve immediately showed strong gains weeks later. The findings hint at a faster, more accessible path to recovery.",
    "pubDate": "Wed, 25 Feb 2026 05:08:45 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260224023103.htm",
    "category": "health",
    "positivityScore": 8
  },
  {
    "title": "Annotation-free prediction of immunotherapy response in melanoma using single-cell transcriptomic data",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343633",
    "description": "Immune checkpoint inhibitors (ICIs) have transformed the advanced melanoma treatment landscape; however, a subset of patients achieve durable responses. Current biomarkers, such as PD-L1 expression and tumor mutational burden, offer limited predictive power d…",
    "pubDate": "2026-02-27T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343633",
    "category": "health",
    "author": "Da Eun Oh, Gaeun Kee, Ji-Hye Oh, Wonkyung Kim, Young Gwang Kang, Chae Won Park, Tae Joon Jun, Chang Ohk Sung",
    "positivityScore": 8
  },
  {
    "title": "Opinion: The hidden costs of ‘100 per cent renewable’",
    "link": "https://financialpost.com/opinion/opinion-the-hidden-costs-of-100-per-cent-renewable",
    "description": "Electricity grids that rely on wind or solar have to build backup that, unlike these sources, is not intermittent. That's expensive. Read on",
    "pubDate": "2026-02-26T11:00:39Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/opinion/opinion-the-hidden-costs-of-100-per-cent-renewable",
    "category": "climate",
    "author": "Special to Financial Post",
    "positivityScore": 8
  },
  {
    "title": "What went right this week: the good news that matters",
    "link": "https://www.positive.news/society/good-news-stories-from-week-9-of-2026/",
    "description": "A lost giant returned to Galapagos, Wales passed a ‘life-changing’ bill, and a Chinese river came back from the brink, plus more\nThe post What went right this week: the good news that matters appeared first on Positive News.",
    "pubDate": "Fri, 27 Feb 2026 05:31:05 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/good-news-stories-from-week-9-of-2026/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "What advice did you receive as a child that has stayed with you?",
    "link": "https://www.positive.news/society/what-advice-did-you-receive-as-a-child-that-has-stayed-with-you/",
    "description": "You can’t put an old head on young shoulders, so they say. But some wisdom is passed on. We want to hear the nuggets that helped guide you\nThe post What advice did you receive as a child that has stayed with you? appeared first on Positive News.",
    "pubDate": "Thu, 26 Feb 2026 16:55:57 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/what-advice-did-you-receive-as-a-child-that-has-stayed-with-you/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Four things we learned making The Purpose Pioneers podcast",
    "link": "https://www.positive.news/society/four-things-we-learned-making-the-purpose-pioneers-podcast/",
    "description": "From life-shifting encounters to small steps that help us “eat the elephant”: the things we learned from our new podcast guests \nThe post Four things we learned making The Purpose Pioneers podcast appeared first on Positive News.",
    "pubDate": "Thu, 26 Feb 2026 07:00:00 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/four-things-we-learned-making-the-purpose-pioneers-podcast/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "How a football cup run helped unite a town",
    "link": "https://www.positive.news/society/how-a-football-cup-run-helped-unite-a-town/",
    "description": "For a club rooted in non-league football, Macclesfield’s recent FA Cup didn't just connect those on the pitch, but a whole community\nThe post How a football cup run helped unite a town appeared first on Positive News.",
    "pubDate": "Fri, 20 Feb 2026 07:17:01 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/how-a-football-cup-run-helped-unite-a-town/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Fish biology inspires laundry microplastics clean up",
    "link": "https://www.positive.news/environment/fish-biology-inspires-laundry-microplastics-clean-up/",
    "description": "Inspired by marine life, inventors have created a filter to trap pesky microplastics leaked during laundry\nThe post Fish biology inspires laundry microplastics clean up appeared first on Positive News.",
    "pubDate": "Wed, 18 Feb 2026 07:00:39 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/environment/fish-biology-inspires-laundry-microplastics-clean-up/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "How species spotting took hold of a rural community",
    "link": "https://www.positive.news/society/how-species-spotting-took-hold-rural-community/",
    "description": "A village in north Somerset has got passionate about rare species spotting, thanks to the efforts of Yeo Valley Organic \nThe post How species spotting took hold of a rural community appeared first on Positive News.",
    "pubDate": "Tue, 17 Feb 2026 14:54:50 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/how-species-spotting-took-hold-rural-community/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny",
    "link": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-28-2026/",
    "description": "Our partner Rob Brezsny, who has a new book out, Astrology Is Real: Revelations from My Life as an Oracle, provides his weekly wisdom to enlighten our thinking and motivate our mood. Rob’s Free Will Astrology, is a syndicated weekly column appearing in over a hundred publications. He is also the author of Pronoia Is the Antidote […]\nThe post Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny appeared first on Good News Network.",
    "pubDate": "Sat, 28 Feb 2026 11:00:12 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-28-2026/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 28",
    "link": "https://www.goodnewsnetwork.org/events070228/",
    "description": "2,228 years ago today, the Gaozu Emperor (given name Liu Bang) claimed the Mandate of Heaven and established the Han Dynasty—one of the three great dynasties of a unified Imperial China. Among the hundreds of Chinese emperors, Liu Bang was among the few born to a peasant family. Though he ruled briefly—just 7 years—it was […]\nThe post Good News in History, February 28 appeared first on Good News Network.",
    "pubDate": "Sat, 28 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070228/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 27",
    "link": "https://www.goodnewsnetwork.org/events070227/",
    "description": "30 years ago today, the world of Pokémon went public, emerging from the mind of game designer Satoshi Tajiri onto Nintendo Gameboy systems. In the six years it took to create the game and its first three “pocket monsters” (Bulbasaur, Squirtle, and Charmander), Tajiri’s Game Freak studio nearly went out of business, but the little […]\nThe post Good News in History, February 27 appeared first on Good News Network.",
    "pubDate": "Fri, 27 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070227/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Vacation Film Forgotten in 70-yo Vintage Camera Was Developed for the First Time: Do You Know These Skiers?",
    "link": "https://www.goodnewsnetwork.org/vacation-film-forgotten-in-70-yo-vintage-camera-was-developed-for-the-first-time-do-you-know-these-skiers/",
    "description": "From the charming British countryside of Salisbury comes an equally-charming story of a roll of lost film found lodged in a thrift shop camera. Developed by Ian Scott of Salisbury Photo Center, he and the new owner of the antique camera were suddenly looking at crisp memories of a skiing trip to St. Moritz, Switzerland. […]\nThe post Vacation Film Forgotten in 70-yo Vintage Camera Was Developed for the First Time: Do You Know These Skiers? appeared first on Good News Network.",
    "pubDate": "Thu, 26 Feb 2026 19:30:40 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/vacation-film-forgotten-in-70-yo-vintage-camera-was-developed-for-the-first-time-do-you-know-these-skiers/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Scientists Wanted Eco-Friendly Battery, Realized They Could Use the Brine Needed to Make Tofu",
    "link": "https://www.goodnewsnetwork.org/scientists-wanted-eco-friendly-battery-realized-they-could-use-the-brine-needed-to-make-tofu/",
    "description": "Capable of undergoing 120,000 charge cycles and being disposed of anywhere, an experimental new battery design might be thought of as truly state-of-the-art. To the contrary, the magnesium chloride or calcium chloride electrolytes used to carry the charge between the negative and positive electrodes were quite familiar to the Hong Kong-scientists that designed the battery […]\nThe post Scientists Wanted Eco-Friendly Battery, Realized They Could Use the Brine Needed to Make Tofu appeared first on Good News Network.",
    "pubDate": "Thu, 26 Feb 2026 16:30:41 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/scientists-wanted-eco-friendly-battery-realized-they-could-use-the-brine-needed-to-make-tofu/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "After Soccer Ball Slams into Seagull, Watch a Player Use CPR to Gently Revive it (WATCH)",
    "link": "https://www.goodnewsnetwork.org/after-goalkeeper-kicks-ball-into-a-seagull-his-teammate-employs-cpr-to-revive-the-bird-watch/",
    "description": "A soccer player for an amateur league team in Istanbul had to unexpectedly deputize as an emergency veterinarian during a match in the Turkish city last weekend. The goalkeeper for a team playing in red went to boot the ball upfield, but instead left the entire pitch in shock when the ball traveled a mere […]\nThe post After Soccer Ball Slams into Seagull, Watch a Player Use CPR to Gently Revive it (WATCH) appeared first on Good News Network.",
    "pubDate": "Wed, 25 Feb 2026 16:30:08 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/after-goalkeeper-kicks-ball-into-a-seagull-his-teammate-employs-cpr-to-revive-the-bird-watch/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 25",
    "link": "https://www.goodnewsnetwork.org/events070225/",
    "description": "298 years ago today, John Wood the Younger, a famous British architect who gave the nation such famous works as the Royal Crescent and the Circus in Bath, was born. His craft and determination in succeeding in his father’s storied reputation as a Bath builder elevated the cityscape to be one of the most striking […]\nThe post Good News in History, February 25 appeared first on Good News Network.",
    "pubDate": "Wed, 25 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070225/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Jewish Cemeteries Giving Life to Morocco’s Muslim Communities",
    "link": "https://reasonstobecheerful.world/morocco-jewish-cemeteries-give-life-to-muslim-farms/",
    "description": "Something special is taking place in Akrich, a typical rural village in Morocco backed by a breathtaking view of the snow-capped Atlas Mountains. Here is a compelling showcase of interfaith harmony, reinvigorated in recent years but dating back centuries. Today, the village’s sacred 700-year-old Jewish cemetery is home to a...\nThe post The Jewish Cemeteries Giving Life to Morocco’s Muslim Communities appeared first on Reasons to be Cheerful.",
    "pubDate": "Fri, 27 Feb 2026 08:00:05 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/morocco-jewish-cemeteries-give-life-to-muslim-farms/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Teens Teaching Grandma to Google",
    "link": "https://reasonstobecheerful.world/teens-teaching-grandma-to-google-hungary/",
    "description": "It’s three o’clock on a cold Budapest afternoon, and the sun is already dropping low on the horizon as 64-year-old Györgyi Petik Kis briskly makes her way to the Metropolitan Ervin Szabó Library. A beautiful neo-baroque palace, the building is home to the Hungarian capital’s largest public collection of books....\nThe post The Teens Teaching Grandma to Google appeared first on Reasons to be Cheerful.",
    "pubDate": "Tue, 24 Feb 2026 17:06:52 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/teens-teaching-grandma-to-google-hungary/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "From Clicks to Cleanups: Juba’s Youth-Led Waste Revolution",
    "link": "https://reasonstobecheerful.world/south-sudan-juba-youth-led-waste-revolution/",
    "description": "The first time Makur Majeng posted photos on social media of trash-clogged drainage ditches along the White Nile in Juba, the capital of South Sudan, his phone would not stop buzzing. “How can I help?” one message read. Within hours, 20 young people — many of whom had never met...\nThe post From Clicks to Cleanups: Juba’s Youth-Led Waste Revolution appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 23 Feb 2026 12:58:30 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/south-sudan-juba-youth-led-waste-revolution/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "A Recipe For Women’s Empowerment in Morocco",
    "link": "https://reasonstobecheerful.world/morocco-recipe-for-womens-empowerment/",
    "description": "All over the city of Marrakesh, football fever had taken hold. Africa’s continent-wide soccer competition, AFCON, was being hosted in Morocco. And here, at the Amal Targa Center, a fan zone had been set up for the big clash between Egypt and Benin. Yet the most impressive team performing that...\nThe post A Recipe For Women’s Empowerment in Morocco appeared first on Reasons to be Cheerful.",
    "pubDate": "Fri, 20 Feb 2026 12:50:39 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/morocco-recipe-for-womens-empowerment/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "What We’re Reading: A Carnival Clean-Up in New Orleans",
    "link": "https://reasonstobecheerful.world/what-were-reading-new-orleans-carnival-cleanup/",
    "description": "Welcome back to our weekly behind-the-scenes glimpse at what’s getting our team talking. Tell us what you’ve been reading at info@reasonstobecheerful.world and we just might feature it here. From plastic to petals Sequin-clad merrymakers filled the streets of New Orleans once more this week to celebrate Mardi Gras, the jubilant...\nThe post What We’re Reading: A Carnival Clean-Up in New Orleans appeared first on Reasons to be Cheerful.",
    "pubDate": "Wed, 18 Feb 2026 23:06:12 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/what-were-reading-new-orleans-carnival-cleanup/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "MIT study finds Earth’s first animals were likely ancient sea sponges",
    "link": "https://www.sciencedaily.com/releases/2026/02/260227071918.htm",
    "description": "Scientists at MIT have found compelling chemical evidence that Earth’s earliest animals were likely ancient sea sponges. Hidden inside rocks over 541 million years old are rare molecular “fingerprints” that match compounds made by modern demosponges. After testing rocks, living sponges, and lab-made molecules, researchers confirmed the signals came from life — not geology. The discovery suggests sponges were thriving in the oceans well before most other animal groups appeared.",
    "pubDate": "Fri, 27 Feb 2026 09:45:38 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260227071918.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "Scientists turn methane into medicine in stunning breakthrough",
    "link": "https://www.sciencedaily.com/releases/2026/02/260227071916.htm",
    "description": "Scientists have unveiled a breakthrough way to turn natural gas—long burned as fuel—into valuable chemical building blocks for medicines and other high-demand products. By designing a clever iron-based catalyst powered by LED light, researchers managed to activate stubborn molecules like methane and transform them into complex compounds, even creating the hormone therapy drug dimestrol directly from methane for the first time.",
    "pubDate": "Fri, 27 Feb 2026 10:51:30 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260227071916.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "Scientists reveal how exercise protects the brain from Alzheimer’s",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040752.htm",
    "description": "Exercise may sharpen the mind by repairing the brain’s protective shield. Researchers found that physical activity prompts the liver to release an enzyme that removes a harmful protein causing the blood-brain barrier to become leaky with age. In older mice, dialing down this protein reduced inflammation and improved memory. The discovery points to a surprising body-to-brain pathway that could inspire new Alzheimer’s therapies.",
    "pubDate": "Fri, 20 Feb 2026 10:19:43 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040752.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "Press Release: Acoziborole Winthrop, developed by DNDi and Sanofi, receives CHMP positive opinion as three-tablet, single-dose treatment for most common form of sleeping sickness",
    "link": "https://www.globenewswire.com/news-release/2026/02/27/3246379/0/en/Press-Release-Acoziborole-Winthrop-developed-by-DNDi-and-Sanofi-receives-CHMP-positive-opinion-as-three-tablet-single-dose-treatment-for-most-common-form-of-sleeping-sickness.html",
    "description": "A new therapy, given as a single dose of three tablets, could offer a simpler alternative to longer, more complex regimens for sleeping sickness. ...",
    "pubDate": "2026-02-27T10:55:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/27/3246379/0/en/Press-Release-Acoziborole-Winthrop-developed-by-DNDi-and-Sanofi-receives-CHMP-positive-opinion-as-three-tablet-single-dose-treatment-for-most-common-form-of-sleeping-sickness.html",
    "category": "health",
    "author": "Sanofi Winthrop Industrie",
    "positivityScore": 6
  },
  {
    "title": "Iberdrola sells 757MW French onshore renewables portfolio to Technique Solaire",
    "link": "https://www.power-technology.com/news/iberdrola-sells-renewables-portfolio-technique-solaire/",
    "description": "The transaction includes operating wind farms and a substantial development pipeline of wind and solar projects in France.",
    "pubDate": "2026-02-25T11:23:20Z",
    "source": "Power Technology",
    "sourceUrl": "https://www.power-technology.com/news/iberdrola-sells-renewables-portfolio-technique-solaire/",
    "category": "climate",
    "author": "Anwesha Pattanaik",
    "positivityScore": 6
  },
  {
    "title": "METLEN undertakes a new 198 MW hybrid project in the United Kingdom",
    "link": "https://www.naftemporiki.gr/english/2076961/metlen-undertakes-a-new-198-mw-hybrid-project-in-the-united-kingdom/",
    "description": "METLEN continues to advance the United Kingdom’s energy transition through the delivery of integrated renewable energy projects that combine clean energy generation, battery storage and grid integration. The Bumble Bee…\nMETLEN undertakes a new 198 MW hybrid p…",
    "pubDate": "2026-02-25T10:29:31Z",
    "source": "Naftemporiki.gr",
    "sourceUrl": "https://www.naftemporiki.gr/english/2076961/metlen-undertakes-a-new-198-mw-hybrid-project-in-the-united-kingdom/",
    "category": "climate",
    "author": "Μιχάλης Ματσίγκος",
    "positivityScore": 6
  },
  {
    "title": "'Horrible news for conservation': N.S. approach to land protection raises concerns",
    "link": "https://www.cbc.ca/news/canada/nova-scotia/land-protection-conservation-tim-halman-iain-rankin-parks-and-wilderness-9.7107900",
    "description": "Nova Scotia’s environment minister revealed Thursday that his government has increased the amount of protected land in the province, but it’s not in a way that sits well with environmentalists or the interim Liberal leader.",
    "pubDate": "2026-02-27T14:15:31Z",
    "source": "CBC News",
    "sourceUrl": "https://www.cbc.ca/news/canada/nova-scotia/land-protection-conservation-tim-halman-iain-rankin-parks-and-wilderness-9.7107900",
    "category": "wildlife",
    "author": null,
    "positivityScore": 6
  },
  {
    "title": "Quote of the day by Audrey Hepburn: ‘As you grow older, you will discover that you have two hands, one for helping…’",
    "link": "https://economictimes.indiatimes.com/news/international/us/quote-of-the-day-february-24-quote-of-the-day-by-audrey-hepburn-as-you-grow-older-you-will-discover-that-you-have-two-hands-one-for-helping/articleshow/128747800.cms",
    "description": "Quote of the day by Audrey Hepburn shows that true elegance lies not only in appearance or achievement, but in generosity of spirit.",
    "pubDate": "2026-02-24T10:25:01Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/international/us/quote-of-the-day-february-24-quote-of-the-day-by-audrey-hepburn-as-you-grow-older-you-will-discover-that-you-have-two-hands-one-for-helping/articleshow/128747800.cms",
    "category": "people",
    "author": "Aastha Raj",
    "positivityScore": 6
  },
  {
    "title": "Scientists discover microbe that breaks a fundamental rule of the genetic code",
    "link": "https://www.sciencedaily.com/releases/2026/02/260227071920.htm",
    "description": "Scientists at UC Berkeley have discovered a microbe that bends one of biology’s most sacred rules. Instead of treating a specific three-letter DNA code as a clear “stop” signal, this methane-producing archaeon sometimes reads it as a green light—adding an unusual amino acid and continuing to build the protein. The result is a kind of genetic coin flip: two different proteins can emerge from the same code, influenced partly by environmental conditions.",
    "pubDate": "Sat, 28 Feb 2026 01:47:32 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260227071920.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Hidden architecture inside cellular droplets opens new targets for cancer and ALS",
    "link": "https://www.sciencedaily.com/releases/2026/02/260226042447.htm",
    "description": "Biomolecular condensates were long believed to be simple liquid blobs inside cells. Researchers have now uncovered that some are actually supported by fine protein filaments forming an internal scaffold. When this structure is disrupted, cells fail to grow and divide properly. The discovery suggests scientists may one day design drugs that target condensate architecture to fight cancer and neurodegenerative disease.",
    "pubDate": "Thu, 26 Feb 2026 09:36:27 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260226042447.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Scientists finally solve the mystery of the horse whinny",
    "link": "https://www.sciencedaily.com/releases/2026/02/260225001256.htm",
    "description": "Horses have a vocal trick no one fully understood until now. Scientists have discovered that when a horse whinnies, it produces two completely different sounds at the same time. One is a deep tone created by vibrating the vocal folds, similar to how humans sing. The other is a high-pitched whistle generated inside the larynx, something never before confirmed in a large mammal. This rare ability, known as biphonation, likely helps horses send multiple emotional signals in a single call.",
    "pubDate": "Wed, 25 Feb 2026 04:01:40 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260225001256.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "190-million-year-old “Sword Dragon” fossil rewrites ichthyosaur history",
    "link": "https://www.sciencedaily.com/releases/2026/02/260224023218.htm",
    "description": "A newly identified ichthyosaur from the UK’s Jurassic Coast is rewriting part of the prehistoric playbook. Nicknamed the “Sword Dragon of Dorset,” the three-meter-long marine reptile lived during a poorly understood window of evolution when major ichthyosaur groups were disappearing and new ones emerging. Its beautifully preserved skeleton — complete with a blade-like snout and possible last meal — helps pinpoint when this dramatic transition occurred.",
    "pubDate": "Tue, 24 Feb 2026 07:50:35 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260224023218.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Can solar storms trigger earthquakes? Scientists propose surprising link",
    "link": "https://www.sciencedaily.com/releases/2026/02/260224023209.htm",
    "description": "Scientists have proposed a surprising connection between solar flares and earthquakes. When solar activity disturbs the ionosphere, it may generate electric fields that penetrate fragile fracture zones in Earth’s crust. If a fault is already critically stressed, this extra electrostatic pressure could help trigger a quake. The idea doesn’t claim direct causation, but it offers a fresh way to think about how space weather and seismic events might interact.",
    "pubDate": "Tue, 24 Feb 2026 09:09:35 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260224023209.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Schrödinger’s color theory finally completed after 100 years",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222092302.htm",
    "description": "A century after Erwin Schrödinger sketched out a bold vision for how we perceive color, scientists have finally filled in the missing pieces. A Los Alamos team used advanced geometry to show that hue, saturation, and lightness aren’t shaped by culture or experience — they’re built directly into the mathematical structure of how we see color. By defining a crucial missing element known as the “neutral axis,” the researchers repaired a long-standing flaw in Schrödinger’s model and even corrected tricky visual quirks like the way brightness can subtly shift perceived hue.",
    "pubDate": "Mon, 23 Feb 2026 10:24:39 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222092302.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Scientists just mapped mysterious earthquakes deep inside Earth",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040818.htm",
    "description": "Scientists at Stanford have unveiled the first-ever global map of rare earthquakes that rumble deep within Earth’s mantle rather than its crust. Long debated and notoriously difficult to confirm, these elusive quakes turn out to cluster in regions like the Himalayas and near the Bering Strait. By developing a breakthrough method that distinguishes mantle quakes using subtle differences in seismic waves, researchers identified hundreds of these hidden tremors worldwide.",
    "pubDate": "Fri, 20 Feb 2026 08:05:28 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040818.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "A spinning gyroscope could finally unlock ocean wave energy",
    "link": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
    "description": "Ocean waves are a vast and steady source of renewable energy, but capturing their power efficiently has long frustrated engineers. A researcher at The University of Osaka has now explored a bold new approach: a gyroscopic wave energy converter that uses a spinning flywheel inside a floating structure to turn wave motion into electricity. By harnessing gyroscopic precession—the subtle wobble of a spinning object under force—the system can be tuned to absorb energy across a wide range of wave conditions.",
    "pubDate": "Wed, 18 Feb 2026 09:33:28 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "NASA fired three rockets into the northern lights and the results are stunning",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005738.htm",
    "description": "NASA has pulled off a high-flying aurora investigation, launching three rockets into the glowing northern lights over Alaska. One mission targeted mysterious dark patches called black auroras, while the twin GNEISS rockets created a 3D scan of the aurora’s electrical currents. All rockets reached their planned altitudes and returned strong data. The result: an unprecedented look at how these dazzling light shows are wired from space to sky.",
    "pubDate": "Tue, 17 Feb 2026 23:19:32 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005738.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Doctors implant dopamine-producing stem cells in Parkinson’s patients",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040820.htm",
    "description": "A groundbreaking clinical trial is testing whether specially engineered stem cells can help the brain restore its own dopamine production in people with Parkinson’s disease. Because the condition is driven by the gradual loss of dopamine-producing cells—leading to tremors, stiffness, and slowed movement—researchers are implanting lab-grown cells directly into the brain’s movement center to replace what’s been lost.",
    "pubDate": "Fri, 20 Feb 2026 04:03:58 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040820.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Viagra and shingles vaccine show surprising promise against Alzheimer’s",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005759.htm",
    "description": "A major new study has spotlighted three familiar medicines that could take on an unexpected new role in the fight against Alzheimer’s disease — with a shingles vaccine emerging as the front-runner. After reviewing 80 existing drugs, an international panel of experts identified Zostavax, Viagra (sildenafil), and riluzole as the most promising candidates for repurposing.",
    "pubDate": "Wed, 18 Feb 2026 07:02:28 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005759.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "World-first stem-cell therapy shows promise for treating spina bifida in the womb",
    "link": "https://www.nature.com/articles/d41586-026-00602-z",
    "description": "",
    "pubDate": "2026-02-26T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00602-z",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "Earth's heat to power 10,000 homes in renewable energy first for UK",
    "link": "https://www.bbc.com/news/articles/cewzg77k721o?at_medium=RSS&at_campaign=rss",
    "description": "Water super-heated by rocks will also provide the UK's first domestic supply of the critical mineral lithium.",
    "pubDate": "Thu, 26 Feb 2026 11:51:40 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cewzg77k721o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "Beaver 'engineers' released to create wetlands",
    "link": "https://www.bbc.com/news/articles/cly896y1zj9o?at_medium=RSS&at_campaign=rss",
    "description": "A family of beavers have been brought from Scotland to improve biodiversity in a Lincolnshire river.",
    "pubDate": "Thu, 26 Feb 2026 06:11:48 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cly896y1zj9o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "NASA’s Nuclear Propulsion Milestones: The Breakthrough That Could Redefine Deep Space Travel",
    "link": "https://economictimes.indiatimes.com/news/international/us/nasas-nuclear-propulsion-milestones-the-breakthrough-that-could-redefine-deep-space-travel/articleshow/128842549.cms",
    "description": "India's space program is looking at nuclear propulsion. This technology promises faster travel to Mars and beyond. It uses nuclear reactors to heat propellant, doubling efficiency. Recent tests show this concept is becoming a reality. This could revolutionize…",
    "pubDate": "2026-02-27T09:33:57Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/international/us/nasas-nuclear-propulsion-milestones-the-breakthrough-that-could-redefine-deep-space-travel/articleshow/128842549.cms",
    "category": "science",
    "author": "Global Desk",
    "positivityScore": 4
  },
  {
    "title": "A conversational agent as a virtual therapist for patients diagnosed with schizophrenia: A preliminary study",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343519",
    "description": "Introduction Schizophrenia is a complex mental disorder characterized by disturbances in thinking, emotions, and behavior. Emotional dysregulation is a significant clinical issue. Recent years have seen growing interest in the use of conversational agents in …",
    "pubDate": "2026-02-27T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343519",
    "category": "health",
    "author": "Izabela Stefaniak, Karolina Gabor-Siatkowska, Marek Kozłowski, Artur Janicki",
    "positivityScore": 4
  },
  {
    "title": "PRRSV-2 impedes lysosomes from eliminating secondary infected bacteria",
    "link": "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1014000",
    "description": "Author summary Since its first discovery in the 1980s, porcine reproductive and respiratory syndrome virus type 2 (PRRSV-2) has caused incalculable economic damage to the global pig industry. Due to the immunosuppressive characteristics of PRRSV-2, co-infecti…",
    "pubDate": "2026-02-27T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1014000",
    "category": "health",
    "author": "Zifang Zheng, Xue Ling, Shuang Qiao, Jie Wu, Shuangquan Zhang, Xiao Liu, Yang Li, Caiyun Xie, Zhiqian Ma, Xuyang Guo, Zhiwei Li, Yingtong Feng, Lele Xu, Jianwu Zhang, Haixue Zheng, Shuqi Xiao",
    "positivityScore": 4
  },
  {
    "title": "Ethnopharmocological study of medicinal plants used for treatment of skin diseases by herbalists in Northwestern region of Algeria",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343714",
    "description": "Background Skin disease is a major public health concern worldwide, particularly in developing countries. Despite the rich diversity of medicinal plants and strong traditional healing practices in Algeria, the dependence on imported pharmaceuticals remains hi…",
    "pubDate": "2026-02-27T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343714",
    "category": "health",
    "author": "Razika Hantour, Yasmina Benabdesslem, Mustapha Diaf, Kadda Hachem, Samia Ghomari",
    "positivityScore": 4
  },
  {
    "title": "Alpha-1 Antitrypsin Deficiency Research Report 2025-2035: Market Enters Growth Phase as Established Augmentation Therapies Converge with Advancing Gene and RNA Pipelines",
    "link": "https://www.globenewswire.com/news-release/2026/02/27/3246403/28124/en/Alpha-1-Antitrypsin-Deficiency-Research-Report-2025-2035-Market-Enters-Growth-Phase-as-Established-Augmentation-Therapies-Converge-with-Advancing-Gene-and-RNA-Pipelines.html",
    "description": "Alpha-1 Antitrypsin Deficiency (AATD) is a rare genetic disorder caused by SERPINA1 gene mutations, leading to conditions like pulmonary emphysema and liver dysfunction. The AATD market is in its growth stage, fueled by increased R&D in protein augmentation, …",
    "pubDate": "2026-02-27T11:31:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/27/3246403/28124/en/Alpha-1-Antitrypsin-Deficiency-Research-Report-2025-2035-Market-Enters-Growth-Phase-as-Established-Augmentation-Therapies-Converge-with-Advancing-Gene-and-RNA-Pipelines.html",
    "category": "health",
    "author": "Research and Markets",
    "positivityScore": 4
  },
  {
    "title": "We Didn’t Just Get Expensive Electricity. We Built a System That Makes It Inevitable.",
    "link": "https://wattsupwiththat.com/2026/02/27/we-didnt-just-get-expensive-electricity-we-built-a-system-that-makes-it-inevitable/",
    "description": "Electricity is not a luxury. It is a necessity that underpins economic growth, public safety, and household stability. Ensuring its affordability requires more than promises. It requires policies that encourage efficient investment, allocate risk appropriatel…",
    "pubDate": "2026-02-27T14:00:00Z",
    "source": "Wattsupwiththat.com",
    "sourceUrl": "https://wattsupwiththat.com/2026/02/27/we-didnt-just-get-expensive-electricity-we-built-a-system-that-makes-it-inevitable/",
    "category": "climate",
    "author": "Guest Blogger",
    "positivityScore": 4
  },
  {
    "title": "Rethinking performance crises in professional soccer: German coaches’ insights into systemic vulnerabilities and escalating dynamics",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343985",
    "description": "Professional soccer, as a global phenomenon, is characterized not only by outstanding performances but also by frequent and sometimes prolonged periods of underperformance, which represent performance crises. Despite the growing body of research on performanc…",
    "pubDate": "2026-02-27T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343985",
    "category": "climate",
    "author": "Constantin Rausch, Julian Fritsch, Stefan Altmann, Jan Spielmann, Lena Steindorf, Darko Jekauc",
    "positivityScore": 4
  },
  {
    "title": "Clean Energy Developer ThomasLloyd to Go Public Via SPAC Deal",
    "link": "https://financialpost.com/pmn/business-pmn/clean-energy-developer-thomaslloyd-to-go-public-via-spac-deal",
    "description": "ThomasLloyd Climate Solutions has agreed to merge with a blank-check company in a deal that will allow the European-based clean energy developer to enter the booming US market for powering data centers.",
    "pubDate": "2026-02-27T10:20:21Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/pmn/business-pmn/clean-energy-developer-thomaslloyd-to-go-public-via-spac-deal",
    "category": "climate",
    "author": "Bloomberg News",
    "positivityScore": 4
  },
  {
    "title": "Bankruptcy Court approves Raigarh Champa rail infrastructure’s acquisition by JSW Energy",
    "link": "https://economictimes.indiatimes.com/industry/indl-goods/svs/construction/bankruptcy-court-approves-raigarh-champa-rail-infrastructures-acquisition-by-jsw-energy/articleshow/128847607.cms",
    "description": "The National Company Law Tribunal (NCLT) has approved JSW Energy Ltd’s acquisition of Raigarh Champa Rail Infrastructure (RCRIPL) via the insolvency resolution process. The Sajjan Jindal-led company proposed a Rs 700 crore revival plan against admitted liabil…",
    "pubDate": "2026-02-27T11:40:06Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/industry/indl-goods/svs/construction/bankruptcy-court-approves-raigarh-champa-rail-infrastructures-acquisition-by-jsw-energy/articleshow/128847607.cms",
    "category": "climate",
    "author": "Maulik Vyas",
    "positivityScore": 4
  },
  {
    "title": "Türkiye ranked second in Europe for wind power installations in 2025",
    "link": "https://www.hurriyetdailynews.com/turkiye-ranked-second-in-europe-for-wind-power-installations-in-2025-219381",
    "description": "Türkiye became the second-largest country in Europe for new wind power installations last year, adding 2,142 megawatts (MW) of new capacity, trailing only Germany, according to WindEurope data.",
    "pubDate": "2026-02-27T09:38:25Z",
    "source": "Hurriyet Daily News",
    "sourceUrl": "https://www.hurriyetdailynews.com/turkiye-ranked-second-in-europe-for-wind-power-installations-in-2025-219381",
    "category": "climate",
    "author": "hurriyetdailynews.com",
    "positivityScore": 4
  },
  {
    "title": "Indonesia enhances Komodo protection with conservation action plan",
    "link": "https://en.antaranews.com/news/406346/indonesia-enhances-komodo-protection-with-conservation-action-plan",
    "description": "The Indonesian government is enhancing efforts to protect Komodo dragons with the Komodo Conservation Strategy and Action Plan (SRAK), which serves as a ...",
    "pubDate": "2026-02-27T09:02:26Z",
    "source": "Antaranews.com",
    "sourceUrl": "https://en.antaranews.com/news/406346/indonesia-enhances-komodo-protection-with-conservation-action-plan",
    "category": "wildlife",
    "author": "M Fikri, Raka Adji",
    "positivityScore": 4
  },
  {
    "title": "What are 5 facts about eagles?",
    "link": "https://www.lifesciencesworld.com/what-are-5-facts-about-eagles/",
    "description": "What are 5 Amazing Facts About Eagles? Discover five fascinating facts about eagles, showcasing their incredible hunting prowess, lifespan, unique behaviors, physical characteristics, and conservation status. This article delivers a concise overview and offer…",
    "pubDate": "2026-02-27T08:14:49Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-are-5-facts-about-eagles/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "Indonesia, UK advance climate financing for elephants in Aceh",
    "link": "https://en.antaranews.com/news/406358/indonesia-uk-advance-climate-financing-for-elephants-in-aceh",
    "description": "Indonesia and the United Kingdom are prioritizing innovative landscape-based financing through the Peusangan Elephant Conservation Initiative (PECI) in Aceh ...",
    "pubDate": "2026-02-27T09:37:47Z",
    "source": "Antaranews.com",
    "sourceUrl": "https://en.antaranews.com/news/406358/indonesia-uk-advance-climate-financing-for-elephants-in-aceh",
    "category": "wildlife",
    "author": "Arnidhya Nur Z, Resinta Sulistiyandari",
    "positivityScore": 4
  },
  {
    "title": "Judge orders Greenpeace to pay $345m over Dakota Access pipeline protest",
    "link": "https://www.theguardian.com/us-news/2026/feb/25/greenpeace-dakota-access-pipeline-protest",
    "description": "Group says case far from over after being found liable for defamation and other claims brought by energy firm\nA North Dakota judge has said he will order Greenpeace to pay damages expected to total $345m in connection with protests against the Dakota Access oil pipeline from nearly a decade ago, a figure the environmental group contends it cannot pay.\nIn court papers filed on Tuesday, Judge James Gion said he would sign an order requiring several Greenpeace entities to pay the judgment to pipeline company Energy Transfer. He set that amount at $345m last year in a decision that reduced a jury’s damages by about half, but his latest filing did not specify a final amount.\n Continue reading...",
    "pubDate": "Wed, 25 Feb 2026 23:55:41 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2026/feb/25/greenpeace-dakota-access-pipeline-protest",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Stunning 3D maps reveal DNA is structured before life “switches on”",
    "link": "https://www.sciencedaily.com/releases/2026/02/260227061824.htm",
    "description": "For decades, scientists believed a fertilized egg’s DNA began as a shapeless mass, only organizing itself once the embryo switched on its genes. But new research reveals that the genome is already carefully arranged in three dimensions long before that critical activation step, known as Zygotic Genome Activation. Using a powerful new method called Pico-C, researchers captured this hidden DNA architecture in unprecedented detail, showing that a complex scaffold is built early to control which genes will later turn on.",
    "pubDate": "Fri, 27 Feb 2026 06:18:24 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260227061824.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "40,000-year-old signs show humans were recording information long before writing",
    "link": "https://www.sciencedaily.com/releases/2026/02/260225001301.htm",
    "description": "More than 40,000 years ago, Ice Age humans were carving repeated patterns of dots, lines, and crosses into tools and small ivory figurines. A new computational study of more than 3,000 of these Paleolithic signs reveals that they were not random decorations but structured sequences with measurable complexity. Surprisingly, their information density rivals that of proto-cuneiform, the earliest known writing system that emerged around 3,000 B.C.E.",
    "pubDate": "Wed, 25 Feb 2026 00:52:18 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260225001301.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Congo basin blackwater lakes are releasing ancient carbon into the atmosphere",
    "link": "https://www.sciencedaily.com/releases/2026/02/260224023201.htm",
    "description": "Deep in the Congo Basin, vast peatlands quietly store enormous amounts of Earth’s carbon — but new research suggests this ancient vault may be leaking. Scientists studying Africa’s largest blackwater lakes discovered that significant amounts of carbon dioxide bubbling into the atmosphere come not just from recent plant life, but from peat that has been locked away for thousands of years.",
    "pubDate": "Tue, 24 Feb 2026 08:16:20 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260224023201.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Flea and tick treatments for dogs and cats may be harming wildlife",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000328.htm",
    "description": "Flea and tick medications trusted by pet owners worldwide may have an unexpected environmental cost. Scientists found that active ingredients from isoxazoline treatments pass into pet feces, exposing dung-feeding insects to toxic chemicals. These insects are essential for nutrient cycling and soil health. The findings suggest everyday pet treatments could ripple through ecosystems in surprising ways.",
    "pubDate": "Sun, 22 Feb 2026 01:24:32 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000328.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "A simple water shift could turn Arctic farmland into a carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000325.htm",
    "description": "Deep in the Arctic north, drained peatlands—once massive carbon vaults built over thousands of years—are quietly leaking greenhouse gases into the atmosphere. But new field research from northern Norway suggests there’s a powerful way to slow that loss: raise the water level. In a two-year study, scientists found that restoring higher groundwater levels in cultivated Arctic peatlands dramatically cut carbon dioxide emissions, and in some cases even tipped the balance so the land absorbed more CO₂ than it released.",
    "pubDate": "Sun, 22 Feb 2026 02:51:51 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000325.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Ancient microbes may have used oxygen 500 million years before it filled Earth’s atmosphere",
    "link": "https://www.sciencedaily.com/releases/2026/02/260218031609.htm",
    "description": "Life on Earth may have learned to breathe oxygen long before oxygen filled the skies. MIT researchers traced a key oxygen-processing enzyme back hundreds of millions of years before the Great Oxidation Event. Early microbes living near oxygen-producing cyanobacteria may have quickly used up the gas as it formed, slowing its rise in the atmosphere. The results suggest life was adapting to oxygen far earlier — and far more creatively — than once thought.",
    "pubDate": "Wed, 18 Feb 2026 03:50:31 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260218031609.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Microplastics have reached Antarctica’s only native insect",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "description": "Even Antarctica’s toughest native insect can’t escape the reach of plastic pollution. Scientists have discovered that Belgica antarctica — a tiny, rice-sized midge and the southernmost insect on Earth — is already ingesting microplastics in the wild. While lab tests showed the hardy larvae can survive short-term exposure without obvious harm, those exposed to higher plastic levels had reduced fat reserves, hinting at hidden energy costs.",
    "pubDate": "Mon, 16 Feb 2026 07:48:45 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Yellowstone wolves may not have transformed the national park after all",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "description": "A new scientific review challenges the headline-grabbing claim that Yellowstone’s returning wolves triggered one of the strongest trophic cascades on Earth. Researchers found that the reported 1,500% surge in willow growth was based on circular calculations and questionable comparisons. After correcting for modeling and sampling flaws, the supposed ecosystem-wide boom largely disappears.",
    "pubDate": "Thu, 12 Feb 2026 08:51:03 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Scientists discover diet that tricks the body into burning fat without exercise",
    "link": "https://www.sciencedaily.com/releases/2026/02/260227071914.htm",
    "description": "Researchers found that cutting two amino acids common in animal protein—methionine and cysteine—made mice burn significantly more energy. The boost in heat production was nearly as powerful as constant exposure to cold temperatures. The mice didn’t eat less or exercise more; they simply generated more heat in their beige fat. The discovery hints that diet alone might activate the body’s calorie-burning machinery.",
    "pubDate": "Fri, 27 Feb 2026 13:05:43 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260227071914.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Iron outperforms rare metals in stunning chemistry advance",
    "link": "https://www.sciencedaily.com/releases/2026/02/260227061821.htm",
    "description": "Researchers at Nagoya University have created a more efficient iron-based photocatalyst that could reduce the need for rare and expensive metals in advanced chemistry. Unlike earlier designs, the new catalyst uses far fewer costly chiral ligands while still precisely controlling the three dimensional structure of molecules.",
    "pubDate": "Fri, 27 Feb 2026 11:08:10 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260227061821.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Shingles vaccine may slow biological aging and reduce inflammation",
    "link": "https://www.sciencedaily.com/releases/2026/02/260225081153.htm",
    "description": "A shingles shot might do more than prevent a painful rash — it could actually help slow down the aging process. In a large national study of more than 3,800 Americans age 70 and older, those who received the shingles vaccine showed slower biological aging compared to those who didn’t. Researchers found lower levels of chronic inflammation and slower changes in gene activity linked to aging, suggesting the vaccine may calm the body’s “inflammaging” — the low-grade inflammation tied to heart disease, frailty, and cognitive decline.",
    "pubDate": "Thu, 26 Feb 2026 02:47:45 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260225081153.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists discover hidden sugar layer behind psoriasis",
    "link": "https://www.sciencedaily.com/releases/2026/02/260225081142.htm",
    "description": "A gel-like sugar coating on immune cells has been found to play a starring role in psoriasis. Researchers discovered that immune cells shed this outer layer to help them exit the bloodstream and enter inflamed skin. This challenges the long-held idea that only blood vessel walls changed during this process. The finding could help guide new therapies aimed at controlling harmful inflammation.",
    "pubDate": "Wed, 25 Feb 2026 08:11:42 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260225081142.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Microplastics found in 90% of prostate cancer tumors, study reveals",
    "link": "https://www.sciencedaily.com/releases/2026/02/260225001250.htm",
    "description": "Researchers have detected microplastics in nearly all prostate cancer tumors examined in a new study. Tumor tissue contained about 2.5 times more plastic than nearby healthy prostate tissue. Scientists say this is the first Western study to directly measure plastic particles in prostate tumors. More research is needed, but the findings suggest microplastic exposure could play a role in cancer development.",
    "pubDate": "Wed, 25 Feb 2026 01:28:19 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260225001250.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Simple blood test can forecast Alzheimer’s years before memory loss",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222085203.htm",
    "description": "Scientists have created a blood test that can estimate when Alzheimer’s symptoms are likely to begin. By measuring a protein called p-tau217, the model predicts symptom onset within roughly three to four years. The protein mirrors the silent buildup of amyloid and tau in the brain long before memory loss appears. This advance could speed up preventive drug trials and eventually guide personalized care.",
    "pubDate": "Mon, 23 Feb 2026 06:46:07 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222085203.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Air pollution linked to higher Alzheimer’s risk in 28 million older Americans",
    "link": "https://www.sciencedaily.com/releases/2026/02/260220010836.htm",
    "description": "Breathing polluted air may do more than harm your lungs — it could also increase your risk of Alzheimer’s disease. In a sweeping study of nearly 28 million older Americans, researchers found that long term exposure to fine particle air pollution was linked to a higher likelihood of developing Alzheimer’s. The connection appeared to stem largely from pollution’s direct effects on the brain, rather than through related health conditions like hypertension or depression.",
    "pubDate": "Fri, 20 Feb 2026 01:47:05 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260220010836.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists reveal why human language isn’t like computer code",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040811.htm",
    "description": "Human language may seem messy and inefficient compared to the ultra-compact strings of ones and zeros used by computers—but our brains actually prefer it that way. New research reveals that while digital-style encoding could theoretically compress information more tightly, it would demand far more mental effort from both speaker and listener. Instead, language is built around familiar words and predictable patterns that reflect our real-world experiences, allowing the brain to constantly anticipate what comes next and narrow down meaning step by step.",
    "pubDate": "Fri, 20 Feb 2026 09:23:24 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040811.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Daily briefing: Stem-cell treatment strengthens people with age-related frailty",
    "link": "https://www.nature.com/articles/d41586-026-00672-z",
    "description": "",
    "pubDate": "2026-02-26T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00672-z",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "First writing may be 40,000 years earlier than thought",
    "link": "https://www.bbc.com/news/articles/cvgknj7yyv2o?at_medium=RSS&at_campaign=rss",
    "description": "Scientists believe they have found evidence of written thoughts of Stone Age people on ancient objects.",
    "pubDate": "Thu, 26 Feb 2026 12:02:06 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cvgknj7yyv2o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Marine strategy must deliver action for seabirds, charity says",
    "link": "https://www.bbc.com/news/articles/c6269964md0o?at_medium=RSS&at_campaign=rss",
    "description": "The updated strategy should mean areas like Strangford Lough will be better protected in five years' time.",
    "pubDate": "Sat, 28 Feb 2026 07:00:39 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c6269964md0o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Apollo rocks reveal the Moon had brief bursts of super-strong magnetism",
    "link": "https://www.sciencedaily.com/releases/2026/02/260226042445.htm",
    "description": "Scientists at the University of Oxford have finally settled a decades-long mystery about the Moon’s magnetic field — and it turns out both sides were right. By reanalyzing Apollo mission rocks, they discovered that the Moon did occasionally generate an incredibly powerful magnetic field, even stronger than Earth’s — but only for fleeting bursts lasting thousands of years or less. Most of the time, the Moon’s magnetic field was weak.",
    "pubDate": "Thu, 26 Feb 2026 11:03:17 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260226042445.htm",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "A giant blade-crested spinosaurus, the “hell heron,” discovered in the Sahara",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222092251.htm",
    "description": "Deep in the heart of the Sahara, scientists have uncovered Spinosaurus mirabilis — a spectacular new predator crowned with a massive, scimitar-shaped crest that may once have blazed with color under the desert sun. Discovered in remote inland river deposits in Niger, the fossil rewrites what we thought we knew about spinosaur dinosaurs, suggesting they weren’t fully aquatic hunters but powerful waders stalking fish in forested waterways hundreds of miles from the sea.",
    "pubDate": "Mon, 23 Feb 2026 00:10:43 EST",
    "source": "Science Daily Animals",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222092251.htm",
    "category": "wildlife",
    "positivityScore": 2
  },
  {
    "title": "Triceratops had a giant nose that may have cooled its massive head",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000313.htm",
    "description": "Triceratops’ massive head may have been doing more than just showing off those famous horns. Using CT scans and 3D reconstructions of fossil skulls, researchers uncovered a surprisingly complex nasal system hidden inside its enormous snout. Instead of being just a supersized nose for smelling, it likely housed intricate networks of nerves and blood vessels—and even special structures that helped regulate heat and moisture.",
    "pubDate": "Sun, 22 Feb 2026 07:20:15 EST",
    "source": "Science Daily Animals",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000313.htm",
    "category": "wildlife",
    "positivityScore": 2
  },
  {
    "title": "Giant virus discovery could rewrite the origin of complex life",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040814.htm",
    "description": "A giant virus discovered in Japan is adding fuel to the provocative idea that viruses helped create complex life. Named ushikuvirus, it infects amoebae and shows unique traits that connect different families of giant DNA viruses. Its unusual way of hijacking and disrupting the host cell’s nucleus offers fresh insight into how viruses may have influenced the evolution of the cell nucleus itself. The finding deepens the mystery of viruses—and their possible role in life’s biggest leap.",
    "pubDate": "Thu, 19 Feb 2026 22:28:24 EST",
    "source": "Science Daily Animals",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040814.htm",
    "category": "wildlife",
    "positivityScore": 2
  },
  {
    "title": "How a teen’s AI model could help stop poaching in rainforests",
    "link": "https://www.scientificamerican.com/podcast/episode/how-a-teens-ai-model-could-help-stop-poaching-in-rainforests/",
    "description": "A 17-year-old’s breakthrough AI may finally give wildlife rangers the real-time edge they need to stop poachers",
    "pubDate": "2026-02-27T11:00:00Z",
    "source": "Scientific American",
    "sourceUrl": "https://www.scientificamerican.com/podcast/episode/how-a-teens-ai-model-could-help-stop-poaching-in-rainforests/",
    "category": "science",
    "author": "Melissa Hobson, Fonda Mwangi, Alex Sugiura, Kendra Pierre-Louis",
    "positivityScore": 2
  },
  {
    "title": "Lab grown gold: Is it possible to produce precious yellow metal like lab-grown diamonds?",
    "link": "https://economictimes.indiatimes.com/news/new-updates/lab-grown-gold-is-it-possible-to-produce-precious-yellow-metal-like-lab-grown-diamonds/articleshow/128844361.cms",
    "description": "Scientists can create gold in labs through complex nuclear reactions, altering elements like mercury or platinum. However, this process is astronomically expensive and yields microscopic amounts, making it impractical for jewellery or investment. Unlike lab-g…",
    "pubDate": "2026-02-27T10:12:43Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/new-updates/lab-grown-gold-is-it-possible-to-produce-precious-yellow-metal-like-lab-grown-diamonds/articleshow/128844361.cms",
    "category": "science",
    "author": "Trending Desk",
    "positivityScore": 2
  }
]