[
  {
    "title": "Government rolls back nature protections to boost housing",
    "link": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "description": "Critics say government changes to a flagship biodiversity policy could stall nature recovery.",
    "pubDate": "Tue, 16 Dec 2025 17:51:04 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 8
  },
  {
    "title": "What is the cure for insulinoma?",
    "link": "https://www.lifesciencesworld.com/what-is-the-cure-for-insulinoma/",
    "description": "What is the Cure for Insulinoma? The primary, and often only, cure for an insulinoma is surgical removal of the tumor. While other treatments can manage symptoms, definitive cure is typically achieved through successful surgical resection. Introduction: Under…",
    "pubDate": "2026-02-14T01:44:25Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-is-the-cure-for-insulinoma/",
    "category": "health",
    "author": "Noah Whitman",
    "positivityScore": 8
  },
  {
    "title": "Brits Travel to Town Called Lover to Send Valentine’s Day Cards From World’s Most Romantic Post Office",
    "link": "https://www.goodnewsnetwork.org/brits-travel-to-town-called-lover-to-send-valentines-day-cards/",
    "description": "While other places go all-out on decorations at Christmas and Halloween, one village called Lover pretty much owns Valentine’s Day. Dubbed the world’s most romantic village, it has drawn visitors from across the UK to send Valentine’s Day cards with a special postmark. Thousands of cards are sent from Lover every February to recipients across […]\nThe post Brits Travel to Town Called Lover to Send Valentine’s Day Cards From World’s Most Romantic Post Office appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 18:16:13 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/brits-travel-to-town-called-lover-to-send-valentines-day-cards/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny",
    "link": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-14-2026/",
    "description": "Our partner Rob Brezsny, who has a new book out, Astrology Is Real: Revelations from My Life as an Oracle, provides his weekly wisdom to enlighten our thinking and motivate our mood. Rob’s Free Will Astrology, is a syndicated weekly column appearing in over a hundred publications. He is also the author of Pronoia Is the Antidote […]\nThe post Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 11:00:18 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-14-2026/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 13",
    "link": "https://www.goodnewsnetwork.org/events070213/",
    "description": "This daily column at GNN.org features all the good news, anniversaries and notable birthdays from this day in history—February 13.\nThe post Good News in History, February 13 appeared first on Good News Network.",
    "pubDate": "Fri, 13 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070213/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Spark: How To Protest",
    "link": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "description": "Welcome back to The Spark, our monthly celebration of how people just like you are creating positive change, one meaningful step at a time. The Spark is generously supported by Laura Rice. Sign up to Reasons to be Cheerful’s weekly newsletter here and you’ll get The Spark in your inbox...\nThe post The Spark: How To Protest appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 02 Feb 2026 14:05:22 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Forests are changing fast and scientists are deeply concerned",
    "link": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "description": "Forests around the world are quietly transforming, and not for the better. A massive global analysis of more than 31,000 tree species reveals that forests are becoming more uniform, increasingly dominated by fast-growing “sprinter” trees, while slow-growing, long-lived species are disappearing. These slower species act as the backbone of forest ecosystems, storing carbon, stabilizing environments, and supporting rich webs of life—especially in tropical regions where biodiversity is highest.",
    "pubDate": "Mon, 09 Feb 2026 02:17:56 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "A Father’s Vision: How Pharmacist Devan Patel Pioneered the World’s First Postbiotic Eye Gummy",
    "link": "https://dailycaller.com/2026/02/13/a-fathers-vision-how-pharmacist-devan-patel-pioneered-the-worlds-first-postbiotic-eye-gummy/",
    "description": "For pharmacist and father Devan Patel, some of life’s most meaningful innovations emerge from the most personal challenges. When his two daughters began experiencing myopia and digital eye strain from increased screen time, he found himself facing an unmet ne…",
    "pubDate": "2026-02-13T22:08:05Z",
    "source": "The Daily Caller",
    "sourceUrl": "https://dailycaller.com/2026/02/13/a-fathers-vision-how-pharmacist-devan-patel-pioneered-the-worlds-first-postbiotic-eye-gummy/",
    "category": "science",
    "author": "Featured Partner",
    "positivityScore": 6
  },
  {
    "title": "Orrön Energy receives MEUR 1.6 from a previously announced portfolio transaction",
    "link": "https://www.globenewswire.com/news-release/2026/02/13/3238033/0/en/Orr%C3%B6n-Energy-receives-MEUR-1-6-from-a-previously-announced-portfolio-transaction.html",
    "description": "Orrön Energy AB (“Orrön Energy”) is pleased to announce that closing has occurred, and a milestone has been achieved, for one of the three solar projects forming part of the portfolio transaction announced in December 2025, triggering payments totalling MEUR …",
    "pubDate": "2026-02-13T12:16:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/13/3238033/0/en/Orr%C3%B6n-Energy-receives-MEUR-1-6-from-a-previously-announced-portfolio-transaction.html",
    "category": "climate",
    "author": "Orrön Energy AB",
    "positivityScore": 6
  },
  {
    "title": "Communications chief says Türkiye’s mediator role rooted in 'consistent foreign policy'",
    "link": "https://www.hurriyetdailynews.com/communications-chief-says-turkiyes-mediator-role-rooted-in-consistent-foreign-policy-218939",
    "description": "Türkiye’s Communications Director Burhanettin Duran said Türkiye’s growing profile as a go-to mediator in conflict zones is the result of a “solution-oriented and consistent” foreign policy, not chance.",
    "pubDate": "2026-02-14T10:55:44Z",
    "source": "Hurriyet Daily News",
    "sourceUrl": "https://www.hurriyetdailynews.com/communications-chief-says-turkiyes-mediator-role-rooted-in-consistent-foreign-policy-218939",
    "category": "climate",
    "author": "hurriyetdailynews.com",
    "positivityScore": 6
  },
  {
    "title": "FEATURE FRIDAY: Catching up with Super Bowl champion J.R. Singleton",
    "link": "https://www.widerightnattylite.com/feature-friday/50552/feature-friday-catching-up-with-super-bowl-champion-j-r-singleton",
    "description": "SANTA CLARA, Calif. — With a 29-13 victory over the New England Patriots, the Seattle Seahawks claimed their second Super Bowl title in franchise history. After starring at Iowa State, J.R. Singleton is a Super Bowl champion, the first Cyclone to win a ring s…",
    "pubDate": "2026-02-13T23:01:08Z",
    "source": "Widerightnattylite.com",
    "sourceUrl": "https://www.widerightnattylite.com/feature-friday/50552/feature-friday-catching-up-with-super-bowl-champion-j-r-singleton",
    "category": "people",
    "author": "Jared Larson",
    "positivityScore": 6
  },
  {
    "title": "‘A different set of rules’: thermal drone footage shows Musk’s AI power plant flouting clean air regulations",
    "link": "https://www.theguardian.com/environment/2026/feb/13/elon-musk-xai-datacenters-air-pollution-mississippi",
    "description": "Images confirm xAI is continuing to defy EPA regulations in Mississippi to power its flagship datacenters\nElon Musk’s artificial intelligence company is continuing to fuel its datacenters with unpermitted gas turbines, an investigation by the Floodlight newsroom shows. Thermal footage captured by Floodlight via drone shows xAI is still burning gas at a facility in Southaven, Mississippi, despite a recent Environmental Protection Agency (EPA) ruling reiterating that doing so requires a state permit in advance.\nState regulators in Mississippi maintain that since the turbines are parked on tractor trailers, they don’t require permits. However, the EPA has long maintained that such pollution sources require permits under the Clean Air Act.\n Continue reading...",
    "pubDate": "Fri, 13 Feb 2026 18:00:15 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/13/elon-musk-xai-datacenters-air-pollution-mississippi",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Melting Antarctic ice may weaken a major carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "description": "Melting ice from West Antarctica once delivered huge amounts of iron to the Southern Ocean, but algae growth did not increase as expected. Researchers found the iron was in a form that marine life could not easily use. This means more melting ice does not automatically boost carbon absorption. In the future, Antarctic ice loss could actually reduce the ocean’s ability to slow climate change.",
    "pubDate": "Wed, 04 Feb 2026 04:32:51 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Scientists find nerves actively fuel pancreatic cancer",
    "link": "https://www.sciencedaily.com/releases/2026/02/260211204208.htm",
    "description": "Scientists have uncovered a hidden partnership between pancreatic cancer and the nervous system. Support cells in the pancreas lure nerve fibers, which then release signals that accelerate early cancer growth. This creates a self-sustaining loop that helps tumors take hold. Blocking the nerve activity significantly reduced tumor growth in experiments, suggesting a new treatment strategy.",
    "pubDate": "Sun, 15 Feb 2026 08:43:27 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260211204208.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Discovery tools: how powerful new scientific methods and instruments emerge and catalyse innovation",
    "link": "https://researchonline.lse.ac.uk/id/eprint/137234/",
    "description": "Krauss, A. ORCID logo (2026). Discovery tools: how powerful new scientific methods and instruments emerge and catalyse innovation. PNAS Nexus, [In Press]",
    "pubDate": "2026-02-13T14:47:01Z",
    "source": "Lse.ac.uk",
    "sourceUrl": "https://researchonline.lse.ac.uk/id/eprint/137234/",
    "category": "science",
    "author": null,
    "positivityScore": 4
  },
  {
    "title": "Psyence BioMed Approves Put Option Agreement with PsyLabs to Secure Strategic Supply and Strengthen Commercialization Pathway",
    "link": "https://www.globenewswire.com/news-release/2026/02/13/3238373/0/en/Psyence-BioMed-Approves-Put-Option-Agreement-with-PsyLabs-to-Secure-Strategic-Supply-and-Strengthen-Commercialization-Pathway.html",
    "description": "The Put Option Agreement positions Psyence BioMed for potential significant future equity participation in one of the world's most advanced psychedelic pharmaceutical grade manufacturers, thereby securing predictable and reliable supply of pharmaceutical grad…",
    "pubDate": "2026-02-13T23:30:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/13/3238373/0/en/Psyence-BioMed-Approves-Put-Option-Agreement-with-PsyLabs-to-Secure-Strategic-Supply-and-Strengthen-Commercialization-Pathway.html",
    "category": "health",
    "author": "Psyence Biomedical Ltd.",
    "positivityScore": 4
  },
  {
    "title": "Manitoba saw spike in measles cases, exposure at Jets game last week",
    "link": "https://www.cbc.ca/news/canada/manitoba/measles-cases-february-9.7089341",
    "description": "Manitoba saw 44 confirmed cases of measles during the first week of February, as well as an exposure at the Feb. 4 Winnipeg Jets game, the province's latest measles reports say.",
    "pubDate": "2026-02-13T22:43:07Z",
    "source": "CBC News",
    "sourceUrl": "https://www.cbc.ca/news/canada/manitoba/measles-cases-february-9.7089341",
    "category": "health",
    "author": null,
    "positivityScore": 4
  },
  {
    "title": "Doug Burgum, the Regime Toady of Our Time",
    "link": "http://prospect.org/2026/02/13/doug-burgum-interior-department-regime-toady-of-our-time/",
    "description": "Dashing the hopes of establishment Democrats, Trump’s interior secretary and ‘energy czar’ has adopted his boss’s excesses as his own.\nThe post Doug Burgum, the Regime Toady of Our Time appeared first on The American Prospect.",
    "pubDate": "2026-02-13T10:00:00Z",
    "source": "The American Prospect",
    "sourceUrl": "http://prospect.org/2026/02/13/doug-burgum-interior-department-regime-toady-of-our-time/",
    "category": "climate",
    "author": "Hannah Story Brown and Toni Aguilar Rosenthal",
    "positivityScore": 4
  },
  {
    "title": "Can you save an injured bird?",
    "link": "https://www.lifesciencesworld.com/can-you-save-an-injured-bird/",
    "description": "Can You Save an Injured Bird? Can you save an injured bird? Yes, with proper knowledge, care, and sometimes professional help, it is often possible to rescue and rehabilitate injured birds, giving them a chance to return to the wild. Introduction: A Winged Li…",
    "pubDate": "2026-02-14T06:05:33Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/can-you-save-an-injured-bird/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "How did the mongoose save the baby?",
    "link": "https://www.lifesciencesworld.com/how-did-the-mongoose-save-the-baby/",
    "description": "How the Mongoose Saved the Baby: A Tale of Instinct and Protection This article explores the astonishing scenarios of how the mongoose saved the baby, providing a comprehensive understanding of their protective behaviors and challenging common misconceptions …",
    "pubDate": "2026-02-03T01:59:01Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-did-the-mongoose-save-the-baby/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "Peta calls for pork-free menus as Peppa Pig show rolls into Grimsby",
    "link": "https://www.theguardian.com/stage/2026/feb/14/peta-pork-free-menus-peppa-pig-big-family-show-grimsby",
    "description": "Auditorium to remove bacon and sausages from cafe during stage run after request from campaign group\nCampaigners are calling on theatre bosses to stop serving bacon, sausages and ham in their cafes – at least while Peppa Pig and her family are performing in the same building.\nGrimsby Auditorium in Lincolnshire said this week it would remove pork from the menu when Peppa Pig’s Big Family Show opens next month, after a request from People for the Ethical Treatment of Animals (Peta UK). The campaign group is sending the venue vegan ham as an alternative.\n Continue reading...",
    "pubDate": "Sat, 14 Feb 2026 07:00:47 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/stage/2026/feb/14/peta-pork-free-menus-peppa-pig-big-family-show-grimsby",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Yellowstone wolves may not have transformed the national park after all",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "description": "A new scientific review challenges the headline-grabbing claim that Yellowstone’s returning wolves triggered one of the strongest trophic cascades on Earth. Researchers found that the reported 1,500% surge in willow growth was based on circular calculations and questionable comparisons. After correcting for modeling and sampling flaws, the supposed ecosystem-wide boom largely disappears.",
    "pubDate": "Thu, 12 Feb 2026 08:51:03 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Tracking global water circulation using atomic fingerprints",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210231553.htm",
    "description": "Scientists have developed a powerful new way to trace the journey of water across the planet by reading tiny atomic clues hidden inside it. Slightly heavier versions of hydrogen and oxygen, called isotopes, shift in predictable ways as water evaporates and moves through the atmosphere. By combining eight advanced climate models into a single ensemble, researchers created the most accurate large-scale simulation yet of how water circulates worldwide.",
    "pubDate": "Sun, 15 Feb 2026 08:12:50 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210231553.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Scientists discover pets are helping an invasive flatworm spread",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210231550.htm",
    "description": "A new study shows that dogs and cats may be helping an invasive flatworm spread. Researchers analyzing over a decade of reports discovered the worm attached to pet fur. Its sticky mucus and ability to reproduce alone make it highly adaptable. Pets could be giving this slow-moving invader a major boost.",
    "pubDate": "Sat, 14 Feb 2026 09:34:47 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210231550.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Stop eating 3 hours before bed to improve heart health",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215084958.htm",
    "description": "A simple shift in your evening routine may give your heart a measurable boost. In a new study, adults who stopped eating and dimmed the lights three hours before bed and extended their overnight fast by about two hours saw improvements in blood pressure, heart rate, and blood-sugar control — without cutting calories.",
    "pubDate": "Sun, 15 Feb 2026 08:58:31 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215084958.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "AI uncovers the hidden genetic control centers driving Alzheimer’s",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215084954.htm",
    "description": "Scientists have created the most detailed maps yet of how genes control one another inside the brains of people with Alzheimer’s disease. Using a powerful new AI-based system called SIGNET, the team uncovered cause-and-effect relationships between genes across six major brain cell types, revealing which genes are truly driving harmful changes. The most dramatic disruptions were found in excitatory neurons, where thousands of genetic interactions appear to be extensively rewired as the disease progresses.",
    "pubDate": "Sun, 15 Feb 2026 09:15:19 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215084954.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists found a way to plant ideas in dreams to boost creativity",
    "link": "https://www.sciencedaily.com/releases/2026/02/260213223926.htm",
    "description": "Sleeping on a problem might be more powerful than we ever imagined. Neuroscientists at Northwestern University have shown that dreams can actually be nudged in specific directions — and those dream tweaks may boost creativity. By playing subtle sound cues during REM sleep, researchers prompted people to dream about unsolved brain teasers they had struggled with earlier. An astonishing 75% of participants dreamed about the cued puzzles, and those puzzles were solved far more often the next day.",
    "pubDate": "Sun, 15 Feb 2026 01:47:47 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260213223926.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "How some COVID vaccines triggered rare blood-clot disorder",
    "link": "https://www.nature.com/articles/d41586-026-00457-4",
    "description": "",
    "pubDate": "2026-02-12T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00457-4",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Are wetter winters and frequent flooding here to stay?",
    "link": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "description": "Many places across the UK have experienced their wettest January in more than 100 years.",
    "pubDate": "Wed, 11 Feb 2026 02:59:08 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Landmark deal to cut global shipping emissions in tatters after US pressure",
    "link": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "description": "President Trump intervened in the talks calling the deal a \"green scam\".",
    "pubDate": "Fri, 17 Oct 2025 16:31:07 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Breakthrough Study Confirms HYD LLC's 30-Year Research on Deuterium Modulation in Cancer Gene Expression",
    "link": "https://www.prnewswire.co.uk/news-releases/breakthrough-study-confirms-hyd-llcs-30-year-research-on-deuterium-modulation-in-cancer-gene-expression-302688115.html",
    "description": "BUDAPEST, Hungary, Feb. 13, 2026 /PRNewswire/ -- A newly published scientific paper titled \"Gene Expression Patterns in Lung Adenocarcinoma Cells in Response to Changes in Deuterium Concentration\" (Csonka, G.I.; Papp, A.; Somlyai, I.; Somlyai, G. Gene Express…",
    "pubDate": "2026-02-13T23:04:00Z",
    "source": "PR Newswire UK",
    "sourceUrl": "https://www.prnewswire.co.uk/news-releases/breakthrough-study-confirms-hyd-llcs-30-year-research-on-deuterium-modulation-in-cancer-gene-expression-302688115.html",
    "category": "science",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "Science Alone Won’t Stop Lassa Fever",
    "link": "https://www.project-syndicate.org/commentary/west-african-countries-must-be-prepared-for-lassa-fever-vaccine-by-oyeronke-oyebanji-and-virgil-lokossou-2026-02",
    "description": "Three promising Lassa fever vaccine candidates are in clinical development, one of which could be licensed in the next decade. But to ensure a swift and effective rollout, West African countries must start planning now to determine who should receive it, how …",
    "pubDate": "2026-02-13T14:46:34Z",
    "source": "Project Syndicate",
    "sourceUrl": "https://www.project-syndicate.org/commentary/west-african-countries-must-be-prepared-for-lassa-fever-vaccine-by-oyeronke-oyebanji-and-virgil-lokossou-2026-02",
    "category": "science",
    "author": "Oyeronke Oyebanji",
    "positivityScore": 2
  },
  {
    "title": "Global Conjugate Vaccine Market to Reach USD 21.77 Billion by 2030 | MarketsandMarkets™",
    "link": "https://www.globenewswire.com/news-release/2026/02/13/3238155/0/en/Global-Conjugate-Vaccine-Market-to-Reach-USD-21-77-Billion-by-2030-MarketsandMarkets.html",
    "description": "Multivalent Platforms, Regulatory Momentum, and Public-Private Partnerships Position Conjugate Vaccines as Cornerstone of Preventive Healthcare Infrastructure Across Developed and Emerging Markets Multivalent Platforms, Regulatory Momentum, and Public-Private…",
    "pubDate": "2026-02-13T14:30:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/13/3238155/0/en/Global-Conjugate-Vaccine-Market-to-Reach-USD-21-77-Billion-by-2030-MarketsandMarkets.html",
    "category": "science",
    "author": "MarketsandMarkets Research Pvt. Ltd.",
    "positivityScore": 2
  },
  {
    "title": "Orchestra BioMed Announces Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)",
    "link": "https://www.globenewswire.com/news-release/2026/02/13/3238323/0/en/Orchestra-BioMed-Announces-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html",
    "description": "NEW HOPE, Pa., Feb. 13, 2026 (GLOBE NEWSWIRE) -- Orchestra BioMed Holdings, Inc. (Nasdaq: OBIO) (“Orchestra BioMed” or the “Company”), a biomedical company accelerating high-impact technologies to patients through strategic partnerships with market-leading gl…",
    "pubDate": "2026-02-13T21:05:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/13/3238323/0/en/Orchestra-BioMed-Announces-Inducement-Grants-Under-Nasdaq-Listing-Rule-5635-c-4.html",
    "category": "health",
    "author": "Orchestra BioMed Holdings, Inc.",
    "positivityScore": 2
  },
  {
    "title": "The very unusual factor in the Nancy Guthrie missing person case",
    "link": "https://www.abc.net.au/news/2026-02-14/the-very-unusual-factor-in-the-nancy-guthrie-case/106333408",
    "description": "What initially seemed like a high-profile kidnapping that might be resolved with a multi-million-dollar bank transfer has now morphed into something else.",
    "pubDate": "2026-02-13T19:20:43Z",
    "source": "ABC News (AU)",
    "sourceUrl": "https://www.abc.net.au/news/2026-02-14/the-very-unusual-factor-in-the-nancy-guthrie-case/106333408",
    "category": "health",
    "author": "Emily Clark and Lucia Stein",
    "positivityScore": 2
  },
  {
    "title": "UPSC Key: Seva Teerth, BNP wins Bangladesh elections, and New CPI",
    "link": "https://indianexpress.com/article/upsc-current-affairs/upsc-key-seva-teerth-pmo-bnp-wins-bangladesh-elections-new-cpi-10532308/",
    "description": "What is the importance of India hosting the AI Impact Summit 2026 for your UPSC exam? What significance do topics such as the India-USA relationship, AI Impact Summit, and new CPI have for both the Preliminary and Main exams? You can learn more by reading The…",
    "pubDate": "2026-02-14T12:33:46Z",
    "source": "The Indian Express",
    "sourceUrl": "https://indianexpress.com/article/upsc-current-affairs/upsc-key-seva-teerth-pmo-bnp-wins-bangladesh-elections-new-cpi-10532308/",
    "category": "health",
    "author": "Khushboo Kumari",
    "positivityScore": 2
  },
  {
    "title": "‘From Chai to Chips’: PM Modi pitches Assam’s growth story ahead of Assembly elections",
    "link": "https://economictimes.indiatimes.com/news/elections/assembly-elections/assam/from-chai-to-chips-pm-modi-pitches-assams-growth-story-ahead-of-assembly-elections-semiconductor-iim-aiims-youth-development/articleshow/128343194.cms",
    "description": "Prime Minister Narendra Modi unveiled a new vision for Assam, linking its tea heritage to semiconductor manufacturing with the 'chai to chips' slogan. He inaugurated key infrastructure, including an emergency landing facility and a Brahmaputra bridge. Modi co…",
    "pubDate": "2026-02-14T10:27:44Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/elections/assembly-elections/assam/from-chai-to-chips-pm-modi-pitches-assams-growth-story-ahead-of-assembly-elections-semiconductor-iim-aiims-youth-development/articleshow/128343194.cms",
    "category": "health",
    "author": "ET Online",
    "positivityScore": 2
  },
  {
    "title": "Pressure mounts over mentally ill people held in prisons",
    "link": "https://www.rte.ie/news/investigations-unit/2026/0214/1558411-pressure-mounts-over-mentally-ill-people-held-in-prisons/",
    "description": "In the days following RTÉ Investigates' two-part documentary on acute psychiatric care, questions about how the State treats its most vulnerable patients moved quickly to what needs to happen next.",
    "pubDate": "2026-02-14T06:01:22Z",
    "source": "RTE",
    "sourceUrl": "https://www.rte.ie/news/investigations-unit/2026/0214/1558411-pressure-mounts-over-mentally-ill-people-held-in-prisons/",
    "category": "health",
    "author": "Conor Ryan",
    "positivityScore": 2
  },
  {
    "title": "What medication is used for velvet disease?",
    "link": "https://www.lifesciencesworld.com/what-medication-is-used-for-velvet-disease/",
    "description": "What Medication is Used for Velvet Disease? The primary medication used for treating velvet disease (Oodinium) in fish is copper-based treatments, although alternative medications exist and can be more effective depending on the severity and specific strain o…",
    "pubDate": "2026-02-14T04:17:28Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-medication-is-used-for-velvet-disease/",
    "category": "health",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Some of the most acidic water in the world is found on N.W.T's north shore. Here's why",
    "link": "https://www.cbc.ca/news/canada/calgary/smoking-hills-nwt-climate-change-9.7086850",
    "description": "Calgary researchers discovered in the Northwest Territories what they believe is some of the most acidic natural water in the world. It's because of how climate change is impacting the Smoking Hills Formation.",
    "pubDate": "2026-02-14T13:00:00Z",
    "source": "CBC News",
    "sourceUrl": "https://www.cbc.ca/news/canada/calgary/smoking-hills-nwt-climate-change-9.7086850",
    "category": "climate",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "Speak Lord, I’m Listening: Lent’s Call from Ignorance to Insight",
    "link": "https://www.indiancatholicmatters.org/speak-lord-im-listening-lents-call-from-ignorance-to-insight/",
    "description": "# chhotebhai – We are about to enter the holy season of Lent. By now “good Christians” will have decided what to give up for\nThe post Speak Lord, I’m Listening: Lent’s Call from Ignorance to Insight appeared first on Indian Catholic Matters.",
    "pubDate": "2026-02-14T11:50:55Z",
    "source": "Indiancatholicmatters.org",
    "sourceUrl": "https://www.indiancatholicmatters.org/speak-lord-im-listening-lents-call-from-ignorance-to-insight/",
    "category": "climate",
    "author": "Team ICM",
    "positivityScore": 2
  },
  {
    "title": "First Quantum Minerals Reports Fourth Quarter 2025 Results",
    "link": "https://www.globenewswire.com/news-release/2026/02/10/3235839/0/en/First-Quantum-Minerals-Reports-Fourth-Quarter-2025-Results.html",
    "description": "(In United States dollars, except where noted otherwise) (In United States dollars, except where noted otherwise)",
    "pubDate": "2026-02-10T22:01:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/10/3235839/0/en/First-Quantum-Minerals-Reports-Fourth-Quarter-2025-Results.html",
    "category": "climate",
    "author": "First Quantum Minerals Ltd.",
    "positivityScore": 2
  },
  {
    "title": "What is the effective range of a 6.5 Creedmoor vs 308?",
    "link": "https://www.lifesciencesworld.com/what-is-the-effective-range-of-a-6-5-creedmoor-vs-308/",
    "description": "What is the Effective Range of a 6.5 Creedmoor vs. 308? The effective range of the 6.5 Creedmoor generally extends further than that of the .308 Winchester, thanks to its superior ballistic coefficient and ability to maintain accuracy at longer distances. Thi…",
    "pubDate": "2026-02-14T03:31:24Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-is-the-effective-range-of-a-6-5-creedmoor-vs-308/",
    "category": "climate",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "How do birds get birds pregnant?",
    "link": "https://www.lifesciencesworld.com/how-do-birds-get-birds-pregnant/",
    "description": "How Do Birds Get Birds Pregnant? The Avian Reproductive Dance Birds don’t “get pregnant” in the mammalian sense; rather, birds achieve fertilization through internal means, specifically the cloacal kiss, where sperm is transferred from the male cloaca to the …",
    "pubDate": "2026-02-14T08:35:43Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-do-birds-get-birds-pregnant/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "How fast can a dingo run?",
    "link": "https://www.lifesciencesworld.com/how-fast-can-a-dingo-run/",
    "description": "How Fast Can a Dingo Run? Unveiling the Speed Secrets of Australia’s Wild Dog The Australian dingo, a resilient and adaptable canine, is capable of impressive bursts of speed. Dingos can achieve a top speed of around 60 kilometers per hour (37 miles per hour)…",
    "pubDate": "2026-02-14T07:40:40Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-fast-can-a-dingo-run/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "All About Beavers",
    "link": "https://everything-everywhere.com/all-about-beavers/",
    "description": "Podcast Transcript When you think of animals that have impacted history, your first thought may be of dogs, cows, pigs, or horses. Yet another animal has played an oversized role in history, and it was never domesticated: beavers.  Beavers have been among the…",
    "pubDate": "2026-02-14T05:44:29Z",
    "source": "Everything-everywhere.com",
    "sourceUrl": "https://everything-everywhere.com/all-about-beavers/",
    "category": "wildlife",
    "author": "Gary Arndt",
    "positivityScore": 2
  },
  {
    "title": "LA passes grants for Jal Shakti, Forest, TA departments",
    "link": "https://statetimes.in/la-passes-grants-for-jal-shakti-forest-ta-departments/",
    "description": "Renewed push for forest conservation, water security, tribal-centric development: Javed Rana STATE TIMES NEWS JAMMU: Jammu and Kashmir Legislative Assembly on Friday passed the grants worth Rs. 3,24,177.48 Lakh for Public Health Engineering, Rs. 1,52,482.05 l…",
    "pubDate": "2026-02-13T18:47:16Z",
    "source": "Statetimes.in",
    "sourceUrl": "https://statetimes.in/la-passes-grants-for-jal-shakti-forest-ta-departments/",
    "category": "wildlife",
    "author": "statetimes_editor",
    "positivityScore": 2
  },
  {
    "title": "Being Jamaican in Canada meant we didn’t talk about mental health — until depression forced me to",
    "link": "https://www.cbc.ca/news/canada/first-person-mental-health-jamaican-in-canada-9.7089147",
    "description": "When Bria Barrows was diagnosed with depression as a high school student, her family struggled to talk about mental health issues. Since then, she has learned that talking leads to healing.",
    "pubDate": "2026-02-14T09:00:00Z",
    "source": "CBC News",
    "sourceUrl": "https://www.cbc.ca/news/canada/first-person-mental-health-jamaican-in-canada-9.7089147",
    "category": "people",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "Effective Facebook Ad Templates That Convert in 2026 - Digital Marketing Agency, Website Design, SEO Services",
    "link": "https://www.top4marketing.com.au/digital-marketing/effective-facebook-ad-templates-2026-convert/",
    "description": "Explore effective Facebook ad templates and social media advertising strategies for 2026 to create winning ads that convert and drive business results.",
    "pubDate": "2026-02-14T02:02:20Z",
    "source": "Top4marketing.com.au",
    "sourceUrl": "https://www.top4marketing.com.au/digital-marketing/effective-facebook-ad-templates-2026-convert/",
    "category": "people",
    "author": "Michael Doyle",
    "positivityScore": 2
  },
  {
    "title": "Apple TV going streaming-first with every 2026 movie feels risky, especially with potential Barbie, Marty Supreme, and Karate Kid-sized hits all coming",
    "link": "https://www.techradar.com/streaming/apple-tv-plus/apple-tv-going-streaming-first-with-every-2026-movie-feels-risky-especially-with-potential-barbie-marty-supreme-and-karate-kid-sized-hits-all-coming",
    "description": "Apple TV’s 2026 slate might have the next Barbie, Marty Supreme or Karate Kid – and I’m baffled it’s all streaming first.",
    "pubDate": "2026-02-14T00:00:00Z",
    "source": "TechRadar",
    "sourceUrl": "https://www.techradar.com/streaming/apple-tv-plus/apple-tv-going-streaming-first-with-every-2026-movie-feels-risky-especially-with-potential-barbie-marty-supreme-and-karate-kid-sized-hits-all-coming",
    "category": "people",
    "author": "amelia.schwanke@futurenet.com (Amelia Schwanke) , Amelia Schwanke",
    "positivityScore": 2
  },
  {
    "title": "Good News in History, February 15",
    "link": "https://www.goodnewsnetwork.org/events070215/",
    "description": "80 years ago today, some simple workplace encouragement material was posted on the wall of several Westinghouse Electric factories in Pittsburgh, PA, which became the famous “We Can Do It,” poster. One of the most iconic images in the history of American war propaganda, it was actually meant mainly to increase productivity among existing workers, […]\nThe post Good News in History, February 15 appeared first on Good News Network.",
    "pubDate": "Sun, 15 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070215/",
    "category": "general",
    "positivityScore": 1
  },
  {
    "title": "Airline Welcomes VIP Endangered Turtle Who Needed Hospital After it was Blown Off Course By Powerful Winter Storm",
    "link": "https://www.goodnewsnetwork.org/airline-welcomes-vip-endangered-turtle-who-needed-a-hospital-after-getting-blown-off-course/",
    "description": "On 9 January, large parts of Europe were brought to a standstill as Storm Goretti, a powerful winter cyclone with 110 mph winds, swept into the region from the south. Soon after, a beachcomber found a young loggerhead turtle washed up on the Island of Jersey near the coast of France after being blown hundreds […]\nThe post Airline Welcomes VIP Endangered Turtle Who Needed Hospital After it was Blown Off Course By Powerful Winter Storm appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 15:33:35 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/airline-welcomes-vip-endangered-turtle-who-needed-a-hospital-after-getting-blown-off-course/",
    "category": "general",
    "positivityScore": -1
  },
  {
    "title": "Good News in History, February 14",
    "link": "https://www.goodnewsnetwork.org/events070214/",
    "description": "95 years ago today, the horror film Dracula starring Bela Lugosi was released. Adapted from the 1897 novel by Bram Stoker, it’s a tale of Count Dracula, a vampire who emigrates from Transylvania to England and preys upon the blood of living victims. WATCH his reaction to being shown a crucifix… (1931) Directed and co-produced […]\nThe post Good News in History, February 14 appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070214/",
    "category": "general",
    "positivityScore": -3
  },
  {
    "title": "New Spray-on Powder Instantly Seals Life-Threatening Wounds in Battle or During Disasters",
    "link": "https://www.goodnewsnetwork.org/new-spray-on-powder-instantly-seals-life-threatening-wounds/",
    "description": "A spray-on powder that instantly seals life-threatening wounds could save thousands of lives, say scientists. The new substance can help prevent excessive bleeding which is the leading cause of death due to injuries in war, according to a study. The fast-acting powder that stops bleeding in just one second was developed by South Korean scientists […]\nThe post New Spray-on Powder Instantly Seals Life-Threatening Wounds in Battle or During Disasters appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 21:23:55 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/new-spray-on-powder-instantly-seals-life-threatening-wounds/",
    "category": "general",
    "positivityScore": -31
  }
]