[
  {
    "title": "Mountain Rescue Script Flipped as Hiker Saves Lost Dog Instead of a Dog Saving Hiker",
    "link": "https://www.goodnewsnetwork.org/mountain-rescue-script-flipped-as-hiker-saves-lost-dog-instead-of-a-dog-saving-a-hiker/",
    "description": "In what was noted to be a bit of a reversal of traditional roles, a dog was rescued by mountaineers after spending a frigid night in a hollow below a mountaintop. Five dogs and four hikers were approaching the summit of Fionn Bheinn in the Scottish Highlands near Achnasheen recently, when their dogs fell through […]\nThe post Mountain Rescue Script Flipped as Hiker Saves Lost Dog Instead of a Dog Saving Hiker appeared first on Good News Network.",
    "pubDate": "Fri, 20 Feb 2026 14:00:35 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/mountain-rescue-script-flipped-as-hiker-saves-lost-dog-instead-of-a-dog-saving-a-hiker/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Good News in History, February 20",
    "link": "https://www.goodnewsnetwork.org/events070220/",
    "description": "14 years ago today, a team of Russian botanists successfully regenerated 36 specimens of Silene stenophylla from frozen samples of the plant’s fruit buried in the Russian permafrost between 40 and 60,000 years ago by squirrels. Surpassing the previous record for regeneration by more than 10 times, placental cells extracted from the frozen fruit were radiocarbon […]\nThe post Good News in History, February 20 appeared first on Good News Network.",
    "pubDate": "Fri, 20 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070220/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "A ‘Planet Parade’ is Now in Alignment for Viewing Our Solar System This Week",
    "link": "https://www.goodnewsnetwork.org/next-weekends-planet-parade-to-offer-best-chance-this-year-to-see-our-solar-system/",
    "description": "Next Saturday, the 28th of February, stargazers will have the chance to spot Mercury, Venus, Jupiter, Saturn, Uranus, and Neptune all clustered together in the sky. Called a planetary alignment, they occur when the planets, which orbit atop the same horizonal line—called the ecliptic plane—happen to pass by the same point in the sky at […]\nThe post A ‘Planet Parade’ is Now in Alignment for Viewing Our Solar System This Week appeared first on Good News Network.",
    "pubDate": "Thu, 19 Feb 2026 19:30:05 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/next-weekends-planet-parade-to-offer-best-chance-this-year-to-see-our-solar-system/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Uttarakhand achieves 1 GW solar energy capacity boosting green energy push and local jobs",
    "link": "https://timesofindia.indiatimes.com/india/uttarakhand-achieves-1-gw-solar-energy-capacity-boosting-green-energy-push-and-local-jobs/articleshow/128518899.cms",
    "description": "India News: Uttarakhand has crossed a major renewable energy milestone, surpassing 1 gigawatt (GW) of installed solar power capacity. The state’s total installed .",
    "pubDate": "2026-02-18T17:30:21Z",
    "source": "The Times of India",
    "sourceUrl": "https://timesofindia.indiatimes.com/india/uttarakhand-achieves-1-gw-solar-energy-capacity-boosting-green-energy-push-and-local-jobs/articleshow/128518899.cms",
    "category": "climate",
    "author": "The Times Of India",
    "positivityScore": 10
  },
  {
    "title": "What went right this week: new law sends a ‘powerful message’ against online abuse, plus more",
    "link": "https://www.positive.news/society/good-news-stories-from-week-8-of-2026/",
    "description": "A law to protect survivors of online abuse was proposed, two rare birds made a resurgence, and new psychedelics research emerged, plus more\nThe post What went right this week: new law sends a ‘powerful message’ against online abuse, plus more appeared first on Positive News.",
    "pubDate": "Fri, 20 Feb 2026 05:00:21 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/good-news-stories-from-week-8-of-2026/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Osaka Stunned by Anonymous Gift of Gold Bars to Fix Aging Water Pipes",
    "link": "https://www.goodnewsnetwork.org/osaka-stunned-by-anonymous-gift-of-gold-bars-to-fix-aging-water-pipes/",
    "description": "Have you seen the price of gold recently? In the Japanese city of Osaka, one man obviously did, and decided to cash in for the sake of his community. The mayor and his staff were staggered when they discovered an anonymous resident had presented 21 kilograms of gold bars to the city as a contribution […]\nThe post Osaka Stunned by Anonymous Gift of Gold Bars to Fix Aging Water Pipes appeared first on Good News Network.",
    "pubDate": "Mon, 23 Feb 2026 14:00:15 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/osaka-stunned-by-anonymous-gift-of-gold-bars-to-fix-aging-water-pipes/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Overcoming 3D-Printer Challenges, MIT Produces an Electric Motor in Just 3 Hours",
    "link": "https://www.goodnewsnetwork.org/overcoming-3d-printer-challenges-mit-produces-an-electric-motor-in-just-3-hours/",
    "description": "A broken motor can bring an automated machine factory to a halt—and instead of ordering a replacement part that could take days or weeks to arrive, with costly production delays, it may soon be easier, faster, and much cheaper to make a new motor onsite. MIT researchers announced on Wednesday that they have developed a […]\nThe post Overcoming 3D-Printer Challenges, MIT Produces an Electric Motor in Just 3 Hours appeared first on Good News Network.",
    "pubDate": "Sun, 22 Feb 2026 12:00:09 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/overcoming-3d-printer-challenges-mit-produces-an-electric-motor-in-just-3-hours/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Teacher Wins $1M Prize for Turning India’s Slums Into Hundreds of Open-Air Classrooms",
    "link": "https://www.goodnewsnetwork.org/teacher-wins-1m-prize-for-turning-indias-slums-into-hundreds-of-open-air-classrooms/",
    "description": "An Indian teacher who has established more than 800 learning centers across India for children who have never attended school has been named the winner of the $1 million Global Teacher Prize from GEMS Education. Located in over 100 slums and villages, Rouble Nagi’s classrooms offer safe, inspiring spaces to help overcome the challenging conditions […]\nThe post Teacher Wins $1M Prize for Turning India’s Slums Into Hundreds of Open-Air Classrooms appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 19:18:40 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/teacher-wins-1m-prize-for-turning-indias-slums-into-hundreds-of-open-air-classrooms/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "High Schoolers and Seniors Build Unlikely Friendships Through Chair Volleyball",
    "link": "https://www.goodnewsnetwork.org/high-schoolers-and-seniors-build-unlikely-friendship-through-chair-volleyball/",
    "description": "What started as a simple chair volleyball game at a senior living community in Belton, Texas, has grown into a meaningful intergenerational friendship. The sporty seniors, who proudly call themselves “The Hit Squad,” regularly host friendly chair volleyball matches with members of the Lake Belton High School volleyball team. The games have become a highlight […]\nThe post High Schoolers and Seniors Build Unlikely Friendships Through Chair Volleyball appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 16:46:53 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/high-schoolers-and-seniors-build-unlikely-friendship-through-chair-volleyball/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "‘Astonishing” New Scimitar-Shaped Crested Dinosaur Discovered in Sahara Desert: ‘You might uncover a lost world’",
    "link": "https://www.goodnewsnetwork.org/astonishing-new-scimitar-shaped-crested-dinosaur-discovered-in-sahara-desert/",
    "description": "Scientists called “astonishing” the first indisputable evidence of a new species of Spinosaurus found in over a century—uncovered in a remote area of the Sahara Desert. The newly discovered scimitar-crested dinosaur was described as a “hell heron” that fed on fish despite living hundreds of miles from the sea. Paleontologists say it appears to have […]\nThe post ‘Astonishing” New Scimitar-Shaped Crested Dinosaur Discovered in Sahara Desert: ‘You might uncover a lost world’ appeared first on Good News Network.",
    "pubDate": "Fri, 20 Feb 2026 17:00:39 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/astonishing-new-scimitar-shaped-crested-dinosaur-discovered-in-sahara-desert/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Watch Thai Cops Literally Go ‘Undercover’ Dancing as a Lion to Nab Suspect at Lunar New Year Fest",
    "link": "https://www.goodnewsnetwork.org/thai-cops-go-undercover-literally-as-lion-dancers-to-nab-suspect-at-lunar-new-year-festival/",
    "description": "From Thailand comes a story that’s pure Hollywood: police going undercover as festival lion dancers to nab a suspected art thief. Dressed as the rump and head of a large Asian lion costume during Lunar New Year festivities, the police sprang upon the suspect and took him into custody, phone cameras mercifully recorded. Bangkok police […]\nThe post Watch Thai Cops Literally Go ‘Undercover’ Dancing as a Lion to Nab Suspect at Lunar New Year Fest appeared first on Good News Network.",
    "pubDate": "Fri, 20 Feb 2026 12:00:44 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/thai-cops-go-undercover-literally-as-lion-dancers-to-nab-suspect-at-lunar-new-year-festival/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Loyal Dog Who Lived by Owner’s Grave Inspires New Law Allowing Pets a Place in Family Plots",
    "link": "https://www.goodnewsnetwork.org/loyal-dog-who-lived-by-owners-grave-inspired-new-law-to-allow-pets-a-place-in-family-grave-plots/",
    "description": "The state of São Paolo in Brazil recently passed a law in honor of a famous loyal dog that will allow residents to have their pets buried in family cemetery plots. Bob, nicknamed Bob Gravedigger, was an orange dog who spent 10 years living next to the grave of his owner after attending his funeral […]\nThe post Loyal Dog Who Lived by Owner’s Grave Inspires New Law Allowing Pets a Place in Family Plots appeared first on Good News Network.",
    "pubDate": "Thu, 19 Feb 2026 16:30:06 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/loyal-dog-who-lived-by-owners-grave-inspired-new-law-to-allow-pets-a-place-in-family-grave-plots/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Are Ethics a Constraint or Catalyst for Innovation?",
    "link": "https://bradenkelley.com/2026/02/are-ethics-a-constraint-or-catalyst-for-innovation/",
    "description": "GUEST POST from David Sable For centuries, innovation has lived in tension with ethics. Some say moral codes kill progress… Others say they force progress to grow up. And sometimes… they save lives. The truth? It’s not binary… It’s a system with three gears: …",
    "pubDate": "2026-02-22T12:00:00Z",
    "source": "Bradenkelley.com",
    "sourceUrl": "https://bradenkelley.com/2026/02/are-ethics-a-constraint-or-catalyst-for-innovation/",
    "category": "health",
    "author": "David Sable",
    "positivityScore": 8
  },
  {
    "title": "PRF Technologies’ DeepSolar Announces its First Commercial Due Diligence Engagement with EDF Power Solutions Israel, a Global Leader in Renewable Energy",
    "link": "https://www.globenewswire.com/news-release/2026/02/18/3240327/0/en/PRF-Technologies-DeepSolar-Announces-its-First-Commercial-Due-Diligence-Engagement-with-EDF-Power-Solutions-Israel-a-Global-Leader-in-Renewable-Energy.html",
    "description": "Agreement Initiates Data-Driven Technical Due Diligence of an Operational, Utility-Scale Solar Asset in Israel Agreement Initiates Data-Driven Technical Due Diligence of an Operational, Utility-Scale Solar Asset in Israel",
    "pubDate": "2026-02-18T14:15:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/18/3240327/0/en/PRF-Technologies-DeepSolar-Announces-its-First-Commercial-Due-Diligence-Engagement-with-EDF-Power-Solutions-Israel-a-Global-Leader-in-Renewable-Energy.html",
    "category": "climate",
    "author": "PRF Technologies Ltd",
    "positivityScore": 8
  },
  {
    "title": "Protect biodiversity for food security, sustainable growth, experts urge Nigeria",
    "link": "https://punchng.com/protect-biodiversity-for-food-security-sustainable-growth-experts-urge-nigeria/",
    "description": "Experts stress the need for Nigeria to protect its rich biodiversity to ensure food security, sustainable growth, and support for key economic sectors.\n\nRead More: https://punchng.com/protect-biodiversity-for-food-security-sustainable-growth-experts-urge-nige…",
    "pubDate": "2026-02-22T07:50:02Z",
    "source": "The Punch",
    "sourceUrl": "https://punchng.com/protect-biodiversity-for-food-security-sustainable-growth-experts-urge-nigeria/",
    "category": "wildlife",
    "author": "Punch Newspapers",
    "positivityScore": 8
  },
  {
    "title": "How a football cup run helped unite a town",
    "link": "https://www.positive.news/society/how-a-football-cup-run-helped-unite-a-town/",
    "description": "For a club rooted in non-league football, Macclesfield’s recent FA Cup didn't just connect those on the pitch, but a whole community\nThe post How a football cup run helped unite a town appeared first on Positive News.",
    "pubDate": "Fri, 20 Feb 2026 07:17:01 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/how-a-football-cup-run-helped-unite-a-town/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Fish biology inspires laundry microplastics clean up",
    "link": "https://www.positive.news/environment/fish-biology-inspires-laundry-microplastics-clean-up/",
    "description": "Inspired by marine life, inventors have created a filter to trap pesky microplastics leaked during laundry\nThe post Fish biology inspires laundry microplastics clean up appeared first on Positive News.",
    "pubDate": "Wed, 18 Feb 2026 07:00:39 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/environment/fish-biology-inspires-laundry-microplastics-clean-up/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "How species spotting took hold of a rural community",
    "link": "https://www.positive.news/society/how-species-spotting-took-hold-rural-community/",
    "description": "A village in north Somerset has got passionate about rare species spotting, thanks to the efforts of Yeo Valley Organic \nThe post How species spotting took hold of a rural community appeared first on Positive News.",
    "pubDate": "Tue, 17 Feb 2026 14:54:50 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/how-species-spotting-took-hold-rural-community/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 23",
    "link": "https://www.goodnewsnetwork.org/events070223/",
    "description": "140 years ago today, an American inventor used electrolysis to extract aluminum from aluminum oxide, a process that eventually resulted in reducing the price of aluminum by a factor of 200, making it affordable for many practical uses from soda cans to the Wright Flyer. As small grains amid clay, it was thought by medieval […]\nThe post Good News in History, February 23 appeared first on Good News Network.",
    "pubDate": "Mon, 23 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070223/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Plastic Mardi Gras Beads Just End up in Landfill, So Coalition Swaps in Seed Beads and Jambalaya Spice Packets",
    "link": "https://www.goodnewsnetwork.org/plastic-mardi-gras-beads-swapped-out-for-seed-beads-and-spice-packets/",
    "description": "Flung plastic beads, coins, and other trinkets can seem like treasures in the heat of a Mardi Gras moment, but if you’ve ever seen the streets of New Orleans the morning after, you’d recognize only trash. That’s why a coalition of government agencies and nonprofits is creating “seed beads,” biodegradable party favors, and culturally-smart alternatives […]\nThe post Plastic Mardi Gras Beads Just End up in Landfill, So Coalition Swaps in Seed Beads and Jambalaya Spice Packets appeared first on Good News Network.",
    "pubDate": "Sun, 22 Feb 2026 16:00:41 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/plastic-mardi-gras-beads-swapped-out-for-seed-beads-and-spice-packets/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Town Enthusiastically Switches to Restorative Justice and Reoffending Almost Vanishes",
    "link": "https://www.goodnewsnetwork.org/rural-town-enthusiastically-switches-to-restorative-justice-and-recidivism-almost-vanishes/",
    "description": "In northern Alberta, a restorative justice program is making a huge difference in a closely-knit community. With just 68,000 residents, putting someone from Fort McMurray in prison or juvenile detention has a big impact. Instead, a restorative justice program established for the town’s youth in 2022 has been expanded to include adults, and the results […]\nThe post Town Enthusiastically Switches to Restorative Justice and Reoffending Almost Vanishes appeared first on Good News Network.",
    "pubDate": "Sun, 22 Feb 2026 14:00:39 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/rural-town-enthusiastically-switches-to-restorative-justice-and-recidivism-almost-vanishes/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 22",
    "link": "https://www.goodnewsnetwork.org/events070222/",
    "description": "207 years ago today, Spain sold Florida to the United States as part of the Adams-Onis Treaty. It settled a standing border dispute between the two countries and was considered a triumph of American diplomacy. The cost was equivalent to $537.8 million in today’s dollars priced in gold, but was just 5 million Spanish dollars […]\nThe post Good News in History, February 22 appeared first on Good News Network.",
    "pubDate": "Sun, 22 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070222/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Newborn Giraffe With Distinctive Hair-do is Charming Visitors to Ohio Zoo–And They Gave Him the Perfect Name",
    "link": "https://www.goodnewsnetwork.org/newborn-giraffe-with-distinctive-hair-do-is-charming-visitors-to-ohio-zoo/",
    "description": "A four-week-old baby giraffe is becoming a social media sensation, thanks to his remarkable tuft of hair. His new name, Eugene, chosen from public suggestions, has proven to be a perfect fit for the young giraffe’s charming personality. The Toledo Zoo & Aquarium in Ohio welcomed the calf, weighing 130 lbs, on January 17 when […]\nThe post Newborn Giraffe With Distinctive Hair-do is Charming Visitors to Ohio Zoo–And They Gave Him the Perfect Name appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 14:51:45 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/newborn-giraffe-with-distinctive-hair-do-is-charming-visitors-to-ohio-zoo/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny",
    "link": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-21-2026/",
    "description": "Our partner Rob Brezsny, who has a new book out, Astrology Is Real: Revelations from My Life as an Oracle, provides his weekly wisdom to enlighten our thinking and motivate our mood. Rob’s Free Will Astrology, is a syndicated weekly column appearing in over a hundred publications. He is also the author of Pronoia Is the Antidote […]\nThe post Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 11:00:45 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-21-2026/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 21",
    "link": "https://www.goodnewsnetwork.org/events070221/",
    "description": "198 years ago today, the first issue of the Cherokee Phoenix was published using the Cherokee syllabary invented by Sequoyah. Sequoyah, also known as George Gist, was a Cherokee polymath who was one of the few people in history from a pre-literate group who created the original written system for that group’s language. Just as […]\nThe post Good News in History, February 21 appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070221/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "From Clicks to Cleanups: Juba’s Youth-Led Waste Revolution",
    "link": "https://reasonstobecheerful.world/south-sudan-juba-youth-led-waste-revolution/",
    "description": "The first time Makur Majeng posted photos on social media of trash-clogged drainage ditches along the White Nile in Juba, the capital of South Sudan, his phone would not stop buzzing. “How can I help?” one message read. Within hours, 20 young people — many of whom had never met...\nThe post From Clicks to Cleanups: Juba’s Youth-Led Waste Revolution appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 23 Feb 2026 12:58:30 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/south-sudan-juba-youth-led-waste-revolution/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "A Recipe For Women’s Empowerment in Morocco",
    "link": "https://reasonstobecheerful.world/morocco-recipe-for-womens-empowerment/",
    "description": "All over the city of Marrakesh, football fever had taken hold. Africa’s continent-wide soccer competition, AFCON, was being hosted in Morocco. And here, at the Amal Targa Center, a fan zone had been set up for the big clash between Egypt and Benin. Yet the most impressive team performing that...\nThe post A Recipe For Women’s Empowerment in Morocco appeared first on Reasons to be Cheerful.",
    "pubDate": "Fri, 20 Feb 2026 12:50:39 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/morocco-recipe-for-womens-empowerment/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "What We’re Reading: A Carnival Clean-Up in New Orleans",
    "link": "https://reasonstobecheerful.world/what-were-reading-new-orleans-carnival-cleanup/",
    "description": "Welcome back to our weekly behind-the-scenes glimpse at what’s getting our team talking. Tell us what you’ve been reading at info@reasonstobecheerful.world and we just might feature it here. From plastic to petals Sequin-clad merrymakers filled the streets of New Orleans once more this week to celebrate Mardi Gras, the jubilant...\nThe post What We’re Reading: A Carnival Clean-Up in New Orleans appeared first on Reasons to be Cheerful.",
    "pubDate": "Wed, 18 Feb 2026 23:06:12 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/what-were-reading-new-orleans-carnival-cleanup/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Forests are changing fast and scientists are deeply concerned",
    "link": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "description": "Forests around the world are quietly transforming, and not for the better. A massive global analysis of more than 31,000 tree species reveals that forests are becoming more uniform, increasingly dominated by fast-growing “sprinter” trees, while slow-growing, long-lived species are disappearing. These slower species act as the backbone of forest ecosystems, storing carbon, stabilizing environments, and supporting rich webs of life—especially in tropical regions where biodiversity is highest.",
    "pubDate": "Mon, 09 Feb 2026 02:17:56 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "Scientists discover why high altitude protects against diabetes",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221060952.htm",
    "description": "Living at high altitude appears to protect against diabetes, and scientists have finally discovered the reason. When oxygen levels drop, red blood cells switch into a new metabolic mode and absorb large amounts of glucose from the blood. This helps the body cope with thin air while also reducing blood sugar levels. A drug that recreates this effect reversed diabetes in mice, hinting at a powerful new treatment strategy.",
    "pubDate": "Sat, 21 Feb 2026 08:43:47 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221060952.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "Scientists reveal how exercise protects the brain from Alzheimer’s",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040752.htm",
    "description": "Exercise may sharpen the mind by repairing the brain’s protective shield. Researchers found that physical activity prompts the liver to release an enzyme that removes a harmful protein causing the blood-brain barrier to become leaky with age. In older mice, dialing down this protein reduced inflammation and improved memory. The discovery points to a surprising body-to-brain pathway that could inspire new Alzheimer’s therapies.",
    "pubDate": "Fri, 20 Feb 2026 10:19:43 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040752.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "Scientists finally explain why chronic constipation treatments often fail",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040745.htm",
    "description": "A newly discovered bacterial duo may be the hidden cause of chronic constipation. The two microbes break down the colon’s protective mucus layer, leaving stool dry and hard — a problem traditional laxatives don’t fix. Parkinson’s patients, who often struggle with constipation years before tremors appear, have higher levels of these bacteria. Blocking the bacteria’s mucus-destroying enzyme prevented constipation in mice, hinting at a new treatment strategy.",
    "pubDate": "Thu, 19 Feb 2026 08:46:05 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040745.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "Show HN: I built a dependency graph for the tree of human science",
    "link": "https://github.com/slepybear/The-Map-of-Science",
    "description": "Hi HN,\nI’ve always been frustrated by this: we live in an era of exponential scientific progress, but almost no one can clearly trace a cutting-edge discovery back to the first principles it’s built on. We learn science in silos, not as a connected, logical t…",
    "pubDate": "2026-02-22T07:43:27Z",
    "source": "Github.com",
    "sourceUrl": "https://github.com/slepybear/The-Map-of-Science",
    "category": "science",
    "author": "sleepybear04",
    "positivityScore": 6
  },
  {
    "title": "FDA Grants Breakthrough Status To Johnson & Johnson's Cancer Drug For Advanced Head and Neck Cancer",
    "link": "https://finance.yahoo.com/news/fda-grants-breakthrough-status-johnson-163108752.html",
    "description": "The U.S. Food and Drug Administration (FDA) granted Breakthrough Therapy Designation for subcutaneous Rybrevant Faspro (amivantamab and hyaluronidase-lpuj...",
    "pubDate": "2026-02-21T16:31:08Z",
    "source": "Yahoo Entertainment",
    "sourceUrl": "https://finance.yahoo.com/news/fda-grants-breakthrough-status-johnson-163108752.html",
    "category": "health",
    "author": "Vandana Singh",
    "positivityScore": 6
  },
  {
    "title": "Underground 'battery' deep in the outback could power millions of homes",
    "link": "https://www.abc.net.au/news/rural/2026-02-22/geologists-drill-into-adavale-basin-to-assess-energy-potential/106173564",
    "description": "They are older than the dinosaurs and buried deep underground, but scientists are pinning their hopes on ancient salt caverns to solve Australia’s green energy storage problem.",
    "pubDate": "2026-02-21T22:40:14Z",
    "source": "ABC News (AU)",
    "sourceUrl": "https://www.abc.net.au/news/rural/2026-02-22/geologists-drill-into-adavale-basin-to-assess-energy-potential/106173564",
    "category": "climate",
    "author": "Crispian Yeomans",
    "positivityScore": 6
  },
  {
    "title": "A New Milestone for the Energy Transition: The Forêt Domaniale Wind Farm Is Authorized",
    "link": "https://financialpost.com/pmn/business-wire-news-releases-pmn/a-new-milestone-for-the-energy-transition-the-foret-domaniale-wind-farm-is-authorized",
    "description": "MONTMAGNY, Québec — EDF solutions électriques and Alliance de l’énergie de l’Est enthusiastically welcome the adoption of the government decree authorizing the construction of the Forêt Domaniale wind farm, a project of 30 wind turbines with a total installed…",
    "pubDate": "2026-02-18T17:13:17Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/pmn/business-wire-news-releases-pmn/a-new-milestone-for-the-energy-transition-the-foret-domaniale-wind-farm-is-authorized",
    "category": "climate",
    "author": "Business Wire",
    "positivityScore": 6
  },
  {
    "title": "New U.S. electric generating capacity expected to reach a record high in 2026",
    "link": "https://www.eia.gov/todayinenergy/detail.php?id=67205 ",
    "description": "U.S. power plant developers and operators plan to add 86 gigawatts (GW) of new utility-scale electric generating capacity to the U.S. power grid in 2026 in our latest Preliminary Monthly Electric Generator Inventory report, a record if realized. Solar power m…",
    "pubDate": "2026-02-20T14:00:00Z",
    "source": "Eia.gov",
    "sourceUrl": "https://www.eia.gov/todayinenergy/detail.php?id=67205 ",
    "category": "climate",
    "author": null,
    "positivityScore": 6
  },
  {
    "title": "What helps black-footed ferrets survive?",
    "link": "https://www.lifesciencesworld.com/what-helps-black-footed-ferrets-survive/",
    "description": "What Helps Black-Footed Ferrets Survive? Unveiling the Secrets to Their Recovery The survival of black-footed ferrets hinges on a complex interplay of prairie dog abundance, successful breeding programs, and effective disease management; ultimately, restorati…",
    "pubDate": "2026-02-22T07:51:59Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-helps-black-footed-ferrets-survive/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 6
  },
  {
    "title": "WHO validates elimination of trachoma as a public health problem in Libya",
    "link": "https://www.who.int/news/item/18-02-2026-who-validates-elimination-of-trachoma-as-a-public-health-problem-in-libya",
    "description": "<p>The World Health Organization (WHO) today announced that Libya has eliminated trachoma as a public health problem, a landmark victory for public health in WHO’s Eastern Mediterranean Region. This hard-won achievement protects future generations from preven…",
    "pubDate": "2026-02-18T15:19:31Z",
    "source": "World Health Organization",
    "sourceUrl": "https://www.who.int/news/item/18-02-2026-who-validates-elimination-of-trachoma-as-a-public-health-problem-in-libya",
    "category": "people",
    "author": "World Health Organization: WHO",
    "positivityScore": 6
  },
  {
    "title": "Scientists just mapped mysterious earthquakes deep inside Earth",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040818.htm",
    "description": "Scientists at Stanford have unveiled the first-ever global map of rare earthquakes that rumble deep within Earth’s mantle rather than its crust. Long debated and notoriously difficult to confirm, these elusive quakes turn out to cluster in regions like the Himalayas and near the Bering Strait. By developing a breakthrough method that distinguishes mantle quakes using subtle differences in seismic waves, researchers identified hundreds of these hidden tremors worldwide.",
    "pubDate": "Fri, 20 Feb 2026 08:05:28 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040818.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Ancient DNA solves 5,500 year old burial mystery in Sweden",
    "link": "https://www.sciencedaily.com/releases/2026/02/260218031559.htm",
    "description": "Ancient DNA from a Stone Age burial site in Sweden shows that families 5,500 years ago were more complex than expected. Many individuals buried together were not immediate family, but second- or third-degree relatives. One grave held a young woman alongside two children who were siblings—yet she wasn’t their mother. The discoveries hint at tight-knit communities where extended kin mattered deeply.",
    "pubDate": "Thu, 19 Feb 2026 01:47:07 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260218031559.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "A spinning gyroscope could finally unlock ocean wave energy",
    "link": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
    "description": "Ocean waves are a vast and steady source of renewable energy, but capturing their power efficiently has long frustrated engineers. A researcher at The University of Osaka has now explored a bold new approach: a gyroscopic wave energy converter that uses a spinning flywheel inside a floating structure to turn wave motion into electricity. By harnessing gyroscopic precession—the subtle wobble of a spinning object under force—the system can be tuned to absorb energy across a wide range of wave conditions.",
    "pubDate": "Wed, 18 Feb 2026 09:33:28 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "NASA fired three rockets into the northern lights and the results are stunning",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005738.htm",
    "description": "NASA has pulled off a high-flying aurora investigation, launching three rockets into the glowing northern lights over Alaska. One mission targeted mysterious dark patches called black auroras, while the twin GNEISS rockets created a 3D scan of the aurora’s electrical currents. All rockets reached their planned altitudes and returned strong data. The result: an unprecedented look at how these dazzling light shows are wired from space to sky.",
    "pubDate": "Tue, 17 Feb 2026 23:19:32 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005738.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "125 million-year-old dinosaur with never before seen hollow spikes discovered in China",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005734.htm",
    "description": "A 125-million-year-old dinosaur just rewrote what we thought we knew about prehistoric life. Scientists in China have uncovered an exceptionally preserved juvenile iguanodontian with fossilized skin so detailed that individual cells are still visible. Even more astonishing, the plant-eating dinosaur was covered in hollow, porcupine-like spikes—structures never before documented in any dinosaur.",
    "pubDate": "Wed, 18 Feb 2026 01:10:28 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005734.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "New oxygen gel could prevent amputation in diabetic wound patients",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000255.htm",
    "description": "Chronic wounds often spiral out of control because oxygen can’t reach the deepest layers of injured tissue. A new gel developed at UC Riverside delivers a continuous flow of oxygen right where it’s needed most, using a tiny battery-powered system. In high-risk mice, wounds healed in weeks instead of worsening. The innovation could dramatically reduce amputations—and may even open doors for lab-grown organs.",
    "pubDate": "Sun, 22 Feb 2026 08:14:18 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000255.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Doctors implant dopamine-producing stem cells in Parkinson’s patients",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040820.htm",
    "description": "A groundbreaking clinical trial is testing whether specially engineered stem cells can help the brain restore its own dopamine production in people with Parkinson’s disease. Because the condition is driven by the gradual loss of dopamine-producing cells—leading to tremors, stiffness, and slowed movement—researchers are implanting lab-grown cells directly into the brain’s movement center to replace what’s been lost.",
    "pubDate": "Fri, 20 Feb 2026 04:03:58 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040820.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Scientists discover the body’s hidden “off switch” for inflammation",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040816.htm",
    "description": "A new human study has uncovered how the body naturally turns off inflammation. Researchers found that fat-derived molecules called epoxy-oxylipins rein in immune cells that can otherwise drive chronic disease. Using a drug to boost these molecules reduced pain faster and lowered harmful inflammatory cells. The discovery could pave the way for safer treatments for arthritis, heart disease, and other inflammation-related conditions.",
    "pubDate": "Thu, 19 Feb 2026 10:16:55 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040816.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Viagra and shingles vaccine show surprising promise against Alzheimer’s",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005759.htm",
    "description": "A major new study has spotlighted three familiar medicines that could take on an unexpected new role in the fight against Alzheimer’s disease — with a shingles vaccine emerging as the front-runner. After reviewing 80 existing drugs, an international panel of experts identified Zostavax, Viagra (sildenafil), and riluzole as the most promising candidates for repurposing.",
    "pubDate": "Wed, 18 Feb 2026 07:02:28 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005759.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "“I Could Barely Eat”: Man Spends 35 Years With Throat Pain, Finally Solves His Own Medical Mystery",
    "link": "https://www.boredpanda.com/mystery-throat-problem-solved-after-dinner/",
    "description": "He lived with throat pain for 35 years and was misdiagnosed with everything from mumps to allergies… even anxiety and ADHD. Years of medical procedures, therapy, and surgery didn't help so he eventually gave up on getting an accurate diagnosis. Then one rando…",
    "pubDate": "2026-02-20T23:00:22Z",
    "source": "Boredpanda.com",
    "sourceUrl": "https://www.boredpanda.com/mystery-throat-problem-solved-after-dinner/",
    "category": "health",
    "author": "Dominyka Proškėnaitė",
    "positivityScore": 4
  },
  {
    "title": "Keeley denies Dundalk the Louth bragging rights",
    "link": "https://www.rte.ie/sport/soccer/2026/0220/1559455-keeley-denies-dundalk-the-louth-bragging-rights/",
    "description": "Drogheda Utd captain Conor Keeley headed home two minutes from the end to deny Dundalk their first win back in the top flight in a fiery Louth Derby at Oriel Park.",
    "pubDate": "2026-02-20T22:09:01Z",
    "source": "RTE",
    "sourceUrl": "https://www.rte.ie/sport/soccer/2026/0220/1559455-keeley-denies-dundalk-the-louth-bragging-rights/",
    "category": "health",
    "author": "James Rogers",
    "positivityScore": 4
  },
  {
    "title": "TREMFYA® (guselkumab) long-term data show sustained clinical and endoscopic remission in ulcerative colitis through 3 years",
    "link": "https://www.jnj.com/media-center/press-releases/tremfya-guselkumab-long-term-data-show-sustained-clinical-and-endoscopic-remission-in-ulcerative-colitis-through-3-years",
    "description": "More than 80% of those treated with TREMFYA® were in clinical remission and more than 50% were in endoscopic remission at Week 140 of the QUASAR long-term extension study, showing lasting disease control for patients 78% of patients achieved intestinal healin…",
    "pubDate": "2026-02-21T13:00:00Z",
    "source": "Jnj.com",
    "sourceUrl": "https://www.jnj.com/media-center/press-releases/tremfya-guselkumab-long-term-data-show-sustained-clinical-and-endoscopic-remission-in-ulcerative-colitis-through-3-years",
    "category": "health",
    "author": null,
    "positivityScore": 4
  },
  {
    "title": "Hudbay Delivers Record Fourth Quarter and Full Year 2025 Results; Achieves 2025 Consolidated Copper and Gold Production and Cost Guidance",
    "link": "https://financialpost.com/globe-newswire/hudbay-delivers-record-fourth-quarter-and-full-year-2025-results-achieves-2025-consolidated-copper-and-gold-production-and-cost-guidance",
    "description": "TORONTO, Feb. 20, 2026 (GLOBE NEWSWIRE) — Hudbay Minerals Inc. (“Hudbay” or the “Company”) (TSX, NYSE: HBM) today released its fourth quarter and full year 2025 financial results and announced 2026 annual production and cost guidance. All amounts are in U.S. …",
    "pubDate": "2026-02-20T11:04:44Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/globe-newswire/hudbay-delivers-record-fourth-quarter-and-full-year-2025-results-achieves-2025-consolidated-copper-and-gold-production-and-cost-guidance",
    "category": "climate",
    "author": "GlobeNewswire",
    "positivityScore": 4
  },
  {
    "title": "Virginia Democrats Shelve Solar Fee That Would Have Raised Electric Bills",
    "link": "https://www.dailysignal.com/2026/02/21/virginia-democrats-shelve-solar-fee-that-would-have-raised-electric-bills/",
    "description": "Virginia Democrats this week shelved legislation that would have raised costs on consumers to fund a solar energy promotion program. The decision to table HB 935 means that Virginians won’t be hit with an added fee... Read More\nThe post Virginia Democrats She…",
    "pubDate": "2026-02-21T16:12:13Z",
    "source": "Daily Signal",
    "sourceUrl": "https://www.dailysignal.com/2026/02/21/virginia-democrats-shelve-solar-fee-that-would-have-raised-electric-bills/",
    "category": "climate",
    "author": "Reagan Campbell",
    "positivityScore": 4
  },
  {
    "title": "Renewable energy soars",
    "link": "https://northern.starweekly.com.au/news/renewable-energy-soars/",
    "description": "Energy and Resources Minister Lily D’Ambrosio has announced that Victoria has exceeded its 2025 renewable energy target. Ms D’Ambrosio said renewables accounted for 44.6 per cent of the state’s electricity generation last year, above the legislated target of …",
    "pubDate": "2026-02-22T06:50:04Z",
    "source": "Starweekly.com.au",
    "sourceUrl": "https://northern.starweekly.com.au/news/renewable-energy-soars/",
    "category": "climate",
    "author": "jimjin",
    "positivityScore": 4
  },
  {
    "title": "B2Gold Reports Q4 and Full Year 2025 Results & 2026 Guidance; Achieved 2025 Gold Production and Cost Guidance; Record Annual Revenue in 2025 of Over $3 Billion; Gold Production for 2026 Anticipated to be Between 820,000 and 970,000 oz; Q1 2026 Dividend of US$0.02 Per Share Declared",
    "link": "https://www.globenewswire.com/news-release/2026/02/18/3240719/0/en/B2Gold-Reports-Q4-and-Full-Year-2025-Results-2026-Guidance-Achieved-2025-Gold-Production-and-Cost-Guidance-Record-Annual-Revenue-in-2025-of-Over-3-Billion-Gold-Production-for-2026-.html",
    "description": "VANCOUVER, British Columbia, Feb. 18, 2026 (GLOBE NEWSWIRE) -- B2Gold Corp. (TSX: BTO, NYSE AMERICAN: BTG, NSX: B2G) (“B2Gold” or the “Company”) announces its operational and financial results for the fourth quarter and full year 2025, together with 2026 oper…",
    "pubDate": "2026-02-18T22:50:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/18/3240719/0/en/B2Gold-Reports-Q4-and-Full-Year-2025-Results-2026-Guidance-Achieved-2025-Gold-Production-and-Cost-Guidance-Record-Annual-Revenue-in-2025-of-Over-3-Billion-Gold-Production-for-2026-.html",
    "category": "climate",
    "author": "B2Gold Corp.",
    "positivityScore": 4
  },
  {
    "title": "Voter fury and the American energy ‘paradox’: Higher utility bills, record oil and gas production—and 45% of the world’s data centers",
    "link": "https://fortune.com/2026/02/20/us-political-economic-showdown-energy-costs-data-centers/",
    "description": "Electricity prices are soaring by as much as 267% in some areas of the U.S., and voters are noticing.",
    "pubDate": "2026-02-20T12:29:40Z",
    "source": "Fortune",
    "sourceUrl": "https://fortune.com/2026/02/20/us-political-economic-showdown-energy-costs-data-centers/",
    "category": "climate",
    "author": "Catherina Gioino",
    "positivityScore": 4
  },
  {
    "title": "What can be mistaken for a beaver?",
    "link": "https://www.lifesciencesworld.com/what-can-be-mistaken-for-a-beaver/",
    "description": "What Can Be Mistaken for a Beaver? Several animals share superficial similarities with beavers, leading to misidentification; however, true beavers are distinguished by their flattened, paddle-like tails, continuously growing incisors, and dam-building behavi…",
    "pubDate": "2026-02-22T05:19:01Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-can-be-mistaken-for-a-beaver/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "How long does it take for a baby dove to fly?",
    "link": "https://www.lifesciencesworld.com/how-long-does-it-take-for-a-baby-dove-to-fly/",
    "description": "How Long Does it Take for a Baby Dove to Fly? Unveiling the Fledgling Timeline A baby dove typically takes approximately 11-15 days after hatching to develop the necessary feathers and muscle strength to successfully take its first flight. This period, known …",
    "pubDate": "2026-02-22T07:20:02Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-long-does-it-take-for-a-baby-dove-to-fly/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "‘Reimagining matter’: Nobel laureate invents machine that harvests water from dry air",
    "link": "https://www.theguardian.com/environment/2026/feb/21/nobel-laureate-omar-yaghi-invents-machine-that-harvests-water-from-dry-air",
    "description": "Omar Yaghi’s invention uses ambient thermal energy and can generate up to 1,000 litres of clean water every day\nA Nobel laureate’s environmentally friendly invention that provides clean water if central supplies are knocked out by a hurricane or drought could be a life saver for vulnerable islands, its founder says.\nThe invention, by the chemist Prof Omar Yaghi, uses a type of science called reticular chemistry to create molecularly engineered materials, which can extract moisture from the air and harvest water even in arid and desert conditions.\n Continue reading...",
    "pubDate": "Sat, 21 Feb 2026 12:00:11 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/21/nobel-laureate-omar-yaghi-invents-machine-that-harvests-water-from-dry-air",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "A giant blade-crested spinosaurus, the “hell heron,” discovered in the Sahara",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222092251.htm",
    "description": "Deep in the heart of the Sahara, scientists have uncovered Spinosaurus mirabilis — a spectacular new predator crowned with a massive, scimitar-shaped crest that may once have blazed with color under the desert sun. Discovered in remote inland river deposits in Niger, the fossil rewrites what we thought we knew about spinosaur dinosaurs, suggesting they weren’t fully aquatic hunters but powerful waders stalking fish in forested waterways hundreds of miles from the sea.",
    "pubDate": "Mon, 23 Feb 2026 00:10:43 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222092251.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Flea and tick treatments for dogs and cats may be harming wildlife",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000328.htm",
    "description": "Flea and tick medications trusted by pet owners worldwide may have an unexpected environmental cost. Scientists found that active ingredients from isoxazoline treatments pass into pet feces, exposing dung-feeding insects to toxic chemicals. These insects are essential for nutrient cycling and soil health. The findings suggest everyday pet treatments could ripple through ecosystems in surprising ways.",
    "pubDate": "Sun, 22 Feb 2026 01:24:32 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000328.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "A simple water shift could turn Arctic farmland into a carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000325.htm",
    "description": "Deep in the Arctic north, drained peatlands—once massive carbon vaults built over thousands of years—are quietly leaking greenhouse gases into the atmosphere. But new field research from northern Norway suggests there’s a powerful way to slow that loss: raise the water level. In a two-year study, scientists found that restoring higher groundwater levels in cultivated Arctic peatlands dramatically cut carbon dioxide emissions, and in some cases even tipped the balance so the land absorbed more CO₂ than it released.",
    "pubDate": "Sun, 22 Feb 2026 02:51:51 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000325.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Triceratops had a giant nose that may have cooled its massive head",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000313.htm",
    "description": "Triceratops’ massive head may have been doing more than just showing off those famous horns. Using CT scans and 3D reconstructions of fossil skulls, researchers uncovered a surprisingly complex nasal system hidden inside its enormous snout. Instead of being just a supersized nose for smelling, it likely housed intricate networks of nerves and blood vessels—and even special structures that helped regulate heat and moisture.",
    "pubDate": "Sun, 22 Feb 2026 07:20:15 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000313.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Giant virus discovery could rewrite the origin of complex life",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040814.htm",
    "description": "A giant virus discovered in Japan is adding fuel to the provocative idea that viruses helped create complex life. Named ushikuvirus, it infects amoebae and shows unique traits that connect different families of giant DNA viruses. Its unusual way of hijacking and disrupting the host cell’s nucleus offers fresh insight into how viruses may have influenced the evolution of the cell nucleus itself. The finding deepens the mystery of viruses—and their possible role in life’s biggest leap.",
    "pubDate": "Thu, 19 Feb 2026 22:28:24 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040814.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Ancient microbes may have used oxygen 500 million years before it filled Earth’s atmosphere",
    "link": "https://www.sciencedaily.com/releases/2026/02/260218031609.htm",
    "description": "Life on Earth may have learned to breathe oxygen long before oxygen filled the skies. MIT researchers traced a key oxygen-processing enzyme back hundreds of millions of years before the Great Oxidation Event. Early microbes living near oxygen-producing cyanobacteria may have quickly used up the gas as it formed, slowing its rise in the atmosphere. The results suggest life was adapting to oxygen far earlier — and far more creatively — than once thought.",
    "pubDate": "Wed, 18 Feb 2026 03:50:31 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260218031609.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Microplastics have reached Antarctica’s only native insect",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "description": "Even Antarctica’s toughest native insect can’t escape the reach of plastic pollution. Scientists have discovered that Belgica antarctica — a tiny, rice-sized midge and the southernmost insect on Earth — is already ingesting microplastics in the wild. While lab tests showed the hardy larvae can survive short-term exposure without obvious harm, those exposed to higher plastic levels had reduced fat reserves, hinting at hidden energy costs.",
    "pubDate": "Mon, 16 Feb 2026 07:48:45 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Yellowstone wolves may not have transformed the national park after all",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "description": "A new scientific review challenges the headline-grabbing claim that Yellowstone’s returning wolves triggered one of the strongest trophic cascades on Earth. Researchers found that the reported 1,500% surge in willow growth was based on circular calculations and questionable comparisons. After correcting for modeling and sampling flaws, the supposed ecosystem-wide boom largely disappears.",
    "pubDate": "Thu, 12 Feb 2026 08:51:03 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Simple blood test can forecast Alzheimer’s years before memory loss",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222085203.htm",
    "description": "Scientists have created a blood test that can estimate when Alzheimer’s symptoms are likely to begin. By measuring a protein called p-tau217, the model predicts symptom onset within roughly three to four years. The protein mirrors the silent buildup of amyloid and tau in the brain long before memory loss appears. This advance could speed up preventive drug trials and eventually guide personalized care.",
    "pubDate": "Mon, 23 Feb 2026 06:46:07 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222085203.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Generative AI analyzes medical data faster than human research teams",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221060942.htm",
    "description": "Researchers tested whether generative AI could handle complex medical datasets as well as human experts. In some cases, the AI matched or outperformed teams that had spent months building prediction models. By generating usable analytical code from precise prompts, the systems dramatically reduced the time needed to process health data. The findings hint at a future where AI helps scientists move faster from data to discovery.",
    "pubDate": "Sat, 21 Feb 2026 06:17:29 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221060942.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "“Celtic curse” hotspots found in Scotland and Ireland with 1 in 54 at risk",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000332.htm",
    "description": "Researchers have mapped the genetic risk of hemochromatosis across the UK and Ireland for the first time, uncovering striking hotspots in north-west Ireland and the Outer Hebrides. In some regions, around one in 60 people carry the high-risk gene variant linked to iron overload. The condition can take decades to surface but may lead to liver cancer and arthritis if untreated.",
    "pubDate": "Sat, 21 Feb 2026 09:38:45 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000332.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Pecans found to improve cholesterol and boost heart health",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000317.htm",
    "description": "A sweeping new scientific review suggests that pecans — America’s native nut — may pack more heart power than many people realize. After analyzing over 20 years of research, scientists found consistent evidence that eating pecans can improve key markers of cardiovascular health, including total cholesterol and “bad” LDL cholesterol, while also supporting antioxidant defenses.",
    "pubDate": "Sun, 22 Feb 2026 08:52:17 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000317.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Air pollution linked to higher Alzheimer’s risk in 28 million older Americans",
    "link": "https://www.sciencedaily.com/releases/2026/02/260220010836.htm",
    "description": "Breathing polluted air may do more than harm your lungs — it could also increase your risk of Alzheimer’s disease. In a sweeping study of nearly 28 million older Americans, researchers found that long term exposure to fine particle air pollution was linked to a higher likelihood of developing Alzheimer’s. The connection appeared to stem largely from pollution’s direct effects on the brain, rather than through related health conditions like hypertension or depression.",
    "pubDate": "Fri, 20 Feb 2026 01:47:05 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260220010836.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists find cancer-linked chemicals in popular hair extensions",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219232620.htm",
    "description": "A sweeping new study has uncovered a troubling mix of hazardous chemicals in popular hair extensions, including products made from human hair. Researchers detected dozens of substances linked to cancer, hormone disruption, reproductive harm, and immune system effects in nearly every sample tested. Some products contained flame retardants, organotins, and chemicals associated with increased breast cancer risk, and several exceeded European safety thresholds.",
    "pubDate": "Thu, 19 Feb 2026 23:31:46 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219232620.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists reveal why human language isn’t like computer code",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040811.htm",
    "description": "Human language may seem messy and inefficient compared to the ultra-compact strings of ones and zeros used by computers—but our brains actually prefer it that way. New research reveals that while digital-style encoding could theoretically compress information more tightly, it would demand far more mental effort from both speaker and listener. Instead, language is built around familiar words and predictable patterns that reflect our real-world experiences, allowing the brain to constantly anticipate what comes next and narrow down meaning step by step.",
    "pubDate": "Fri, 20 Feb 2026 09:23:24 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040811.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "This AI can improve your peer review — and make it more polite",
    "link": "https://www.nature.com/articles/d41586-026-00536-6",
    "description": "",
    "pubDate": "2026-02-23T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00536-6",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Five ways increased militarization could change scientific careers",
    "link": "https://www.nature.com/articles/d41586-025-04168-0",
    "description": "",
    "pubDate": "2026-02-20T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-025-04168-0",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Deer culling to be made easier to protect trees and crops",
    "link": "https://www.bbc.com/news/articles/c0e5l7ll31yo?at_medium=RSS&at_campaign=rss",
    "description": "The government unveils a long awaited 10-year deer management plan that will identify priority culling areas.",
    "pubDate": "Thu, 19 Feb 2026 22:58:13 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c0e5l7ll31yo?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "'Smiling' fossil discovered on Holy Island",
    "link": "https://www.bbc.com/news/articles/c7v0ev05mdjo?at_medium=RSS&at_campaign=rss",
    "description": "The unusual looking fossil is estimated to be a few hundred million years old dating to the Carboniferous period.",
    "pubDate": "Thu, 19 Feb 2026 05:07:07 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c7v0ev05mdjo?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Are wetter winters and frequent flooding here to stay?",
    "link": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "description": "Many places across the UK have experienced their wettest January in more than 100 years.",
    "pubDate": "Wed, 11 Feb 2026 02:59:08 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "NASA’s Hubble spots nearly invisible “ghost galaxy” made of 99% dark matter",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000307.htm",
    "description": "Astronomers have uncovered one of the most mysterious galaxies ever found — a dim, ghostly object called CDG-2 that is almost entirely made of dark matter. Located 300 million light-years away in the Perseus galaxy cluster, it was discovered in an unusual way: not by its stars, but by four tightly packed globular clusters acting like cosmic breadcrumbs.",
    "pubDate": "Sat, 21 Feb 2026 01:57:52 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000307.htm",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Scientists may have found the holy grail of quantum computing",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000252.htm",
    "description": "Scientists may have spotted a long-sought triplet superconductor — a material that can transmit both electricity and electron spin with zero resistance. That ability could dramatically stabilize quantum computers while slashing their energy use. Early experiments suggest the alloy NbRe behaves unlike any conventional superconductor. If verified, it could become a cornerstone of next-generation quantum and spintronic technology.",
    "pubDate": "Sat, 21 Feb 2026 07:10:00 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000252.htm",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Is it possible to teach a gorilla to talk?",
    "link": "https://www.lifesciencesworld.com/is-it-possible-to-teach-a-gorilla-to-talk/",
    "description": "Can We Really Teach Gorillas to Talk? Exploring the Possibilities No, it is not possible to teach a gorilla to talk in the human sense, but remarkable progress has been made in teaching them to communicate using sign language and other methods, offering profo…",
    "pubDate": "2026-02-22T05:57:36Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/is-it-possible-to-teach-a-gorilla-to-talk/",
    "category": "science",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Microsoft's latest glass storage breakthrough promises to hold data for 10,000 years — but will Project Silica shatter under the pressure?",
    "link": "https://www.techradar.com/pro/microsofts-latest-glass-storage-breakthrough-promises-to-hold-data-for-10-000-years-but-will-project-silica-shatter-under-the-pressure",
    "description": "Microsoft’s Project Silica explores storing data in borosilicate glass with millennia-long durability, but speed and practicality issues cast serious doubts.",
    "pubDate": "2026-02-21T16:05:00Z",
    "source": "TechRadar",
    "sourceUrl": "https://www.techradar.com/pro/microsofts-latest-glass-storage-breakthrough-promises-to-hold-data-for-10-000-years-but-will-project-silica-shatter-under-the-pressure",
    "category": "science",
    "author": "Efosa Udinmwen",
    "positivityScore": 2
  },
  {
    "title": "Google Gemini 3.1 Pro Nearly Doubles Apex Agents Score to 33.5",
    "link": "https://www.geeky-gadgets.com/gemini-3-1-pro-benchmarks/",
    "description": "Gemini 3.1 Pro represents a significant advancement in artificial intelligence, emphasizing autonomous task execution and practical problem-solving. According to Wes Roth, this latest iteration builds on the strengths of its predecessor, Gemini 3 Pro, while a…",
    "pubDate": "2026-02-21T15:00:50Z",
    "source": "Geeky Gadgets",
    "sourceUrl": "https://www.geeky-gadgets.com/gemini-3-1-pro-benchmarks/",
    "category": "science",
    "author": "Julian Horsey",
    "positivityScore": 2
  },
  {
    "title": "What Is Fasting?",
    "link": "https://www.crossway.org/articles/what-is-fasting/",
    "description": "Our spiritual appetites need a recalibration so that we find pleasure in Christ instead of in the world’s offerings. The solution isn’t to pursue what this world can offer but to seek what truly nourishes.",
    "pubDate": "2026-02-21T12:00:00Z",
    "source": "Crossway.org",
    "sourceUrl": "https://www.crossway.org/articles/what-is-fasting/",
    "category": "health",
    "author": "Cassie Achermann",
    "positivityScore": 2
  },
  {
    "title": "How safe is America from polio?",
    "link": "https://www.cbsnews.com/news/how-safe-is-america-from-polio/",
    "description": "After decades of American children routinely receiving polio vaccines, the virus that had doomed many to paralysis was nearly eliminated in the United States. But vaccine avoidance today may allow the crippling disease to return.",
    "pubDate": "2026-02-22T14:15:46Z",
    "source": "CBS News",
    "sourceUrl": "https://www.cbsnews.com/news/how-safe-is-america-from-polio/",
    "category": "health",
    "author": "Jon  LaPook",
    "positivityScore": 2
  },
  {
    "title": "Retatrutide: The Next-Generation Triple Agonist Advancing Obesity and Metabolic Treatment",
    "link": "https://www.mycarebridgemed.com/post/retatrutide-the-next-generation-triple-agonist-advancing-obesity-and-metabolic-treatment",
    "description": "By Mohsen Halaby, MDBoard-Certified in Internal MedicineFounder, Carebridge MedicalServing Patients in Ohio & CaliforniaIn recent years, GLP-1 receptor agonists have transformed the treatment landscape for obesity and type 2 diabetes. Now, Eli Lilly’s investi…",
    "pubDate": "2026-02-21T23:09:13Z",
    "source": "Mycarebridgemed.com",
    "sourceUrl": "https://www.mycarebridgemed.com/post/retatrutide-the-next-generation-triple-agonist-advancing-obesity-and-metabolic-treatment",
    "category": "health",
    "author": "Mohsen Halaby",
    "positivityScore": 2
  },
  {
    "title": "Did James Van Der Beek Really Die Broke?",
    "link": "http://www.hollywoodreporter.com/news/general-news/james-van-der-beek-financial-struggles-gofundme-1236510777/",
    "description": "Hollywood has rallied behind the late 'Dawson’s Creek' star, raising $2.6 million for his widow and six children. But the internet has been less generous, with scores of posters wondering why such a famous actor would need a fundraiser in the first place.",
    "pubDate": "2026-02-21T14:30:00Z",
    "source": "Hollywood Reporter",
    "sourceUrl": "http://www.hollywoodreporter.com/news/general-news/james-van-der-beek-financial-struggles-gofundme-1236510777/",
    "category": "health",
    "author": "Benjamin Svetkey",
    "positivityScore": 2
  },
  {
    "title": "Three ways Canada can navigate an increasingly erratic and belligerent United States",
    "link": "https://theconversation.com/three-ways-canada-can-navigate-an-increasingly-erratic-and-belligerent-united-states-276035",
    "description": "Canada can draw lessons from its centuries-long coexistence with an often-erratic neighbour to successfully navigate the economic volatility of the present era.",
    "pubDate": "2026-02-22T13:59:03Z",
    "source": "The Conversation Africa",
    "sourceUrl": "https://theconversation.com/three-ways-canada-can-navigate-an-increasingly-erratic-and-belligerent-united-states-276035",
    "category": "climate",
    "author": "Charles Conteh, Professor of Public Policy and Administration, Department of Political Science, Brock University",
    "positivityScore": 2
  },
  {
    "title": "Precious Metal Market Volume to Worth 756.65 Million Tons by 2035",
    "link": "https://www.globenewswire.com/news-release/2026/02/21/3242227/0/en/Precious-Metal-Market-Volume-to-Worth-756-65-Million-Tons-by-2035.html",
    "description": "The global precious metal market volume is projected to grow from 500.59 million tons in 2026 to 756.65 million tons by 2035, at a CAGR of 4.70%....",
    "pubDate": "2026-02-21T14:01:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/21/3242227/0/en/Precious-Metal-Market-Volume-to-Worth-756-65-Million-Tons-by-2035.html",
    "category": "climate",
    "author": "Precedence Research",
    "positivityScore": 2
  },
  {
    "title": "Mercury boss Stew Hamilton on its billion dollar renewable energy push",
    "link": "https://www.nzherald.co.nz/business/companies/energy/mercury-boss-stew-hamilton-on-its-high-hopes-for-geothermeral-energy/premium/55GX4NK2AJGFXK4IQT6HIRG3ZE/",
    "description": "Mercury's boss says gentailers are now building new plants faster than 'Think Big'.",
    "pubDate": "2026-02-20T18:00:00Z",
    "source": "New Zealand Herald",
    "sourceUrl": "https://www.nzherald.co.nz/business/companies/energy/mercury-boss-stew-hamilton-on-its-high-hopes-for-geothermeral-energy/premium/55GX4NK2AJGFXK4IQT6HIRG3ZE/",
    "category": "climate",
    "author": "Jamie Gray",
    "positivityScore": 2
  },
  {
    "title": "I’ve owned an EV for four years – and the one big solution to my range anxiety woes is stuck in political traffic",
    "link": "https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/ive-owned-an-ev-for-four-years-and-the-one-big-solution-to-my-range-anxiety-woes-is-stuck-in-political-traffic",
    "description": "Curb-side charging opens up EVs to those that lack off-street parking, but uptake outside of the major cities is still painfully slow",
    "pubDate": "2026-02-22T11:30:00Z",
    "source": "TechRadar",
    "sourceUrl": "https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/ive-owned-an-ev-for-four-years-and-the-one-big-solution-to-my-range-anxiety-woes-is-stuck-in-political-traffic",
    "category": "climate",
    "author": "Leon Poultney",
    "positivityScore": 2
  },
  {
    "title": "What plants do gophers hate the most?",
    "link": "https://www.lifesciencesworld.com/what-plants-do-gophers-hate-the-most/",
    "description": "What Plants Do Gophers Hate the Most? A Gardener’s Guide to Natural Pest Control To naturally deter these persistent burrowing rodents, plant species with strong scents, toxic qualities, or physically challenging root systems. This approach, while not foolpro…",
    "pubDate": "2026-02-22T06:29:06Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-plants-do-gophers-hate-the-most/",
    "category": "climate",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "‘A brutalist design’: Planned flood defences for south Dublin rail line divide opinion",
    "link": "https://www.irishtimes.com/ireland/dublin/2026/02/23/a-brutalist-design-planned-flood-defences-for-rail-line-in-south-dublin-divides-opinion/",
    "description": "Some residents in Blackrock and neighbouring areas are not convinced by a proposed solution from Irish Rail to defend against future floods",
    "pubDate": "2026-02-22T06:00:00Z",
    "source": "The Irish Times",
    "sourceUrl": "https://www.irishtimes.com/ireland/dublin/2026/02/23/a-brutalist-design-planned-flood-defences-for-rail-line-in-south-dublin-divides-opinion/",
    "category": "climate",
    "author": "Katie Mellett",
    "positivityScore": 2
  },
  {
    "title": "Former employees continue biofuel technology development at Tofte",
    "link": "https://www.globenewswire.com/news-release/2026/02/19/3240841/0/en/Former-employees-continue-biofuel-technology-development-at-Tofte.html",
    "description": "(Oslo, 19 February 2026) Statkraft and a group of former employees of Silva Green Fuel have reached an agreement that enables the continued testing of technology for biofuel production at Tofte.As part of its new strategy, Statkraft is prioritising profitable…",
    "pubDate": "2026-02-19T10:00:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/19/3240841/0/en/Former-employees-continue-biofuel-technology-development-at-Tofte.html",
    "category": "climate",
    "author": "Statkraft AS",
    "positivityScore": 2
  },
  {
    "title": "BehaveAI enables rapid detection and classification of objects and behavior from motion",
    "link": "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3003632",
    "description": "Despite decades of advancement in video processing, efficient and accurate quantification of complex motion information remains a computational challenge. This study presents BehaveAI, a biologically inspired video analysis tool that sees motion as color, abl…",
    "pubDate": "2026-02-20T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3003632",
    "category": "climate",
    "author": "Jolyon Troscianko, Thomas A. O’Shea-Wheller, James A. M. Galloway, Kevin J. Gaston",
    "positivityScore": 2
  },
  {
    "title": "THOMAS LIMBERGER: Why Trump’s America Is Winning The AI Race — And Why Germany Is Falling Behind",
    "link": "https://dailycaller.com/2026/02/20/opinion-why-trumps-america-is-winning-the-ai-race-and-why-germany-is-falling-behind-thomas-limberger/",
    "description": "Imagine this. You open your phone in the morning. You check the news, your bank account, your health app, your navigation system. Maybe later you use AI to",
    "pubDate": "2026-02-20T07:10:08Z",
    "source": "The Daily Caller",
    "sourceUrl": "https://dailycaller.com/2026/02/20/opinion-why-trumps-america-is-winning-the-ai-race-and-why-germany-is-falling-behind-thomas-limberger/",
    "category": "climate",
    "author": "Thomas P. Limberger",
    "positivityScore": 2
  }
]