[
  {
    "title": "China’s Yangtze River Rebounds After Fishing Ban and Investment to Reemploy 200,000 Fishermen",
    "link": "https://www.goodnewsnetwork.org/chinas-yangtze-river-rebounds-after-fishing-ban-and-investment-to-reemploy-200000-fishermen/",
    "description": "The mighty Yangtze river has experienced a dramatic improvement in ecological health halfway through a 10-year fishing moratorium. The focus of a $2.7 billion restoration project, this crucial aquatic artery had been severely degraded by decades of damming, overfishing, fragmentation, pollution, and neglect. Now, a new study reports a tripling of fish biomass, increases in […]\nThe post China’s Yangtze River Rebounds After Fishing Ban and Investment to Reemploy 200,000 Fishermen appeared first on Good News Network.",
    "pubDate": "Tue, 24 Feb 2026 14:00:53 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/chinas-yangtze-river-rebounds-after-fishing-ban-and-investment-to-reemploy-200000-fishermen/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Ancient Egyptian Artifacts Recovered Just One Day After Being Stolen from Australian Museum",
    "link": "https://www.goodnewsnetwork.org/ancient-egyptian-artifacts-recovered-just-one-day-after-being-stolen-from-australian-museum/",
    "description": "Queensland police say they’ve recovered 4 priceless artifacts of ancient Egyptian antiquity that had been stolen from a museum earlier this month. The world is experiencing a rash of unsolved museum break-ins lately, but thanks to superb policing, this one wasn’t added to the list. At approximately 3 a.m., a police report stated, a man […]\nThe post Ancient Egyptian Artifacts Recovered Just One Day After Being Stolen from Australian Museum appeared first on Good News Network.",
    "pubDate": "Tue, 24 Feb 2026 12:00:42 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/ancient-egyptian-artifacts-recovered-just-one-day-after-being-stolen-from-australian-museum/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Uttarakhand achieves 1 GW solar energy capacity boosting green energy push and local jobs",
    "link": "https://timesofindia.indiatimes.com/india/uttarakhand-achieves-1-gw-solar-energy-capacity-boosting-green-energy-push-and-local-jobs/articleshow/128518899.cms",
    "description": "India News: Uttarakhand has crossed a major renewable energy milestone, surpassing 1 gigawatt (GW) of installed solar power capacity. The state’s total installed .",
    "pubDate": "2026-02-18T17:30:21Z",
    "source": "The Times of India",
    "sourceUrl": "https://timesofindia.indiatimes.com/india/uttarakhand-achieves-1-gw-solar-energy-capacity-boosting-green-energy-push-and-local-jobs/articleshow/128518899.cms",
    "category": "climate",
    "author": "The Times Of India",
    "positivityScore": 10
  },
  {
    "title": "What went right this week: new law sends a ‘powerful message’ against online abuse, plus more",
    "link": "https://www.positive.news/society/good-news-stories-from-week-8-of-2026/",
    "description": "A law to protect survivors of online abuse was proposed, two rare birds made a resurgence, and new psychedelics research emerged, plus more\nThe post What went right this week: new law sends a ‘powerful message’ against online abuse, plus more appeared first on Positive News.",
    "pubDate": "Fri, 20 Feb 2026 05:00:21 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/good-news-stories-from-week-8-of-2026/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 24",
    "link": "https://www.goodnewsnetwork.org/events070224/",
    "description": "190 years ago today, one of the foremost painters of 19th-century America, Winslow Homer, was born. Born in Boston to a father always seeking to pull off a get-rich-quick scheme, Homer was molded by his mother; a talented watercolor painter who taught him the basics. His most prolific period was when he moved to Maine […]\nThe post Good News in History, February 24 appeared first on Good News Network.",
    "pubDate": "Tue, 24 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070224/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Diseased Rhino Recovers After Florida Zoo Team Surprise Locals with Pioneering Veterinary Tactics",
    "link": "https://www.goodnewsnetwork.org/diseased-rhino-recovers-after-florida-zoo-team-surprise-locals-with-pioneering-veterinary-tactics/",
    "description": "A Florida zoo team recently traveled to Zimbabwe after they were asked to help a white rhino suffering from a parasitic eye infection. They came up with a “ridiculous idea” to corral the wild animal, earn its trust as if it were a horse or dog, and administer eye drops and other care. It took […]\nThe post Diseased Rhino Recovers After Florida Zoo Team Surprise Locals with Pioneering Veterinary Tactics appeared first on Good News Network.",
    "pubDate": "Mon, 23 Feb 2026 16:30:11 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/diseased-rhino-recovers-after-florida-zoo-team-surprise-locals-with-pioneering-veterinary-tactics/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Osaka Stunned by Anonymous Gift of Gold Bars to Fix Aging Water Pipes",
    "link": "https://www.goodnewsnetwork.org/osaka-stunned-by-anonymous-gift-of-gold-bars-to-fix-aging-water-pipes/",
    "description": "Have you seen the price of gold recently? In the Japanese city of Osaka, one man obviously did, and decided to cash in for the sake of his community. The mayor and his staff were staggered when they discovered an anonymous resident had presented 21 kilograms of gold bars to the city as a contribution […]\nThe post Osaka Stunned by Anonymous Gift of Gold Bars to Fix Aging Water Pipes appeared first on Good News Network.",
    "pubDate": "Mon, 23 Feb 2026 14:00:15 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/osaka-stunned-by-anonymous-gift-of-gold-bars-to-fix-aging-water-pipes/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Overcoming 3D-Printer Challenges, MIT Produces an Electric Motor in Just 3 Hours",
    "link": "https://www.goodnewsnetwork.org/overcoming-3d-printer-challenges-mit-produces-an-electric-motor-in-just-3-hours/",
    "description": "A broken motor can bring an automated machine factory to a halt—and instead of ordering a replacement part that could take days or weeks to arrive, with costly production delays, it may soon be easier, faster, and much cheaper to make a new motor onsite. MIT researchers announced on Wednesday that they have developed a […]\nThe post Overcoming 3D-Printer Challenges, MIT Produces an Electric Motor in Just 3 Hours appeared first on Good News Network.",
    "pubDate": "Sun, 22 Feb 2026 12:00:09 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/overcoming-3d-printer-challenges-mit-produces-an-electric-motor-in-just-3-hours/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Teacher Wins $1M Prize for Turning India’s Slums Into Hundreds of Open-Air Classrooms",
    "link": "https://www.goodnewsnetwork.org/teacher-wins-1m-prize-for-turning-indias-slums-into-hundreds-of-open-air-classrooms/",
    "description": "An Indian teacher who has established more than 800 learning centers across India for children who have never attended school has been named the winner of the $1 million Global Teacher Prize from GEMS Education. Located in over 100 slums and villages, Rouble Nagi’s classrooms offer safe, inspiring spaces to help overcome the challenging conditions […]\nThe post Teacher Wins $1M Prize for Turning India’s Slums Into Hundreds of Open-Air Classrooms appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 19:18:40 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/teacher-wins-1m-prize-for-turning-indias-slums-into-hundreds-of-open-air-classrooms/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "High Schoolers and Seniors Build Unlikely Friendships Through Chair Volleyball",
    "link": "https://www.goodnewsnetwork.org/high-schoolers-and-seniors-build-unlikely-friendship-through-chair-volleyball/",
    "description": "What started as a simple chair volleyball game at a senior living community in Belton, Texas, has grown into a meaningful intergenerational friendship. The sporty seniors, who proudly call themselves “The Hit Squad,” regularly host friendly chair volleyball matches with members of the Lake Belton High School volleyball team. The games have become a highlight […]\nThe post High Schoolers and Seniors Build Unlikely Friendships Through Chair Volleyball appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 16:46:53 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/high-schoolers-and-seniors-build-unlikely-friendship-through-chair-volleyball/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "‘Astonishing” New Scimitar-Shaped Crested Dinosaur Discovered in Sahara Desert: ‘You might uncover a lost world’",
    "link": "https://www.goodnewsnetwork.org/astonishing-new-scimitar-shaped-crested-dinosaur-discovered-in-sahara-desert/",
    "description": "Scientists called “astonishing” the first indisputable evidence of a new species of Spinosaurus found in over a century—uncovered in a remote area of the Sahara Desert. The newly discovered scimitar-crested dinosaur was described as a “hell heron” that fed on fish despite living hundreds of miles from the sea. Paleontologists say it appears to have […]\nThe post ‘Astonishing” New Scimitar-Shaped Crested Dinosaur Discovered in Sahara Desert: ‘You might uncover a lost world’ appeared first on Good News Network.",
    "pubDate": "Fri, 20 Feb 2026 17:00:39 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/astonishing-new-scimitar-shaped-crested-dinosaur-discovered-in-sahara-desert/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Reform mayor courted US oil and gas executive about fracking in UK",
    "link": "https://www.theguardian.com/environment/2026/feb/24/reform-uk-mayor-andrea-jenkyns-us-oil-gas-executive-fracking-lincolnshire",
    "description": "Exclusive: Documents show Andrea Jenkyns asked how she could help firm after major gas find in Lincolnshire\nLincolnshire’s Reform party mayor, Dame Andrea Jenkyns, has courted the head of an American oil and gas dynasty in the hope of bringing fracking to the county, the Guardian can reveal.\nEgdon Resources, a British subsidiary of the US fracker Heyco Energy, announced a major gas discovery in Lincolnshire’s Gainsborough Trough last year. Jenkyns, who became the first mayor of Greater Lincolnshire in May, reached out personally to the company asking how she “could help with your recent gas find in my county”, according to records released by the mayoral authority in response to a freedom of information request.\n Continue reading...",
    "pubDate": "Tue, 24 Feb 2026 06:00:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/24/reform-uk-mayor-andrea-jenkyns-us-oil-gas-executive-fracking-lincolnshire",
    "category": "climate",
    "positivityScore": 8
  },
  {
    "title": "Improved immune responses and tuberculosis protection by aerosol vaccination with recombinant BCG expressing ESX-1 from Mycobacterium marinum",
    "link": "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1013992",
    "description": "Author summary Anti-tuberculosis vaccine efficacy is influenced by multiple parameters, including the immunogenicity of the vaccine strain, the type of preclinical host model used, and the route of vaccination. Given recent advances in the field of mucosal va…",
    "pubDate": "2026-02-23T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1013992",
    "category": "health",
    "author": "Fadel Sayes, Wafa Frigui, Alexandre Pawlik, Cécile Tillier, Magali Tichit, David Hardy, Roland Brosch",
    "positivityScore": 8
  },
  {
    "title": "PRF Technologies’ DeepSolar Announces its First Commercial Due Diligence Engagement with EDF Power Solutions Israel, a Global Leader in Renewable Energy",
    "link": "https://www.globenewswire.com/news-release/2026/02/18/3240327/0/en/PRF-Technologies-DeepSolar-Announces-its-First-Commercial-Due-Diligence-Engagement-with-EDF-Power-Solutions-Israel-a-Global-Leader-in-Renewable-Energy.html",
    "description": "Agreement Initiates Data-Driven Technical Due Diligence of an Operational, Utility-Scale Solar Asset in Israel Agreement Initiates Data-Driven Technical Due Diligence of an Operational, Utility-Scale Solar Asset in Israel",
    "pubDate": "2026-02-18T14:15:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/18/3240327/0/en/PRF-Technologies-DeepSolar-Announces-its-First-Commercial-Due-Diligence-Engagement-with-EDF-Power-Solutions-Israel-a-Global-Leader-in-Renewable-Energy.html",
    "category": "climate",
    "author": "PRF Technologies Ltd",
    "positivityScore": 8
  },
  {
    "title": "How a football cup run helped unite a town",
    "link": "https://www.positive.news/society/how-a-football-cup-run-helped-unite-a-town/",
    "description": "For a club rooted in non-league football, Macclesfield’s recent FA Cup didn't just connect those on the pitch, but a whole community\nThe post How a football cup run helped unite a town appeared first on Positive News.",
    "pubDate": "Fri, 20 Feb 2026 07:17:01 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/how-a-football-cup-run-helped-unite-a-town/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Fish biology inspires laundry microplastics clean up",
    "link": "https://www.positive.news/environment/fish-biology-inspires-laundry-microplastics-clean-up/",
    "description": "Inspired by marine life, inventors have created a filter to trap pesky microplastics leaked during laundry\nThe post Fish biology inspires laundry microplastics clean up appeared first on Positive News.",
    "pubDate": "Wed, 18 Feb 2026 07:00:39 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/environment/fish-biology-inspires-laundry-microplastics-clean-up/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "How species spotting took hold of a rural community",
    "link": "https://www.positive.news/society/how-species-spotting-took-hold-rural-community/",
    "description": "A village in north Somerset has got passionate about rare species spotting, thanks to the efforts of Yeo Valley Organic \nThe post How species spotting took hold of a rural community appeared first on Positive News.",
    "pubDate": "Tue, 17 Feb 2026 14:54:50 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/how-species-spotting-took-hold-rural-community/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Infecting Mosquitoes with Natural Bacteria Lowered Dengue Risk by 70% in Citywide Experiment",
    "link": "https://www.goodnewsnetwork.org/infecting-mosquitoes-with-natural-bacteria-lowered-dengue-risk-by-70-in-citywide-experiment/",
    "description": "A gold-standard scientific trial revealed an existing mosquito control method works not only to reduce insect numbers, but also the diagnoses of dengue fever in the area. Dengue, also known as “breakbone” fever, is a severe viral infection spread by mosquitoes that can be debilitating when caught, and lethal if caught again. In Singapore, populations […]\nThe post Infecting Mosquitoes with Natural Bacteria Lowered Dengue Risk by 70% in Citywide Experiment appeared first on Good News Network.",
    "pubDate": "Mon, 23 Feb 2026 19:30:42 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/infecting-mosquitoes-with-natural-bacteria-lowered-dengue-risk-by-70-in-citywide-experiment/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 23",
    "link": "https://www.goodnewsnetwork.org/events070223/",
    "description": "140 years ago today, an American inventor used electrolysis to extract aluminum from aluminum oxide, a process that eventually resulted in reducing the price of aluminum by a factor of 200, making it affordable for many practical uses from soda cans to the Wright Flyer. As small grains amid clay, it was thought by medieval […]\nThe post Good News in History, February 23 appeared first on Good News Network.",
    "pubDate": "Mon, 23 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070223/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Plastic Mardi Gras Beads Just End up in Landfill, So Coalition Swaps in Seed Beads and Jambalaya Spice Packets",
    "link": "https://www.goodnewsnetwork.org/plastic-mardi-gras-beads-swapped-out-for-seed-beads-and-spice-packets/",
    "description": "Flung plastic beads, coins, and other trinkets can seem like treasures in the heat of a Mardi Gras moment, but if you’ve ever seen the streets of New Orleans the morning after, you’d recognize only trash. That’s why a coalition of government agencies and nonprofits is creating “seed beads,” biodegradable party favors, and culturally-smart alternatives […]\nThe post Plastic Mardi Gras Beads Just End up in Landfill, So Coalition Swaps in Seed Beads and Jambalaya Spice Packets appeared first on Good News Network.",
    "pubDate": "Sun, 22 Feb 2026 16:00:41 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/plastic-mardi-gras-beads-swapped-out-for-seed-beads-and-spice-packets/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Town Enthusiastically Switches to Restorative Justice and Reoffending Almost Vanishes",
    "link": "https://www.goodnewsnetwork.org/rural-town-enthusiastically-switches-to-restorative-justice-and-recidivism-almost-vanishes/",
    "description": "In northern Alberta, a restorative justice program is making a huge difference in a closely-knit community. With just 68,000 residents, putting someone from Fort McMurray in prison or juvenile detention has a big impact. Instead, a restorative justice program established for the town’s youth in 2022 has been expanded to include adults, and the results […]\nThe post Town Enthusiastically Switches to Restorative Justice and Reoffending Almost Vanishes appeared first on Good News Network.",
    "pubDate": "Sun, 22 Feb 2026 14:00:39 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/rural-town-enthusiastically-switches-to-restorative-justice-and-recidivism-almost-vanishes/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 22",
    "link": "https://www.goodnewsnetwork.org/events070222/",
    "description": "207 years ago today, Spain sold Florida to the United States as part of the Adams-Onis Treaty. It settled a standing border dispute between the two countries and was considered a triumph of American diplomacy. The cost was equivalent to $537.8 million in today’s dollars priced in gold, but was just 5 million Spanish dollars […]\nThe post Good News in History, February 22 appeared first on Good News Network.",
    "pubDate": "Sun, 22 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070222/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Newborn Giraffe With Distinctive Hair-do is Charming Visitors to Ohio Zoo–And They Gave Him the Perfect Name",
    "link": "https://www.goodnewsnetwork.org/newborn-giraffe-with-distinctive-hair-do-is-charming-visitors-to-ohio-zoo/",
    "description": "A four-week-old baby giraffe is becoming a social media sensation, thanks to his remarkable tuft of hair. His new name, Eugene, chosen from public suggestions, has proven to be a perfect fit for the young giraffe’s charming personality. The Toledo Zoo & Aquarium in Ohio welcomed the calf, weighing 130 lbs, on January 17 when […]\nThe post Newborn Giraffe With Distinctive Hair-do is Charming Visitors to Ohio Zoo–And They Gave Him the Perfect Name appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 14:51:45 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/newborn-giraffe-with-distinctive-hair-do-is-charming-visitors-to-ohio-zoo/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny",
    "link": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-21-2026/",
    "description": "Our partner Rob Brezsny, who has a new book out, Astrology Is Real: Revelations from My Life as an Oracle, provides his weekly wisdom to enlighten our thinking and motivate our mood. Rob’s Free Will Astrology, is a syndicated weekly column appearing in over a hundred publications. He is also the author of Pronoia Is the Antidote […]\nThe post Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 11:00:45 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-21-2026/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 21",
    "link": "https://www.goodnewsnetwork.org/events070221/",
    "description": "198 years ago today, the first issue of the Cherokee Phoenix was published using the Cherokee syllabary invented by Sequoyah. Sequoyah, also known as George Gist, was a Cherokee polymath who was one of the few people in history from a pre-literate group who created the original written system for that group’s language. Just as […]\nThe post Good News in History, February 21 appeared first on Good News Network.",
    "pubDate": "Sat, 21 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070221/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "From Clicks to Cleanups: Juba’s Youth-Led Waste Revolution",
    "link": "https://reasonstobecheerful.world/south-sudan-juba-youth-led-waste-revolution/",
    "description": "The first time Makur Majeng posted photos on social media of trash-clogged drainage ditches along the White Nile in Juba, the capital of South Sudan, his phone would not stop buzzing. “How can I help?” one message read. Within hours, 20 young people — many of whom had never met...\nThe post From Clicks to Cleanups: Juba’s Youth-Led Waste Revolution appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 23 Feb 2026 12:58:30 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/south-sudan-juba-youth-led-waste-revolution/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "A Recipe For Women’s Empowerment in Morocco",
    "link": "https://reasonstobecheerful.world/morocco-recipe-for-womens-empowerment/",
    "description": "All over the city of Marrakesh, football fever had taken hold. Africa’s continent-wide soccer competition, AFCON, was being hosted in Morocco. And here, at the Amal Targa Center, a fan zone had been set up for the big clash between Egypt and Benin. Yet the most impressive team performing that...\nThe post A Recipe For Women’s Empowerment in Morocco appeared first on Reasons to be Cheerful.",
    "pubDate": "Fri, 20 Feb 2026 12:50:39 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/morocco-recipe-for-womens-empowerment/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "What We’re Reading: A Carnival Clean-Up in New Orleans",
    "link": "https://reasonstobecheerful.world/what-were-reading-new-orleans-carnival-cleanup/",
    "description": "Welcome back to our weekly behind-the-scenes glimpse at what’s getting our team talking. Tell us what you’ve been reading at info@reasonstobecheerful.world and we just might feature it here. From plastic to petals Sequin-clad merrymakers filled the streets of New Orleans once more this week to celebrate Mardi Gras, the jubilant...\nThe post What We’re Reading: A Carnival Clean-Up in New Orleans appeared first on Reasons to be Cheerful.",
    "pubDate": "Wed, 18 Feb 2026 23:06:12 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/what-were-reading-new-orleans-carnival-cleanup/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Scientists discover why high altitude protects against diabetes",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221060952.htm",
    "description": "Living at high altitude appears to protect against diabetes, and scientists have finally discovered the reason. When oxygen levels drop, red blood cells switch into a new metabolic mode and absorb large amounts of glucose from the blood. This helps the body cope with thin air while also reducing blood sugar levels. A drug that recreates this effect reversed diabetes in mice, hinting at a powerful new treatment strategy.",
    "pubDate": "Sat, 21 Feb 2026 08:43:47 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221060952.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "Scientists reveal how exercise protects the brain from Alzheimer’s",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040752.htm",
    "description": "Exercise may sharpen the mind by repairing the brain’s protective shield. Researchers found that physical activity prompts the liver to release an enzyme that removes a harmful protein causing the blood-brain barrier to become leaky with age. In older mice, dialing down this protein reduced inflammation and improved memory. The discovery points to a surprising body-to-brain pathway that could inspire new Alzheimer’s therapies.",
    "pubDate": "Fri, 20 Feb 2026 10:19:43 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040752.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "UK medical device testing hits a high",
    "link": "https://www.thehindubusinessline.com/specials/pulse/uk-medical-device-testing-hits-a-high/article70653393.ece",
    "description": "UK medical device testing reaches record levels, offering patients quicker access to innovative technologies and improved healthcare solutions.",
    "pubDate": "2026-02-22T15:08:23Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/specials/pulse/uk-medical-device-testing-hits-a-high/article70653393.ece",
    "category": "science",
    "author": "Team BL",
    "positivityScore": 6
  },
  {
    "title": "Medical Waste Management Industry Report 2026-2035: A $25+ Billion Market by 2030 with Stericycle, Veolia Environmental Services, Clean Harbors, Suez Environmental Leading",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242375/28124/en/Medical-Waste-Management-Industry-Report-2026-2035-A-25-Billion-Market-by-2030-with-Stericycle-Veolia-Environmental-Services-Clean-Harbors-Suez-Environmental-Leading.html",
    "description": "The medical waste management market presents opportunities in expanding sustainable practices, enhancing healthcare safety, and meeting rising regulatory compliance demands. Key growth drivers include increased healthcare waste due to an aging population and …",
    "pubDate": "2026-02-23T09:13:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/23/3242375/28124/en/Medical-Waste-Management-Industry-Report-2026-2035-A-25-Billion-Market-by-2030-with-Stericycle-Veolia-Environmental-Services-Clean-Harbors-Suez-Environmental-Leading.html",
    "category": "health",
    "author": "Research and Markets",
    "positivityScore": 6
  },
  {
    "title": "Underground 'battery' deep in the outback could power millions of homes",
    "link": "https://www.abc.net.au/news/rural/2026-02-22/geologists-drill-into-adavale-basin-to-assess-energy-potential/106173564",
    "description": "They are older than the dinosaurs and buried deep underground, but scientists are pinning their hopes on ancient salt caverns to solve Australia’s green energy storage problem.",
    "pubDate": "2026-02-21T22:40:14Z",
    "source": "ABC News (AU)",
    "sourceUrl": "https://www.abc.net.au/news/rural/2026-02-22/geologists-drill-into-adavale-basin-to-assess-energy-potential/106173564",
    "category": "climate",
    "author": "Crispian Yeomans",
    "positivityScore": 6
  },
  {
    "title": "A New Milestone for the Energy Transition: The Forêt Domaniale Wind Farm Is Authorized",
    "link": "https://financialpost.com/pmn/business-wire-news-releases-pmn/a-new-milestone-for-the-energy-transition-the-foret-domaniale-wind-farm-is-authorized",
    "description": "MONTMAGNY, Québec — EDF solutions électriques and Alliance de l’énergie de l’Est enthusiastically welcome the adoption of the government decree authorizing the construction of the Forêt Domaniale wind farm, a project of 30 wind turbines with a total installed…",
    "pubDate": "2026-02-18T17:13:17Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/pmn/business-wire-news-releases-pmn/a-new-milestone-for-the-energy-transition-the-foret-domaniale-wind-farm-is-authorized",
    "category": "climate",
    "author": "Business Wire",
    "positivityScore": 6
  },
  {
    "title": "South Africa Construction Industry Report 2025: Output to Rebound at an AAGR of 3.8% Between 2027-2029 After a Decline of 4% in 2025, Supported by Investments in Industrial, Infrastructure, and Energy",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242731/28124/en/South-Africa-Construction-Industry-Report-2025-Output-to-Rebound-at-an-AAGR-of-3-8-Between-2027-2029-After-a-Decline-of-4-in-2025-Supported-by-Investments-in-Industrial-Infrastruct.html",
    "description": "South Africa's construction market offers growth from 2027-2029 at 3.8% annually, driven by industrial, infrastructure, and energy investments, plus a government energy goal to introduce significant solar, wind, gas, and nuclear projects by 2030, bolstered by…",
    "pubDate": "2026-02-23T14:45:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/23/3242731/28124/en/South-Africa-Construction-Industry-Report-2025-Output-to-Rebound-at-an-AAGR-of-3-8-Between-2027-2029-After-a-Decline-of-4-in-2025-Supported-by-Investments-in-Industrial-Infrastruct.html",
    "category": "climate",
    "author": "Research and Markets",
    "positivityScore": 6
  },
  {
    "title": "China boosts profitable renewables as Trump clings to coal",
    "link": "https://www.dw.com/en/china-climate-leader-as-solar-and-wind-capacities-cross-historic-threshold-trump-reviving-coal/a-76061444",
    "description": "While the Trump administration has rolled back environmental protections and blocked green energy development, China is forging ahead. During a speech to global elites at the World Economic Forum in Davos last month, US President Donald Trump announced that w…",
    "pubDate": "2026-02-23T13:01:00Z",
    "source": "DW (English)",
    "sourceUrl": "https://www.dw.com/en/china-climate-leader-as-solar-and-wind-capacities-cross-historic-threshold-trump-reviving-coal/a-76061444",
    "category": "climate",
    "author": "Sarah Steffen",
    "positivityScore": 6
  },
  {
    "title": "WHO validates elimination of trachoma as a public health problem in Libya",
    "link": "https://www.who.int/news/item/18-02-2026-who-validates-elimination-of-trachoma-as-a-public-health-problem-in-libya",
    "description": "<p>The World Health Organization (WHO) today announced that Libya has eliminated trachoma as a public health problem, a landmark victory for public health in WHO’s Eastern Mediterranean Region. This hard-won achievement protects future generations from preven…",
    "pubDate": "2026-02-18T15:19:31Z",
    "source": "World Health Organization",
    "sourceUrl": "https://www.who.int/news/item/18-02-2026-who-validates-elimination-of-trachoma-as-a-public-health-problem-in-libya",
    "category": "people",
    "author": "World Health Organization: WHO",
    "positivityScore": 6
  },
  {
    "title": "190-million-year-old “Sword Dragon” fossil rewrites ichthyosaur history",
    "link": "https://www.sciencedaily.com/releases/2026/02/260224023218.htm",
    "description": "A newly identified ichthyosaur from the UK’s Jurassic Coast is rewriting part of the prehistoric playbook. Nicknamed the “Sword Dragon of Dorset,” the three-meter-long marine reptile lived during a poorly understood window of evolution when major ichthyosaur groups were disappearing and new ones emerging. Its beautifully preserved skeleton — complete with a blade-like snout and possible last meal — helps pinpoint when this dramatic transition occurred.",
    "pubDate": "Tue, 24 Feb 2026 07:50:35 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260224023218.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Schrödinger’s color theory finally completed after 100 years",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222092302.htm",
    "description": "A century after Erwin Schrödinger sketched out a bold vision for how we perceive color, scientists have finally filled in the missing pieces. A Los Alamos team used advanced geometry to show that hue, saturation, and lightness aren’t shaped by culture or experience — they’re built directly into the mathematical structure of how we see color. By defining a crucial missing element known as the “neutral axis,” the researchers repaired a long-standing flaw in Schrödinger’s model and even corrected tricky visual quirks like the way brightness can subtly shift perceived hue.",
    "pubDate": "Mon, 23 Feb 2026 10:24:39 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222092302.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Scientists just mapped mysterious earthquakes deep inside Earth",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040818.htm",
    "description": "Scientists at Stanford have unveiled the first-ever global map of rare earthquakes that rumble deep within Earth’s mantle rather than its crust. Long debated and notoriously difficult to confirm, these elusive quakes turn out to cluster in regions like the Himalayas and near the Bering Strait. By developing a breakthrough method that distinguishes mantle quakes using subtle differences in seismic waves, researchers identified hundreds of these hidden tremors worldwide.",
    "pubDate": "Fri, 20 Feb 2026 08:05:28 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040818.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Ancient DNA solves 5,500 year old burial mystery in Sweden",
    "link": "https://www.sciencedaily.com/releases/2026/02/260218031559.htm",
    "description": "Ancient DNA from a Stone Age burial site in Sweden shows that families 5,500 years ago were more complex than expected. Many individuals buried together were not immediate family, but second- or third-degree relatives. One grave held a young woman alongside two children who were siblings—yet she wasn’t their mother. The discoveries hint at tight-knit communities where extended kin mattered deeply.",
    "pubDate": "Thu, 19 Feb 2026 01:47:07 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260218031559.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "A spinning gyroscope could finally unlock ocean wave energy",
    "link": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
    "description": "Ocean waves are a vast and steady source of renewable energy, but capturing their power efficiently has long frustrated engineers. A researcher at The University of Osaka has now explored a bold new approach: a gyroscopic wave energy converter that uses a spinning flywheel inside a floating structure to turn wave motion into electricity. By harnessing gyroscopic precession—the subtle wobble of a spinning object under force—the system can be tuned to absorb energy across a wide range of wave conditions.",
    "pubDate": "Wed, 18 Feb 2026 09:33:28 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260218031554.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "NASA fired three rockets into the northern lights and the results are stunning",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005738.htm",
    "description": "NASA has pulled off a high-flying aurora investigation, launching three rockets into the glowing northern lights over Alaska. One mission targeted mysterious dark patches called black auroras, while the twin GNEISS rockets created a 3D scan of the aurora’s electrical currents. All rockets reached their planned altitudes and returned strong data. The result: an unprecedented look at how these dazzling light shows are wired from space to sky.",
    "pubDate": "Tue, 17 Feb 2026 23:19:32 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005738.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Scientists create universal nasal spray vaccine that protects against COVID, flu, and pneumonia",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222092258.htm",
    "description": "Scientists at Stanford Medicine have unveiled a bold new kind of “universal” vaccine that could one day protect against everything from COVID-19 and the flu to bacterial pneumonia and even common allergens. Instead of targeting a specific virus or bacterium, the nasal spray vaccine supercharges the lungs’ own immune defenses, keeping them on high alert for months. In mice, it slashed viral levels, prevented severe illness, and even blocked allergic reactions.",
    "pubDate": "Mon, 23 Feb 2026 08:45:18 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222092258.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "New oxygen gel could prevent amputation in diabetic wound patients",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000255.htm",
    "description": "Chronic wounds often spiral out of control because oxygen can’t reach the deepest layers of injured tissue. A new gel developed at UC Riverside delivers a continuous flow of oxygen right where it’s needed most, using a tiny battery-powered system. In high-risk mice, wounds healed in weeks instead of worsening. The innovation could dramatically reduce amputations—and may even open doors for lab-grown organs.",
    "pubDate": "Sun, 22 Feb 2026 08:14:18 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000255.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Doctors implant dopamine-producing stem cells in Parkinson’s patients",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040820.htm",
    "description": "A groundbreaking clinical trial is testing whether specially engineered stem cells can help the brain restore its own dopamine production in people with Parkinson’s disease. Because the condition is driven by the gradual loss of dopamine-producing cells—leading to tremors, stiffness, and slowed movement—researchers are implanting lab-grown cells directly into the brain’s movement center to replace what’s been lost.",
    "pubDate": "Fri, 20 Feb 2026 04:03:58 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040820.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Scientists discover the body’s hidden “off switch” for inflammation",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040816.htm",
    "description": "A new human study has uncovered how the body naturally turns off inflammation. Researchers found that fat-derived molecules called epoxy-oxylipins rein in immune cells that can otherwise drive chronic disease. Using a drug to boost these molecules reduced pain faster and lowered harmful inflammatory cells. The discovery could pave the way for safer treatments for arthritis, heart disease, and other inflammation-related conditions.",
    "pubDate": "Thu, 19 Feb 2026 10:16:55 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040816.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Viagra and shingles vaccine show surprising promise against Alzheimer’s",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005759.htm",
    "description": "A major new study has spotlighted three familiar medicines that could take on an unexpected new role in the fight against Alzheimer’s disease — with a shingles vaccine emerging as the front-runner. After reviewing 80 existing drugs, an international panel of experts identified Zostavax, Viagra (sildenafil), and riluzole as the most promising candidates for repurposing.",
    "pubDate": "Wed, 18 Feb 2026 07:02:28 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005759.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Evidence alone won’t save biodiversity: the golden apple snail reveals an implementation gap",
    "link": "https://www.nature.com/articles/d41586-026-00593-x",
    "description": "",
    "pubDate": "2026-02-24T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00593-x",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "125 million-year-old dinosaur with never before seen hollow spikes discovered in China",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005734.htm",
    "description": "A 125-million-year-old dinosaur just rewrote what we thought we knew about prehistoric life. Scientists in China have uncovered an exceptionally preserved juvenile iguanodontian with fossilized skin so detailed that individual cells are still visible. Even more astonishing, the plant-eating dinosaur was covered in hollow, porcupine-like spikes—structures never before documented in any dinosaur.",
    "pubDate": "Wed, 18 Feb 2026 01:10:28 EST",
    "source": "Science Daily Animals",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005734.htm",
    "category": "wildlife",
    "positivityScore": 4
  },
  {
    "title": "Inside Earth’s Oldest Rocks, Microbes Have Been Living in Darkness",
    "link": "https://economictimes.indiatimes.com/news/international/us/inside-earths-oldest-rocks-microbes-have-been-living-in-darkness/articleshow/128707412.cms",
    "description": "Scientists have discovered vast microbial life deep within Earth's solid rock, challenging previous beliefs. These organisms, thriving in total darkness and immense pressure, survive by extracting energy from chemical reactions, not sunlight. This groundbreak…",
    "pubDate": "2026-02-23T09:23:47Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/international/us/inside-earths-oldest-rocks-microbes-have-been-living-in-darkness/articleshow/128707412.cms",
    "category": "science",
    "author": "Global Desk",
    "positivityScore": 4
  },
  {
    "title": "U.S. FDA Grants Reunion Neuroscience’s Luvesilocin (RE104) Breakthrough Therapy Designation Status",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242518/0/en/U-S-FDA-Grants-Reunion-Neuroscience-s-Luvesilocin-RE104-Breakthrough-Therapy-Designation-Status.html",
    "description": "-- Breakthrough Therapy Designation Based on Positive RECONNECT Phase 2 Clinical Data ---- Aligned with U.S. Food and Drug Administration on Registrational Path for Luvesilocin in Postpartum Depression (PPD); On Track to Initiate Phase 3 Trial in 2026 --  MOR…",
    "pubDate": "2026-02-23T12:30:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/23/3242518/0/en/U-S-FDA-Grants-Reunion-Neuroscience-s-Luvesilocin-RE104-Breakthrough-Therapy-Designation-Status.html",
    "category": "health",
    "author": "Reunion Neuroscience Inc.",
    "positivityScore": 4
  },
  {
    "title": "Royal Enfield Flying Flea spotted undisguised: Key details of first RE EV",
    "link": "https://timesofindia.indiatimes.com/auto/electric-vehicles/royal-enfield-flying-flea-spotted-undisguised-key-details-of-first-re-ev/articleshow/128703941.cms",
    "description": "Royal Enfield's first electric motorcycle, the Flying Flea C6, has been spotted testing in India, nearing its production form and hinting at an April 2026 launch. This unique bobber-style EV draws inspiration from WWII-era machines, featuring a girder front s…",
    "pubDate": "2026-02-23T07:35:51Z",
    "source": "The Times of India",
    "sourceUrl": "https://timesofindia.indiatimes.com/auto/electric-vehicles/royal-enfield-flying-flea-spotted-undisguised-key-details-of-first-re-ev/articleshow/128703941.cms",
    "category": "health",
    "author": "TIMESOFINDIA.COM",
    "positivityScore": 4
  },
  {
    "title": "Platelet-like particles released from Ebola virus-infected megakaryocytic cells behave like virus-like particles",
    "link": "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1013985",
    "description": "Author summary At the late stage of Ebola virus (EBOV) disease, the virus spreads to various tissues, including immune-privileged sites such as the brain, eyes, testes, and bone marrow. Even after recovery, some survivors experience relapses, and transmission…",
    "pubDate": "2026-02-23T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1013985",
    "category": "health",
    "author": "Makoto Kuroda, Peter J. Halfmann",
    "positivityScore": 4
  },
  {
    "title": "Romania Construction Industry Report 2025: Output to Grow by 5.5% in 2026 After 9.2% in 2025, Supported by Rising Building Permits and Expanding Manufacturing and Hotel Investments - Forecast to 2029",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242734/28124/en/Romania-Construction-Industry-Report-2025-Output-to-Grow-by-5-5-in-2026-After-9-2-in-2025-Supported-by-Rising-Building-Permits-and-Expanding-Manufacturing-and-Hotel-Investments-For.html",
    "description": "Key market opportunities in Romania's construction industry include growth driven by increased building permits and investment in manufacturing and hotel projects. Future prospects are supported by significant investments in transport infrastructure, like the…",
    "pubDate": "2026-02-23T14:52:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/23/3242734/28124/en/Romania-Construction-Industry-Report-2025-Output-to-Grow-by-5-5-in-2026-After-9-2-in-2025-Supported-by-Rising-Building-Permits-and-Expanding-Manufacturing-and-Hotel-Investments-For.html",
    "category": "climate",
    "author": "Research and Markets",
    "positivityScore": 4
  },
  {
    "title": "The Scramble for Lithium",
    "link": "https://www.thenation.com/?post_type=article&p=587678",
    "description": "Casey A. Williams\n\n\n\nThea Riofrancos’s Extraction tells the story of how a rare earth mineral became the focus of a worldwide battle over the future of green energy and, by extension, capitalism. \r\n\n\r\n\n\nThe post The Scramble for Lithium appeared first on The …",
    "pubDate": "2026-02-23T10:00:00Z",
    "source": "Thenation.com",
    "sourceUrl": "https://www.thenation.com/?post_type=article&p=587678",
    "category": "climate",
    "author": "Casey A. Williams",
    "positivityScore": 4
  },
  {
    "title": "Efficiency hierarchy and optimization of waste incineration in China to balance disposal and energy supply",
    "link": "https://www.nature.com/articles/s41467-026-69897-w",
    "description": "The authors compile a national database of 975 plants including 2,151 incinerators across China, showing that they supplied up to 7% of residential electricity consumption in 2023. Scenario projections indicated that waste incineration could generate up to 25…",
    "pubDate": "2026-02-23T00:00:00Z",
    "source": "Nature.com",
    "sourceUrl": "https://www.nature.com/articles/s41467-026-69897-w",
    "category": "climate",
    "author": "Jicui Cui, Ying Cui, Jiyang Li, Xiaofeng Gao, Wendong Wei, Yuan Chen, Wenchao Ma, Nanwen Zhu, Yong Geng, Youcai Zhao, Ziyang Lou",
    "positivityScore": 4
  },
  {
    "title": "Organic Fertilizer Market Set to Surge to USD 15.6 Billion by 2033 on Sustainable Agriculture Boom | Study by Market Minds",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242451/0/en/Organic-Fertilizer-Market-Set-to-Surge-to-USD-15-6-Billion-by-2033-on-Sustainable-Agriculture-Boom-Study-by-Market-Minds.html",
    "description": "Soil health restoration, carbon farming incentives and residue-free food demand are bolstering adoption of organic nutrient solutions...",
    "pubDate": "2026-02-23T11:40:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/23/3242451/0/en/Organic-Fertilizer-Market-Set-to-Surge-to-USD-15-6-Billion-by-2033-on-Sustainable-Agriculture-Boom-Study-by-Market-Minds.html",
    "category": "climate",
    "author": "RESVAULT MMADVISORY PRIVATE LIMITED",
    "positivityScore": 4
  },
  {
    "title": "Renewable energy soars",
    "link": "https://northern.starweekly.com.au/news/renewable-energy-soars/",
    "description": "Energy and Resources Minister Lily D’Ambrosio has announced that Victoria has exceeded its 2025 renewable energy target. Ms D’Ambrosio said renewables accounted for 44.6 per cent of the state’s electricity generation last year, above the legislated target of …",
    "pubDate": "2026-02-22T06:50:04Z",
    "source": "Starweekly.com.au",
    "sourceUrl": "https://northern.starweekly.com.au/news/renewable-energy-soars/",
    "category": "climate",
    "author": "jimjin",
    "positivityScore": 4
  },
  {
    "title": "B2Gold Reports Q4 and Full Year 2025 Results & 2026 Guidance; Achieved 2025 Gold Production and Cost Guidance; Record Annual Revenue in 2025 of Over $3 Billion; Gold Production for 2026 Anticipated to be Between 820,000 and 970,000 oz; Q1 2026 Dividend of US$0.02 Per Share Declared",
    "link": "https://www.globenewswire.com/news-release/2026/02/18/3240719/0/en/B2Gold-Reports-Q4-and-Full-Year-2025-Results-2026-Guidance-Achieved-2025-Gold-Production-and-Cost-Guidance-Record-Annual-Revenue-in-2025-of-Over-3-Billion-Gold-Production-for-2026-.html",
    "description": "VANCOUVER, British Columbia, Feb. 18, 2026 (GLOBE NEWSWIRE) -- B2Gold Corp. (TSX: BTO, NYSE AMERICAN: BTG, NSX: B2G) (“B2Gold” or the “Company”) announces its operational and financial results for the fourth quarter and full year 2025, together with 2026 oper…",
    "pubDate": "2026-02-18T22:50:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/18/3240719/0/en/B2Gold-Reports-Q4-and-Full-Year-2025-Results-2026-Guidance-Achieved-2025-Gold-Production-and-Cost-Guidance-Record-Annual-Revenue-in-2025-of-Over-3-Billion-Gold-Production-for-2026-.html",
    "category": "climate",
    "author": "B2Gold Corp.",
    "positivityScore": 4
  },
  {
    "title": "Emera Reports 2025 Fourth Quarter Financial and Annual Financial Results, Extends Growth Target",
    "link": "https://financialpost.com/pmn/business-wire-news-releases-pmn/emera-reports-2025-fourth-quarter-financial-and-annual-financial-results-extends-growth-target",
    "description": "HALIFAX, Nova Scotia — Today, February 23, 2026, Emera Inc. (“Emera”) (TSX/NYSE: EMA) reported 2025 fourth quarter and annual financial results1. Highlights Delivered record annual adjusted earnings per share2 (“EPS”) of $3.49 for 2025, a 19% year-over-year i…",
    "pubDate": "2026-02-23T11:07:43Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/pmn/business-wire-news-releases-pmn/emera-reports-2025-fourth-quarter-financial-and-annual-financial-results-extends-growth-target",
    "category": "climate",
    "author": "Business Wire",
    "positivityScore": 4
  },
  {
    "title": "How do you treat a sick cichlid?",
    "link": "https://www.lifesciencesworld.com/how-do-you-treat-a-sick-cichlid/",
    "description": "How to Treat a Sick Cichlid: A Comprehensive Guide The key to saving your cichlid lies in early detection, accurate diagnosis, and swift, targeted treatment. How do you treat a sick cichlid? You treat them by first identifying the specific ailment affecting t…",
    "pubDate": "2026-02-23T03:43:50Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-do-you-treat-a-sick-cichlid/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "EVREC Crown Lands Wind Reserve Extended as Project Continues Development in Central Newfoundland",
    "link": "https://financialpost.com/globe-newswire/evrec-crown-lands-wind-reserve-extended-as-project-continues-development-in-central-newfoundland",
    "description": "BOTWOOD, Newfoundland and Labrador, Feb. 23, 2026 (GLOBE NEWSWIRE) — Exploits Valley Renewable Energy Corporation (“EVREC”) welcomes the recent decision by the Government of Newfoundland and Labrador to extend the company’s Crown lands wind reserve to Februar…",
    "pubDate": "2026-02-23T14:13:38Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/globe-newswire/evrec-crown-lands-wind-reserve-extended-as-project-continues-development-in-central-newfoundland",
    "category": "people",
    "author": "GlobeNewswire",
    "positivityScore": 4
  },
  {
    "title": "US supreme court takes up fossil fuel firms’ climate accountability case",
    "link": "https://www.theguardian.com/us-news/2026/feb/23/supreme-court-suncor-exxonmobil-case",
    "description": "Judgment in city of Boulder’s lawsuit against Suncor Energy USA and ExxonMobil could affect wave of climate litigation\nThe US supreme court has decided to hear arguments in a climate accountability lawsuit, marking the first time the high court has weighed in on such a case. The decision could potentially hinder the wave of climate litigation the US has seen in recent years.\n“It’s not a good sign,” said Pat Parenteau, a professor of environmental law at Vermont Law and Graduate School.\n Continue reading...",
    "pubDate": "Mon, 23 Feb 2026 16:04:25 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2026/feb/23/supreme-court-suncor-exxonmobil-case",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "A giant blade-crested spinosaurus, the “hell heron,” discovered in the Sahara",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222092251.htm",
    "description": "Deep in the heart of the Sahara, scientists have uncovered Spinosaurus mirabilis — a spectacular new predator crowned with a massive, scimitar-shaped crest that may once have blazed with color under the desert sun. Discovered in remote inland river deposits in Niger, the fossil rewrites what we thought we knew about spinosaur dinosaurs, suggesting they weren’t fully aquatic hunters but powerful waders stalking fish in forested waterways hundreds of miles from the sea.",
    "pubDate": "Mon, 23 Feb 2026 00:10:43 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222092251.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Flea and tick treatments for dogs and cats may be harming wildlife",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000328.htm",
    "description": "Flea and tick medications trusted by pet owners worldwide may have an unexpected environmental cost. Scientists found that active ingredients from isoxazoline treatments pass into pet feces, exposing dung-feeding insects to toxic chemicals. These insects are essential for nutrient cycling and soil health. The findings suggest everyday pet treatments could ripple through ecosystems in surprising ways.",
    "pubDate": "Sun, 22 Feb 2026 01:24:32 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000328.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "A simple water shift could turn Arctic farmland into a carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000325.htm",
    "description": "Deep in the Arctic north, drained peatlands—once massive carbon vaults built over thousands of years—are quietly leaking greenhouse gases into the atmosphere. But new field research from northern Norway suggests there’s a powerful way to slow that loss: raise the water level. In a two-year study, scientists found that restoring higher groundwater levels in cultivated Arctic peatlands dramatically cut carbon dioxide emissions, and in some cases even tipped the balance so the land absorbed more CO₂ than it released.",
    "pubDate": "Sun, 22 Feb 2026 02:51:51 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000325.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Triceratops had a giant nose that may have cooled its massive head",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000313.htm",
    "description": "Triceratops’ massive head may have been doing more than just showing off those famous horns. Using CT scans and 3D reconstructions of fossil skulls, researchers uncovered a surprisingly complex nasal system hidden inside its enormous snout. Instead of being just a supersized nose for smelling, it likely housed intricate networks of nerves and blood vessels—and even special structures that helped regulate heat and moisture.",
    "pubDate": "Sun, 22 Feb 2026 07:20:15 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000313.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Giant virus discovery could rewrite the origin of complex life",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040814.htm",
    "description": "A giant virus discovered in Japan is adding fuel to the provocative idea that viruses helped create complex life. Named ushikuvirus, it infects amoebae and shows unique traits that connect different families of giant DNA viruses. Its unusual way of hijacking and disrupting the host cell’s nucleus offers fresh insight into how viruses may have influenced the evolution of the cell nucleus itself. The finding deepens the mystery of viruses—and their possible role in life’s biggest leap.",
    "pubDate": "Thu, 19 Feb 2026 22:28:24 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040814.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Ancient microbes may have used oxygen 500 million years before it filled Earth’s atmosphere",
    "link": "https://www.sciencedaily.com/releases/2026/02/260218031609.htm",
    "description": "Life on Earth may have learned to breathe oxygen long before oxygen filled the skies. MIT researchers traced a key oxygen-processing enzyme back hundreds of millions of years before the Great Oxidation Event. Early microbes living near oxygen-producing cyanobacteria may have quickly used up the gas as it formed, slowing its rise in the atmosphere. The results suggest life was adapting to oxygen far earlier — and far more creatively — than once thought.",
    "pubDate": "Wed, 18 Feb 2026 03:50:31 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260218031609.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Microplastics have reached Antarctica’s only native insect",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "description": "Even Antarctica’s toughest native insect can’t escape the reach of plastic pollution. Scientists have discovered that Belgica antarctica — a tiny, rice-sized midge and the southernmost insect on Earth — is already ingesting microplastics in the wild. While lab tests showed the hardy larvae can survive short-term exposure without obvious harm, those exposed to higher plastic levels had reduced fat reserves, hinting at hidden energy costs.",
    "pubDate": "Mon, 16 Feb 2026 07:48:45 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Yellowstone wolves may not have transformed the national park after all",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "description": "A new scientific review challenges the headline-grabbing claim that Yellowstone’s returning wolves triggered one of the strongest trophic cascades on Earth. Researchers found that the reported 1,500% surge in willow growth was based on circular calculations and questionable comparisons. After correcting for modeling and sampling flaws, the supposed ecosystem-wide boom largely disappears.",
    "pubDate": "Thu, 12 Feb 2026 08:51:03 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Simple blood test can forecast Alzheimer’s years before memory loss",
    "link": "https://www.sciencedaily.com/releases/2026/02/260222085203.htm",
    "description": "Scientists have created a blood test that can estimate when Alzheimer’s symptoms are likely to begin. By measuring a protein called p-tau217, the model predicts symptom onset within roughly three to four years. The protein mirrors the silent buildup of amyloid and tau in the brain long before memory loss appears. This advance could speed up preventive drug trials and eventually guide personalized care.",
    "pubDate": "Mon, 23 Feb 2026 06:46:07 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260222085203.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Generative AI analyzes medical data faster than human research teams",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221060942.htm",
    "description": "Researchers tested whether generative AI could handle complex medical datasets as well as human experts. In some cases, the AI matched or outperformed teams that had spent months building prediction models. By generating usable analytical code from precise prompts, the systems dramatically reduced the time needed to process health data. The findings hint at a future where AI helps scientists move faster from data to discovery.",
    "pubDate": "Sat, 21 Feb 2026 06:17:29 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221060942.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "“Celtic curse” hotspots found in Scotland and Ireland with 1 in 54 at risk",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000332.htm",
    "description": "Researchers have mapped the genetic risk of hemochromatosis across the UK and Ireland for the first time, uncovering striking hotspots in north-west Ireland and the Outer Hebrides. In some regions, around one in 60 people carry the high-risk gene variant linked to iron overload. The condition can take decades to surface but may lead to liver cancer and arthritis if untreated.",
    "pubDate": "Sat, 21 Feb 2026 09:38:45 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000332.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Pecans found to improve cholesterol and boost heart health",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000317.htm",
    "description": "A sweeping new scientific review suggests that pecans — America’s native nut — may pack more heart power than many people realize. After analyzing over 20 years of research, scientists found consistent evidence that eating pecans can improve key markers of cardiovascular health, including total cholesterol and “bad” LDL cholesterol, while also supporting antioxidant defenses.",
    "pubDate": "Sun, 22 Feb 2026 08:52:17 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000317.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Air pollution linked to higher Alzheimer’s risk in 28 million older Americans",
    "link": "https://www.sciencedaily.com/releases/2026/02/260220010836.htm",
    "description": "Breathing polluted air may do more than harm your lungs — it could also increase your risk of Alzheimer’s disease. In a sweeping study of nearly 28 million older Americans, researchers found that long term exposure to fine particle air pollution was linked to a higher likelihood of developing Alzheimer’s. The connection appeared to stem largely from pollution’s direct effects on the brain, rather than through related health conditions like hypertension or depression.",
    "pubDate": "Fri, 20 Feb 2026 01:47:05 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260220010836.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists find cancer-linked chemicals in popular hair extensions",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219232620.htm",
    "description": "A sweeping new study has uncovered a troubling mix of hazardous chemicals in popular hair extensions, including products made from human hair. Researchers detected dozens of substances linked to cancer, hormone disruption, reproductive harm, and immune system effects in nearly every sample tested. Some products contained flame retardants, organotins, and chemicals associated with increased breast cancer risk, and several exceeded European safety thresholds.",
    "pubDate": "Thu, 19 Feb 2026 23:31:46 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219232620.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists reveal why human language isn’t like computer code",
    "link": "https://www.sciencedaily.com/releases/2026/02/260219040811.htm",
    "description": "Human language may seem messy and inefficient compared to the ultra-compact strings of ones and zeros used by computers—but our brains actually prefer it that way. New research reveals that while digital-style encoding could theoretically compress information more tightly, it would demand far more mental effort from both speaker and listener. Instead, language is built around familiar words and predictable patterns that reflect our real-world experiences, allowing the brain to constantly anticipate what comes next and narrow down meaning step by step.",
    "pubDate": "Fri, 20 Feb 2026 09:23:24 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260219040811.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "The Contributor Role Taxonomy tool must serve to record extent of authorship",
    "link": "https://www.nature.com/articles/d41586-026-00591-z",
    "description": "",
    "pubDate": "2026-02-24T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00591-z",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "First-of-a-kind stem-cell therapies set for approval in Japan",
    "link": "https://www.nature.com/articles/d41586-026-00585-x",
    "description": "",
    "pubDate": "2026-02-23T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00585-x",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "This AI can improve your peer review — and make it more polite",
    "link": "https://www.nature.com/articles/d41586-026-00536-6",
    "description": "",
    "pubDate": "2026-02-23T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00536-6",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Deer culling to be made easier to protect trees and crops",
    "link": "https://www.bbc.com/news/articles/c0e5l7ll31yo?at_medium=RSS&at_campaign=rss",
    "description": "The government unveils a long awaited 10-year deer management plan that will identify priority culling areas.",
    "pubDate": "Thu, 19 Feb 2026 22:58:13 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c0e5l7ll31yo?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "'Smiling' fossil discovered on Holy Island",
    "link": "https://www.bbc.com/news/articles/c7v0ev05mdjo?at_medium=RSS&at_campaign=rss",
    "description": "The unusual looking fossil is estimated to be a few hundred million years old dating to the Carboniferous period.",
    "pubDate": "Thu, 19 Feb 2026 05:07:07 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c7v0ev05mdjo?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Are wetter winters and frequent flooding here to stay?",
    "link": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "description": "Many places across the UK have experienced their wettest January in more than 100 years.",
    "pubDate": "Wed, 11 Feb 2026 02:59:08 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "NASA’s Hubble spots nearly invisible “ghost galaxy” made of 99% dark matter",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000307.htm",
    "description": "Astronomers have uncovered one of the most mysterious galaxies ever found — a dim, ghostly object called CDG-2 that is almost entirely made of dark matter. Located 300 million light-years away in the Perseus galaxy cluster, it was discovered in an unusual way: not by its stars, but by four tightly packed globular clusters acting like cosmic breadcrumbs.",
    "pubDate": "Sat, 21 Feb 2026 01:57:52 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000307.htm",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Scientists may have found the holy grail of quantum computing",
    "link": "https://www.sciencedaily.com/releases/2026/02/260221000252.htm",
    "description": "Scientists may have spotted a long-sought triplet superconductor — a material that can transmit both electricity and electron spin with zero resistance. That ability could dramatically stabilize quantum computers while slashing their energy use. Early experiments suggest the alloy NbRe behaves unlike any conventional superconductor. If verified, it could become a cornerstone of next-generation quantum and spintronic technology.",
    "pubDate": "Sat, 21 Feb 2026 07:10:00 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260221000252.htm",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "OFC 2026 Show Floor Programs Deliver Essential Insights on Market Direction and Breakthrough Technologies",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242706/0/en/OFC-2026-Show-Floor-Programs-Deliver-Essential-Insights-on-Market-Direction-and-Breakthrough-Technologies.html",
    "description": "OFC 2026 Show Floor Programs Deliver Essential Insights on Market Direction and Breakthrough Technologies...",
    "pubDate": "2026-02-23T14:07:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/23/3242706/0/en/OFC-2026-Show-Floor-Programs-Deliver-Essential-Insights-on-Market-Direction-and-Breakthrough-Technologies.html",
    "category": "science",
    "author": "OFC Conference",
    "positivityScore": 2
  },
  {
    "title": "Kraig Biocraft Laboratories’ Spider Silk Advancements Featured as the Cover of National Geographic's March 2026 Issue",
    "link": "https://www.globenewswire.com/news-release/2026/02/23/3242489/0/en/Kraig-Biocraft-Laboratories-Spider-Silk-Advancements-Featured-as-the-Cover-of-National-Geographic-s-March-2026-Issue.html",
    "description": "Kraig Biocraft Labs (OTCQB: KBLB) groundbreaking work in commercializing spider silk is featured on the cover of the March 2026 issue of National Graphic...",
    "pubDate": "2026-02-23T12:05:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/23/3242489/0/en/Kraig-Biocraft-Laboratories-Spider-Silk-Advancements-Featured-as-the-Cover-of-National-Geographic-s-March-2026-Issue.html",
    "category": "science",
    "author": "Kraig Biocraft Laboratories",
    "positivityScore": 2
  },
  {
    "title": "In Your Radiant Season: Episodes 1-2",
    "link": "https://dramabeans.com/2026/02/in-your-radiant-season-episodes-1-2/",
    "description": "A new healing romance has arrived on our screens, and it’s giving Our Unwritten Seoul meets Find Me in Your Memory. Since I adored both of the aforementioned dramas and thoroughly enjoyed this premiere, I’m optimistic that this latest entry in the genre will …",
    "pubDate": "2026-02-23T07:00:46Z",
    "source": "Dramabeans.com",
    "sourceUrl": "https://dramabeans.com/2026/02/in-your-radiant-season-episodes-1-2/",
    "category": "science",
    "author": "DaebakGrits",
    "positivityScore": 2
  },
  {
    "title": "KCET 2026 registration window closes on this date: Check how to apply before deadline, required documents here",
    "link": "https://timesofindia.indiatimes.com/education/news/kcet-2026-registration-window-closes-on-this-date-check-how-to-apply-before-deadline-required-documents-here/articleshow/128702535.cms",
    "description": "The KCET 2026 registration deadline is February 27, 2026, with fee payment accepted until March 3. Aspiring students for engineering, pharmacy, and other professional courses in Karnataka must apply online via the official portal. Candidates are urged to prep…",
    "pubDate": "2026-02-23T07:17:21Z",
    "source": "The Times of India",
    "sourceUrl": "https://timesofindia.indiatimes.com/education/news/kcet-2026-registration-window-closes-on-this-date-check-how-to-apply-before-deadline-required-documents-here/articleshow/128702535.cms",
    "category": "health",
    "author": "TOI Education",
    "positivityScore": 2
  },
  {
    "title": "Eli Lilly launches new form of obesity drug Zepbound with a month’s worth of doses in one pen",
    "link": "https://www.cnbc.com/2026/02/23/eli-lilly-launches-zepbound-obesity-drug-pen-one-month-doses.html",
    "description": "Eli Lilly hopes the device can be more convenient for Zepbound users and lead to more people taking the drug.",
    "pubDate": "2026-02-23T14:00:14Z",
    "source": "CNBC",
    "sourceUrl": "https://www.cnbc.com/2026/02/23/eli-lilly-launches-zepbound-obesity-drug-pen-one-month-doses.html",
    "category": "health",
    "author": "Annika Kim Constantino",
    "positivityScore": 2
  },
  {
    "title": "Epidemiology of adult t-cell leukemia/lymphoma in people living with HTLV-1: A 30-year study in Peru",
    "link": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0014010",
    "description": "Author summary Human T-leukemia virus type 1 (HTLV-1) is a virus that infects immune cells and causes a lifelong infection. Discovered more than 40 years ago, it is common in several regions of the world, including parts of South America, the Caribbean, Afric…",
    "pubDate": "2026-02-23T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0014010",
    "category": "health",
    "author": "Gabriela Garrido-Pinzás, Brian Valenzuela, Elsa González-Lagos, Carlos Seas, Luis Malpica, Carolina Álvarez, Victor Rivera, Fernando Mejía, Martín Montes, Juan Carlos Ramos, Eduardo Gotuzzo",
    "positivityScore": 2
  },
  {
    "title": "“It left me burnt”: Traditional treatment and stigma experiences of cutaneous leishmaniasis in Kalu district, Ethiopia",
    "link": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0013537",
    "description": "Author summary Ethiopia is significantly affected by all forms of leishmaniasis. Cutaneous leishmaniasis (CL) is a significant public health problem with an estimated incidence of 50 000 annually. The skin lesions mostly appear on the face. The visible change…",
    "pubDate": "2026-02-23T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0013537",
    "category": "health",
    "author": "Teklu Cherkose, Kibur Engdawork, Maria Zuurmond, Abebaw Y. Alemu, Fikregabrail Aberra Kassa, Saba Lambert, Zenebu Begna, Katherine Halliday, Tara Mtuy, Yohannes Hailemichael, Michael Marks, Mirgissa Kaba, Endalamaw Gadisa, Stephen L. Walker, Jennifer Palmer, SHARP collaboration",
    "positivityScore": 2
  },
  {
    "title": "One health at the last mile: Multi-scale predictors of Schistosoma japonicum infection in southwest china across two decades of control",
    "link": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0013573",
    "description": "Author summary Schistosomiasis is a parasitic disease that has been a target of disease control efforts globally, with China aiming to eliminate the disease as a public health problem. In China, disease control efforts have been successful in reducing the spr…",
    "pubDate": "2026-02-23T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0013573",
    "category": "health",
    "author": "William W. Zou, Elise N. Grover, Liu Yang, Elizabeth J. Carlton",
    "positivityScore": 2
  },
  {
    "title": "Risk factors for post-kala-azar dermal leishmaniasis (PKDL): Challenges in understanding pathophysiology",
    "link": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0013952",
    "description": "Background Post-kala-azar dermal leishmaniasis (PKDL) occurs mainly in Eastern Africa (EA) and the Southeast Asia region (SEAR), but with important differences. In EA PKDL occurs in young children shortly after treatment of VL (within 1–13 months) when the im…",
    "pubDate": "2026-02-23T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0013952",
    "category": "health",
    "author": "Eduard E. Zijlstra",
    "positivityScore": 2
  },
  {
    "title": "How to cope with Long COVID – A qualitative interview study on stressors and coping strategies of people affected by long-term consequences of COVID-19",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343115",
    "description": "Long COVID, a multi-system-disease characterized by persistent somatic and mental symptoms following a SARS-CoV-2 infection, can severely impair health and quality of life of those affected. In the absence of adequate therapeutic approaches and a fragmented c…",
    "pubDate": "2026-02-23T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0343115",
    "category": "health",
    "author": "Melanie Elgner, Marius Binneböse, Josi Großmann, Tamara Frank, Paul Bruckmann, Claas Lahmann, Katrin Elisabeth Giel, Christine Allwang, Florian Junne, Hannah Wallis",
    "positivityScore": 2
  }
]