[
  {
    "title": "‘Green-Thumb’ Miracles Gave These Monks an Eco-Authority in Medieval Italy New Research Shows",
    "link": "https://www.goodnewsnetwork.org/new-research-shows-how-green-fingered-miracles-gave-pope-leo-xivs-order-an-eco-authority-in-medieval-italy/",
    "description": "A scorched cherry twig miraculously sprouting; a diseased swamp restored to ‘peak fertility’; healing the broken leg of an ox; and multiplying cabbages. These are just some of the forgotten medieval miracles of the Augustinian Order which Dr. Krisztina Ilko brings to light not long this 800-year-old organization found one of its members elected Pope […]\nThe post ‘Green-Thumb’ Miracles Gave These Monks an Eco-Authority in Medieval Italy New Research Shows appeared first on Good News Network.",
    "pubDate": "Thu, 05 Feb 2026 19:30:04 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/new-research-shows-how-green-fingered-miracles-gave-pope-leo-xivs-order-an-eco-authority-in-medieval-italy/",
    "category": "general",
    "positivityScore": 13
  },
  {
    "title": "Here’s why US household energy bills are soaring – and how to fix it | Mark Wolfe",
    "link": "https://www.theguardian.com/commentisfree/2026/feb/03/us-energy-bills-trump",
    "description": "Trump has prioritized fossil fuel companies over consumers, hitting the lowest-income families hardest\nDonald Trump promised to cut energy prices by 50%. Instead, average electricity prices over the past year have risen by about 6.7%, while natural gas prices have increased by 10.8%. Energy prices are influenced by many factors beyond any president’s direct control, including market conditions, weather-driven demand, regional infrastructure constraints and the rapid growth of energy-intensive datacenters that are driving new system costs. Policy choices do not determine prices on their own, but they do shape market outcomes, and the direction of this administration’s energy policy has been clear.\nFrom his first days in office, President Trump made clear that his energy agenda would prioritize fossil fuel producers over consumers. His administration moved to expand US liquefied natural gas exports, increasing exposure to volatile global markets. At the same time, it froze wind power projects that provide some of the cheapest new electricity, intervened to keep costly coal plants running, and backed the elimination of energy-efficiency tax credits that lower household energy bills.\nMark Wolfe is executive director of National Energy Assistance Directors Association, co-director of the Center on Energy Poverty and Climate and adjunct faculty at the Trachtenberg School of Public Policy at George Washington University\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 15:00:02 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/commentisfree/2026/feb/03/us-energy-bills-trump",
    "category": "climate",
    "positivityScore": 12
  },
  {
    "title": "Right to Build Offshore Wind Power Upheld by US Judge for 5th Time Since Attempted White House Ban",
    "link": "https://www.goodnewsnetwork.org/right-to-build-offshore-wind-power-upheld-by-us-judge-for-5th-time-since-attempted-white-house-ban/",
    "description": "A district court judge struck down the stop-work order on the Sunrise Wind project, marking the fifth time courts have overturned the Department of Interior’s order halting work on 5 offshore wind projects under construction along America’s eastern seaboard. Sunrise Wind now joins Coastal Virginia Wind, Empire Wind, Revolution Wind and Vineyard Wind, all of […]\nThe post Right to Build Offshore Wind Power Upheld by US Judge for 5th Time Since Attempted White House Ban appeared first on Good News Network.",
    "pubDate": "Fri, 06 Feb 2026 14:00:50 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/right-to-build-offshore-wind-power-upheld-by-us-judge-for-5th-time-since-attempted-white-house-ban/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Childbirths and Marriages Are Up and Divorces Are Down in World’s Least Fertile Country",
    "link": "https://www.goodnewsnetwork.org/childbirths-and-marriages-are-up-and-divorces-are-down-in-worlds-least-fertile-country/",
    "description": "At 0.77 children per woman in 2025, South Korea was the world’s least fertile country. Perhaps heralding a reversal of fortune, though, childbirths have grown at the fastest pace in 18 years on the Peninsula, with a 6.2% increase totaling 233,708 babies between January and November. The number of divorces, meanwhile, went down 9.8% on-year […]\nThe post Childbirths and Marriages Are Up and Divorces Are Down in World’s Least Fertile Country appeared first on Good News Network.",
    "pubDate": "Fri, 06 Feb 2026 12:00:49 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/childbirths-and-marriages-are-up-and-divorces-are-down-in-worlds-least-fertile-country/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "What went right this week: the good news that matters",
    "link": "https://www.positive.news/society/good-news-stories-from-week-6-of-2026/",
    "description": "A third of cancer cases are ‘avoidable’, Africa powers ahead on solar, and the push for global tax justice gathers pace, plus more good news\nThe post What went right this week: the good news that matters appeared first on Positive News.",
    "pubDate": "Fri, 06 Feb 2026 05:30:18 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/good-news-stories-from-week-6-of-2026/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Life lessons: former Olympian Aimee Fuller on what life so far has taught her",
    "link": "https://www.positive.news/society/life-lessons-aimee-fuller/",
    "description": "Now presenting the 2026 Winter Games on TNT, the former Team GB Olympic snowboarder reflects on what has shaped her life beyond the slopes\nThe post Life lessons: former Olympian Aimee Fuller on what life so far has taught her appeared first on Positive News.",
    "pubDate": "Thu, 05 Feb 2026 16:46:15 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/life-lessons-aimee-fuller/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "How Denmark is inviting visitors to rediscover analogue play",
    "link": "https://www.positive.news/lifestyle/culture/how-denmark-is-inviting-visitors-to-rediscover-analogue-play/",
    "description": "In the birthplace of Lego and Hans Christian Andersen, Denmark invites visitors to rediscover play as an antidote to digital overload\nThe post How Denmark is inviting visitors to rediscover analogue play appeared first on Positive News.",
    "pubDate": "Wed, 04 Feb 2026 07:00:13 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/lifestyle/culture/how-denmark-is-inviting-visitors-to-rediscover-analogue-play/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "A field of wheat becomes the world’s largest living photograph",
    "link": "https://www.positive.news/environment/a-field-of-wheat-becomes-the-worlds-largest-living-photograph/",
    "description": "Farming Photographs will see a field divided into ‘pixels’ of different wheats to grow a photographic-style artwork\nThe post A field of wheat becomes the world’s largest living photograph appeared first on Positive News.",
    "pubDate": "Mon, 02 Feb 2026 07:00:13 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/environment/a-field-of-wheat-becomes-the-worlds-largest-living-photograph/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Woman Discovers Childhood Pen Pal Became Doctor Who Delivered Her 2 Kids: ‘My Mouth Dropped’",
    "link": "https://www.goodnewsnetwork.org/woman-discovers-childhood-pen-pal-became-doctor-who-delivered-her-2-kids-my-mouth-dropped/",
    "description": "It wasn’t quite a reunion; since the women knew each other well. Their relationship, so far as they understood it, was that important one between an OB/GYN and their patient carrying a child. Little did Megan Lewis and Suzanne Koziol know it at the time, but their relationship was actually a little bit deeper than […]\nThe post Woman Discovers Childhood Pen Pal Became Doctor Who Delivered Her 2 Kids: ‘My Mouth Dropped’ appeared first on Good News Network.",
    "pubDate": "Thu, 05 Feb 2026 16:30:37 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/woman-discovers-childhood-pen-pal-became-doctor-who-delivered-her-2-kids-my-mouth-dropped/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 4",
    "link": "https://www.goodnewsnetwork.org/events070204/",
    "description": "Happy 53rd Birthday to Oscar De La Hoya, nicknamed the “Golden Boy of Boxing,” and winner of many world titles at lightweight, super lightweight, welterweight, and middleweight. De La Hoya had won 17 title bouts, either for claiming belts or retaining them, before he tasted the first defeat of his career, a reign of dominance […]\nThe post Good News in History, February 4 appeared first on Good News Network.",
    "pubDate": "Wed, 04 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070204/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 3",
    "link": "https://www.goodnewsnetwork.org/events070203/",
    "description": "40 years ago today, a group of computer animators started Pixar Animation Studios out of a corporate spin-off from Lucasfilm. Pixar would go on to make their first film Toy Story, 9 years later, and over the following 20 years become the most critically admired animation studio in the world. After being turned down 45 […]\nThe post Good News in History, February 3 appeared first on Good News Network.",
    "pubDate": "Tue, 03 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070203/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Kentucky’s Rural and Urban Communities Unite over Climate Change",
    "link": "https://reasonstobecheerful.world/kentucky-communities-unite-over-climate-change/",
    "description": "This story was originally published by Next City, a nonprofit newsroom reporting on solutions for equitable and just cities, and The CivicLex Weekly, a newsroom covering local government in Lexington, Kentucky. Two myths tend to shape how people talk about Kentucky and climate change. One is that the state is a “climate...\nThe post Kentucky’s Rural and Urban Communities Unite over Climate Change appeared first on Reasons to be Cheerful.",
    "pubDate": "Tue, 27 Jan 2026 16:03:38 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/kentucky-communities-unite-over-climate-change/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Government rolls back nature protections to boost housing",
    "link": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "description": "Critics say government changes to a flagship biodiversity policy could stall nature recovery.",
    "pubDate": "Tue, 16 Dec 2025 17:51:04 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 8
  },
  {
    "title": "Suzlon posts 45% jump in Q3 FY26 profit on record wind turbine deliveries",
    "link": "https://www.thehindubusinessline.com/companies/suzlon-posts-45-jump-in-q3-fy26-profit-on-record-wind-turbine-deliveries/article70595975.ece",
    "description": "Suzlon achieved its highest-ever quarterly deliveries of 617 MW, driving EBITDA growth of 48 per cent and margin expansion to 17.5 per cent",
    "pubDate": "2026-02-05T13:17:59Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/companies/suzlon-posts-45-jump-in-q3-fy26-profit-on-record-wind-turbine-deliveries/article70595975.ece",
    "category": "climate",
    "author": "BL Pune Bureau",
    "positivityScore": 8
  },
  {
    "title": "Energy Storage System (ESS) Research Report 2025: A $376.75 Billion Market by 2029, Driven by Renewable Expansion, EV Adoption, and Rising Energy Investment Accelerate Demand",
    "link": "https://www.globenewswire.com/news-release/2026/02/05/3233128/28124/en/Energy-Storage-System-ESS-Research-Report-2025-A-376-75-Billion-Market-by-2029-Driven-by-Renewable-Expansion-EV-Adoption-and-Rising-Energy-Investment-Accelerate-Demand.html",
    "description": "In 2023, the global energy storage system (ESS) market was valued at US$234.13 billion and is projected to reach US$376.75 billion by 2029, growing at a CAGR of 8.51% from 2024-2029. The surge in global adoption of renewable energy and increased grid investme…",
    "pubDate": "2026-02-05T14:34:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/05/3233128/28124/en/Energy-Storage-System-ESS-Research-Report-2025-A-376-75-Billion-Market-by-2029-Driven-by-Renewable-Expansion-EV-Adoption-and-Rising-Energy-Investment-Accelerate-Demand.html",
    "category": "climate",
    "author": "Research and Markets",
    "positivityScore": 8
  },
  {
    "title": "Will Pride in Place put communities back in charge of regeneration?",
    "link": "https://www.positive.news/society/will-pride-in-place-put-communities-back-in-charge-of-regeneration/",
    "description": "Tom Pattinson talks to the UK prime minister about a new scheme to help communities revive their neighbourhoods\nThe post Will Pride in Place put communities back in charge of regeneration? appeared first on Positive News.",
    "pubDate": "Fri, 06 Feb 2026 13:09:39 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/will-pride-in-place-put-communities-back-in-charge-of-regeneration/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "How communities are stepping up to revive our tired towns and cities",
    "link": "https://www.positive.news/society/how-communities-are-stepping-up-to-revive-our-tired-towns/",
    "description": "From ferry companies to pubs, communities are buying local assets to run for themselves. Could new funding supercharge the movement?\nThe post How communities are stepping up to revive our tired towns and cities appeared first on Positive News.",
    "pubDate": "Thu, 05 Feb 2026 16:40:10 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/how-communities-are-stepping-up-to-revive-our-tired-towns/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "We tried to buy nothing new for the whole of January. Here’s how we got on",
    "link": "https://www.positive.news/lifestyle/we-tried-to-buy-nothing-new-for-the-whole-of-january-heres-how-we-got-on/",
    "description": "Our team rose to the challenge of Buy Nothing New Month. Some fared better than others. This is what we learned taking part\nThe post We tried to buy nothing new for the whole of January. Here’s how we got on appeared first on Positive News.",
    "pubDate": "Wed, 04 Feb 2026 13:00:25 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/lifestyle/we-tried-to-buy-nothing-new-for-the-whole-of-january-heres-how-we-got-on/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 6",
    "link": "https://www.goodnewsnetwork.org/events070206/",
    "description": "55 years ago today, Apollo 14 astronaut Alan Shepard did one last thing before leaving the surface of the moon, something he had planned for months—he teed up a golf shot. The NASA commander brought a six-iron club head on board inside his space suit pocket which had a fitting on it for attaching to […]\nThe post Good News in History, February 6 appeared first on Good News Network.",
    "pubDate": "Fri, 06 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070206/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Minneapolis Moms Have Each Other’s Backs",
    "link": "https://reasonstobecheerful.world/minneapolis-moms-have-each-others-backs/",
    "description": "This story was originally reported by Chabeli Carrazana of The 19th. Meet Chabeli and read more of their reporting on gender, politics and policy. A newborn in Minneapolis hadn’t eaten for a day and a half. Her mother had risked going into work to get just enough money for more...\nThe post Minneapolis Moms Have Each Other’s Backs appeared first on Reasons to be Cheerful.",
    "pubDate": "Fri, 06 Feb 2026 08:00:40 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/minneapolis-moms-have-each-others-backs/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "What We’re Reading: The Country Legalizing Half a Million Undocumented Migrants",
    "link": "https://reasonstobecheerful.world/what-were-reading-spain-legalizes-undocumented-migrants/",
    "description": "Welcome back to our weekly behind-the-scenes glimpse at what’s getting our team talking. Tell us what you’ve been reading at info@reasonstobecheerful.world and we just might feature it here. Recognition and respect Spain’s socialist-led coalition government has announced a plan to legalize the status of undocumented migrants, a measure expected to...\nThe post What We’re Reading: The Country Legalizing Half a Million Undocumented Migrants appeared first on Reasons to be Cheerful.",
    "pubDate": "Wed, 04 Feb 2026 16:39:14 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/what-were-reading-spain-legalizes-undocumented-migrants/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Spark: How To Protest",
    "link": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "description": "Welcome back to The Spark, our monthly celebration of how people just like you are creating positive change, one meaningful step at a time. The Spark is generously supported by Laura Rice. Sign up to Reasons to be Cheerful’s weekly newsletter here and you’ll get The Spark in your inbox...\nThe post The Spark: How To Protest appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 02 Feb 2026 14:05:22 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Scientists just mapped the mutations that power cancer growth",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204121540.htm",
    "description": "Researchers have created the first complete map showing how hundreds of mutations in a key cancer gene affect tumor growth. By testing every possible mutation in a critical hotspot, they found that some changes barely boost cancer signals, while others supercharge them. When matched against real patient data, the map accurately predicted cancer behavior across tissues.",
    "pubDate": "Thu, 05 Feb 2026 07:29:14 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204121540.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "UK launches plan to tackle 'forever chemicals' amid growing concerns",
    "link": "https://www.bbc.com/news/articles/cz9vz249keno?at_medium=RSS&at_campaign=rss",
    "description": "Increasing testing for PFAS is part of the UK's first ever national plan for tackling the substances.",
    "pubDate": "Tue, 03 Feb 2026 00:06:49 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cz9vz249keno?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 6
  },
  {
    "title": "Is It Easy Being Green?",
    "link": "http://www.nybooks.com/articles/2026/02/26/is-it-easy-being-green/",
    "description": "To the Editors: Regarding Bill McKibben’s review of The Story of CO 2 Is the Story of Everything [“It’s a Gas,” NYR, January 15], and with all due respect to McKibben, I believe that his characterization of the transition to a wind and solar economy as someth…",
    "pubDate": "2026-02-05T12:30:00Z",
    "source": "The New York Review of Books",
    "sourceUrl": "http://www.nybooks.com/articles/2026/02/26/is-it-easy-being-green/",
    "category": "climate",
    "author": "Mark Roller, Bill McKibben",
    "positivityScore": 6
  },
  {
    "title": "Tata Power shares in focus as revenue declines 4% YoY to Rs 14,485 crore",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-power-shares-in-focus-as-revenue-declines-4-to-rs-14485-crore/articleshow/127923028.cms",
    "description": "Tata Power reported mixed Q3 FY26 results, with profit after tax rising 1% to Rs 1,194 crore, while revenue declined 4% year-on-year. The company achieved a significant milestone, exceeding 10 GW in cumulative renewable EPC execution. Its renewables business …",
    "pubDate": "2026-02-05T03:40:49Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/markets/stocks/news/tata-power-shares-in-focus-as-revenue-declines-4-to-rs-14485-crore/articleshow/127923028.cms",
    "category": "climate",
    "author": "ETMarkets.com",
    "positivityScore": 6
  },
  {
    "title": "Gstar’s Solar Module Series First to Achieve India’s New BIS Certification",
    "link": "https://www.thehindubusinessline.com/brandhub/pr-release/gstars-solar-module-series-first-to-achieve-indias-new-bis-certification/article70591628.ece",
    "description": "Gstar’s Solar Module Series First to Achieve India’s New BIS Certification",
    "pubDate": "2026-02-04T12:18:53Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/brandhub/pr-release/gstars-solar-module-series-first-to-achieve-indias-new-bis-certification/article70591628.ece",
    "category": "climate",
    "author": null,
    "positivityScore": 6
  },
  {
    "title": "Wind turbine maker Vestas sees record revenue in 2025",
    "link": "https://www.rte.ie/news/business/2026/0205/1556937-vestas-annual-results/",
    "description": "Denmark's Vestas, Europe's leading wind turbine manufacturer, today posted an all-time high revenue, but noted that regulatory changes in the US had made wind power investments less attractive.",
    "pubDate": "2026-02-05T13:40:48Z",
    "source": "RTE",
    "sourceUrl": "https://www.rte.ie/news/business/2026/0205/1556937-vestas-annual-results/",
    "category": "climate",
    "author": "RTÉ News",
    "positivityScore": 6
  },
  {
    "title": "Melting Antarctic ice may weaken a major carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "description": "Melting ice from West Antarctica once delivered huge amounts of iron to the Southern Ocean, but algae growth did not increase as expected. Researchers found the iron was in a form that marine life could not easily use. This means more melting ice does not automatically boost carbon absorption. In the future, Antarctic ice loss could actually reduce the ocean’s ability to slow climate change.",
    "pubDate": "Wed, 04 Feb 2026 04:32:51 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "A new scan lets scientists see inside the human body in 3D color",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204121550.htm",
    "description": "A new imaging breakthrough combines ultrasound and light-based techniques to generate vivid 3D images that show both tissue structure and blood vessel activity. Developed by researchers at Caltech and USC, the system delivers detailed results quickly and without radiation or contrast dyes. It has already been used to image multiple parts of the human body. The approach could significantly improve cancer detection, nerve-damage monitoring, and brain imaging.",
    "pubDate": "Fri, 06 Feb 2026 00:11:23 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204121550.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "The hidden health impact of growing up with ADHD traits",
    "link": "https://www.sciencedaily.com/releases/2026/01/260124073920.htm",
    "description": "A large, decades-long study suggests that signs of ADHD in childhood may have consequences that extend well beyond school and behavior. Researchers followed nearly 11,000 people from childhood into midlife and found that those with strong ADHD traits at age 10 were more likely to experience multiple physical health problems and health-related disability by their mid-40s.",
    "pubDate": "Sat, 24 Jan 2026 07:39:20 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260124073920.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Patriots DC Terrell Williams is saving lives with prostate cancer win: Doctors",
    "link": "https://www.bostonherald.com/2026/02/05/patriots-dc-terrell-williams-is-saving-lives-with-prostate-cancer-win-doctors/",
    "description": "Patriots defensive coordinator Terrell Williams is in Santa Clara, soaking in Super Bowl week, after winning his biggest battle as prostate cancer experts say his perseverance will help save lives.",
    "pubDate": "2026-02-05T10:07:36Z",
    "source": "Boston Herald",
    "sourceUrl": "https://www.bostonherald.com/2026/02/05/patriots-dc-terrell-williams-is-saving-lives-with-prostate-cancer-win-doctors/",
    "category": "health",
    "author": "Lance Reynolds",
    "positivityScore": 4
  },
  {
    "title": "Can you mix different neon tetras?",
    "link": "https://www.lifesciencesworld.com/can-you-mix-different-neon-tetras/",
    "description": "Can You Mix Different Neon Tetras?: A Comprehensive Guide Can you mix different neon tetras? Absolutely! Mixing different types of neon tetras in your aquarium is generally successful and often enhances the visual appeal and biodiversity of your tank. Underst…",
    "pubDate": "2026-02-05T07:00:23Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/can-you-mix-different-neon-tetras/",
    "category": "health",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "Eight Antarctic buildings that \"have the X Factor\"",
    "link": "https://www.dezeen.com/2026/02/05/antarctic-architecture-highlights/",
    "description": "Following the unveiling of the Discovery Building today, we look at eight architectural highlights from Antarctica over the past 20 years. By far the world's least developed continent, Antarctica has very few buildings. Two simple huts built in 1899 were the …",
    "pubDate": "2026-02-05T11:40:44Z",
    "source": "Dezeen",
    "sourceUrl": "https://www.dezeen.com/2026/02/05/antarctic-architecture-highlights/",
    "category": "climate",
    "author": "Tom Ravenscroft",
    "positivityScore": 4
  },
  {
    "title": "Targeting spinal cord perfusion pressure in acute spinal cord injury through cerebrospinal fluid drainage: A prospective multi-center clinical trial",
    "link": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004925",
    "description": "Cameron M. Gee and colleagues not only report whether targeting spinal cord perfusion pressure via cerebrospinal fluid drainage after acute traumatic spinal cord injury leads to better neurologic recovery than standard mean arterial pressure targets, but also…",
    "pubDate": "2026-02-05T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004925",
    "category": "wildlife",
    "author": "Cameron M. Gee, Angela Tsang, Miko McKenzie, Lise Belanger, Leanna Ritchie, Tamir Ailon, Charlotte Dandurand, Scott Paquette, Raphaele Charest-Morin, Nicolas Dea, John Street, Charles G. Fisher, Jefferson Wilson, Anthony DiGiorgio, Jean-Marc Mac-Thiong, Sean Christie, Jamie Wilson, Christian Ricks, David Okonkwo, Brian K. Kwon",
    "positivityScore": 4
  },
  {
    "title": "Jatayu vulture restaurant emerges as hub for vulture protection in Nepal",
    "link": "https://english.khabarhub.com/2026/05/533897/",
    "description": "KAWASOTI: The Jatayu Vulture Restaurant in Kawasoti, has been notable example of community-based vulture conservation. The center operates through the collaboration of local communities, national organizations, and international partners, where conservation r…",
    "pubDate": "2026-02-05T09:15:28Z",
    "source": "Khabarhub.com",
    "sourceUrl": "https://english.khabarhub.com/2026/05/533897/",
    "category": "wildlife",
    "author": "Khabarhub",
    "positivityScore": 4
  },
  {
    "title": "Forestry minister revokes Bandung Zoo permit to save animals",
    "link": "https://en.antaranews.com/news/403086/forestry-minister-revokes-bandung-zoo-permit-to-save-animals",
    "description": "The Forestry Ministry has revoked the permit of the Tamansari Wildlife Foundation, the conservation organization that manages Bandung Zoo, as a measure to ...",
    "pubDate": "2026-02-05T07:15:44Z",
    "source": "Antaranews.com",
    "sourceUrl": "https://en.antaranews.com/news/403086/forestry-minister-revokes-bandung-zoo-permit-to-save-animals",
    "category": "wildlife",
    "author": "Rubby Jovan Primananda, Cindy Frishanti Octavia",
    "positivityScore": 4
  },
  {
    "title": "How did the mongoose save the baby?",
    "link": "https://www.lifesciencesworld.com/how-did-the-mongoose-save-the-baby/",
    "description": "How the Mongoose Saved the Baby: A Tale of Instinct and Protection This article explores the astonishing scenarios of how the mongoose saved the baby, providing a comprehensive understanding of their protective behaviors and challenging common misconceptions …",
    "pubDate": "2026-02-03T01:59:01Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-did-the-mongoose-save-the-baby/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "Hamas hails reopening of Rafah crossing as big gain",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260202-presstv01.htm",
    "description": "Hamas has hailed the reopening of the Rafah crossing in southern Gaza Strip as a significant achievement of Palestinian resilience, pledging to make every effort to restore the vital crossing to full operation.",
    "pubDate": "2026-02-02T10:06:25Z",
    "source": "Globalsecurity.org",
    "sourceUrl": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260202-presstv01.htm",
    "category": "people",
    "author": "John Pike",
    "positivityScore": 4
  },
  {
    "title": "Florida euthanizes 5,000 iguanas after cold snap stuns the invasive reptiles",
    "link": "https://www.theguardian.com/us-news/2026/feb/05/florida-frozen-iguanas-euthanized",
    "description": "State culled a number of the non-native reptiles after thousands were ‘cold-stunned’ and dropped from trees\nWildlife officials in Florida say they euthanized more than 5,000 non-native iguanas in the state after hordes of the reptiles froze and fell from trees in this week’s cold snap.\nThe Florida fish and wildlife commission (FWC) authorized the first officially sanctioned cull of “cold-stunned” iguanas as temperatures plunged below freezing in many areas of the state.\n Continue reading...",
    "pubDate": "Thu, 05 Feb 2026 17:52:45 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2026/feb/05/florida-frozen-iguanas-euthanized",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "That’s a wrasse! Rare fish spotted for first time since 2009 in kelp forest in Western Australia",
    "link": "https://www.theguardian.com/environment/2026/feb/06/braun-wrasse-rare-fish-kelp-forest-western-australia",
    "description": "When marine biologist Océane Attlan saw the tiny Braun’s wrasse, it was like ‘recognising a familiar face, but you can’t put a name on it’ \n\nGet our breaking news email, free app or daily news podcast\n\nThe chances of encountering the rare reef fish were so far-fetched, it took marine biologist Océane Attlan a few seconds to clock what she was seeing.\n“All of a sudden I saw this fish. You know when you recognise a familiar face, but you can’t put a name on it. That’s the feeling I had,” she said.\n Continue reading...",
    "pubDate": "Fri, 06 Feb 2026 02:50:24 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/06/braun-wrasse-rare-fish-kelp-forest-western-australia",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "One of Earth’s most abundant lifeforms has a fatal flaw",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201231205.htm",
    "description": "SAR11 bacteria dominate the world’s oceans by being incredibly efficient, shedding genes to survive in nutrient-poor waters. But that extreme streamlining appears to backfire when conditions change. Under stress, many cells keep copying their DNA without dividing, creating abnormal cells that grow large and die. This vulnerability may explain why SAR11 populations drop during phytoplankton blooms and could become more important as oceans grow less stable.",
    "pubDate": "Mon, 02 Feb 2026 09:21:36 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201231205.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Forty years of forest data reveal a changing Amazon",
    "link": "https://www.sciencedaily.com/releases/2026/01/260125081133.htm",
    "description": "After analyzing 40 years of tree records across the Andes and Amazon, researchers found that climate change is reshaping tropical forests in uneven ways. Some regions are steadily losing tree species, especially where conditions are hotter and drier, while others are seeing gains. Rainfall patterns turned out to be just as important as rising temperatures.",
    "pubDate": "Sun, 25 Jan 2026 08:27:34 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260125081133.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Microplastics are undermining the ocean’s power to absorb carbon",
    "link": "https://www.sciencedaily.com/releases/2026/01/260116035322.htm",
    "description": "Tiny plastic particles drifting through the oceans may be quietly weakening one of Earth’s most powerful climate defenses. New research suggests microplastics are disrupting marine life that helps oceans absorb carbon dioxide, while also releasing greenhouse gases as they break down. By interfering with plankton, microbes, and natural carbon cycles, these pollutants reduce the ocean’s ability to regulate global temperatures.",
    "pubDate": "Sat, 17 Jan 2026 21:58:02 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260116035322.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Sound machines might be making your sleep worse",
    "link": "https://www.sciencedaily.com/releases/2026/02/260203030529.htm",
    "description": "Sound machines may not be the sleep saviors many believe. Researchers found that pink noise significantly reduced REM sleep, while simple earplugs did a better job protecting deep, restorative sleep from traffic noise. When pink noise was combined with outside noise, sleep quality dropped even further. The results suggest that popular “sleep sounds” could be doing more harm than good—particularly for kids.",
    "pubDate": "Wed, 04 Feb 2026 00:58:14 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260203030529.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "A silent brain disease can quadruple dementia risk",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201223732.htm",
    "description": "Researchers studying nearly 2 million older adults found that cerebral amyloid angiopathy sharply raises the risk of developing dementia. Within five years, people with the condition were far more likely to be diagnosed than those without it. The increased risk was present even without a history of stroke. Experts say this makes early screening for memory and thinking changes especially important.",
    "pubDate": "Sun, 01 Feb 2026 23:08:47 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201223732.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Middle age is becoming a breaking point in the U.S.",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201062457.htm",
    "description": "Middle age is becoming a tougher chapter for many Americans, especially those born in the 1960s and early 1970s. Compared with earlier generations, they report more loneliness and depression, along with weaker physical strength and declining memory. These troubling trends stand out internationally, as similar declines are largely absent in other wealthy nations, particularly in Nordic Europe, where midlife well-being has improved.",
    "pubDate": "Sun, 01 Feb 2026 10:25:53 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201062457.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "The fat you can’t see could be shrinking your brain",
    "link": "https://www.sciencedaily.com/releases/2026/01/260127112127.htm",
    "description": "Where your body stores fat may matter just as much as how much you carry—especially for your brain. Using advanced MRI scans and data from nearly 26,000 people, researchers identified two surprising fat patterns tied to faster brain aging, cognitive decline, and higher neurological disease risk. One involves unusually high fat buildup in the pancreas, even without much liver fat, while the other—often called “skinny fat”—affects people who don’t appear severely obese but carry excess fat relative to muscle.",
    "pubDate": "Wed, 28 Jan 2026 07:33:30 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260127112127.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "This bonobo had a pretend tea party — showing make believe isn’t just for humans",
    "link": "https://www.nature.com/articles/d41586-026-00357-7",
    "description": "",
    "pubDate": "2026-02-05T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00357-7",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Atlas-guided discovery of transcription factors for T cell programming",
    "link": "https://www.nature.com/articles/s41586-025-09989-7",
    "description": "",
    "pubDate": "2026-02-04T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/s41586-025-09989-7",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "What are critical minerals and why do countries need them?",
    "link": "https://www.bbc.com/news/articles/cj6wwx7zxd9o?at_medium=RSS&at_campaign=rss",
    "description": "Countries are racing to secure the critical minerals and rare earths needed to make vital products.",
    "pubDate": "Thu, 05 Feb 2026 13:22:13 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cj6wwx7zxd9o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Spain's commitment to renewable energy may be in doubt",
    "link": "https://www.bbc.com/news/articles/cn410nll79po?at_medium=RSS&at_campaign=rss",
    "description": "The current government is politically weakened and the opposition wants more use of fossil fuels.",
    "pubDate": "Mon, 15 Dec 2025 00:02:06 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cn410nll79po?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Landmark deal to cut global shipping emissions in tatters after US pressure",
    "link": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "description": "President Trump intervened in the talks calling the deal a \"green scam\".",
    "pubDate": "Fri, 17 Oct 2025 16:31:07 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "FKSUDDAPre: A drug–disease association prediction framework based on F-TEST feature selection and AMDKSU resampling with interpretability analysis",
    "link": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1013947",
    "description": "Author summary Drug repurposing offers a cost-effective alternative to traditional drug discovery, yet accurately predicting which existing drugs can treat specific diseases remains computationally challenging. In this study, we present FKSUDDAPre, a novel fr…",
    "pubDate": "2026-02-05T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1013947",
    "category": "science",
    "author": "Yun Zuo, Chenyi Zhang, Ge Hua, Qiao Ning, Xiangrong Liu, Xiangxiang Zeng, Zhaohong Deng",
    "positivityScore": 2
  },
  {
    "title": "When the Chips Are Down",
    "link": "http://www.nybooks.com/articles/2026/02/26/when-the-chips-are-down-china-us-ai/",
    "description": "President Trump’s reversal of a ban on sales of advanced semiconductors to China undercut the strategic logic behind years of American policy that was meant to keep the US ahead in the race to develop AI systems.",
    "pubDate": "2026-02-05T13:00:00Z",
    "source": "The New York Review of Books",
    "sourceUrl": "http://www.nybooks.com/articles/2026/02/26/when-the-chips-are-down-china-us-ai/",
    "category": "science",
    "author": "Julian Gewirtz",
    "positivityScore": 2
  },
  {
    "title": "Evogene and Shanghai Lishan Biopharmaceuticals Co. Announce Exclusive Licensing Agreement for BMC128, a Microbiome-Based Therapeutic for Renal and Lung Cancer",
    "link": "https://www.globenewswire.com/news-release/2026/02/05/3232614/0/en/Evogene-and-Shanghai-Lishan-Biopharmaceuticals-Co-Announce-Exclusive-Licensing-Agreement-for-BMC128-a-Microbiome-Based-Therapeutic-for-Renal-and-Lung-Cancer.html",
    "description": "BMC128 was developed by Biomica, Evogene’s subsidiary, and is currently completing Phase 1 clinical study, showing promising early clinical results BMC128 was developed by Biomica, Evogene’s subsidiary, and is currently completing Phase 1 clinical study, show…",
    "pubDate": "2026-02-05T03:00:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/05/3232614/0/en/Evogene-and-Shanghai-Lishan-Biopharmaceuticals-Co-Announce-Exclusive-Licensing-Agreement-for-BMC128-a-Microbiome-Based-Therapeutic-for-Renal-and-Lung-Cancer.html",
    "category": "science",
    "author": "Shanghai Lishan Biopharmaceuticals Co., Ltd.",
    "positivityScore": 2
  },
  {
    "title": "Halo Grow Unveiled: The Science Behind the HaloGrow Hair Growth Spray for Thicker, Fuller & Stronger Hair (2026 Consumer Report)",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3232432/0/en/Halo-Grow-Unveiled-The-Science-Behind-the-HaloGrow-Hair-Growth-Spray-for-Thicker-Fuller-Stronger-Hair-2026-Consumer-Report.html",
    "description": "Explore the Halo Grow Hair Spray engineered to support density, strength and scalp vitality. Learn how it works, what’s inside, and where to get it safely. Explore the Halo Grow Hair Spray engineered to support density, strength and scalp vitality. Learn how …",
    "pubDate": "2026-02-04T20:37:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3232432/0/en/Halo-Grow-Unveiled-The-Science-Behind-the-HaloGrow-Hair-Growth-Spray-for-Thicker-Fuller-Stronger-Hair-2026-Consumer-Report.html",
    "category": "science",
    "author": "Halo Grow",
    "positivityScore": 2
  },
  {
    "title": "Pluristyx and Solesis Launch First-of-its-Kind PluriForm™-GFP-3D Transfection Kit, Solving Critical Bottlenecks in Suspension Culture Transfection",
    "link": "https://www.globenewswire.com/news-release/2026/02/05/3232860/0/en/Pluristyx-and-Solesis-Launch-First-of-its-Kind-PluriForm-GFP-3D-Transfection-Kit-Solving-Critical-Bottlenecks-in-Suspension-Culture-Transfection.html",
    "description": "Pluristyx and Solesis launch ready-to-use kit combining high-quality pluripotent cells and mRNA technology with  proprietary transfection technology...",
    "pubDate": "2026-02-05T12:07:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/05/3232860/0/en/Pluristyx-and-Solesis-Launch-First-of-its-Kind-PluriForm-GFP-3D-Transfection-Kit-Solving-Critical-Bottlenecks-in-Suspension-Culture-Transfection.html",
    "category": "health",
    "author": "Pluristyx, Inc.",
    "positivityScore": 2
  },
  {
    "title": "Slot gives hope on key defneder’s possible return",
    "link": "https://anfieldindex.com/90908/slot-gives-hope-on-key-defneders-possible-return.html",
    "description": "Slot Confirms Defensive Setbacks as Liverpool Manage Frimpong and Gomez InjuriesLiverpool’s preparations for the upcoming Premier League fixture have been disrupted by fresh fitness concerns, with h...",
    "pubDate": "2026-02-05T10:15:00Z",
    "source": "Anfieldindex.com",
    "sourceUrl": "https://anfieldindex.com/90908/slot-gives-hope-on-key-defneders-possible-return.html",
    "category": "health",
    "author": "Anfield Index",
    "positivityScore": 2
  },
  {
    "title": "The $71 Billion Cancer Shift: Why The FDA Is Speeding Up",
    "link": "https://financialpost.com/globe-newswire/the-71-billion-cancer-shift-why-the-fda-is-speeding-up",
    "description": "Issued on behalf of Oncolytics Biotech Inc. VANCOUVER, British Columbia, Feb. 05, 2026 (GLOBE NEWSWIRE) — Equity-Insider.com News Commentary – The market is waking up to a $71 billion reality[1]. We are seeing a decisive move away from broad chemotherapy and …",
    "pubDate": "2026-02-05T14:30:55Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/globe-newswire/the-71-billion-cancer-shift-why-the-fda-is-speeding-up",
    "category": "health",
    "author": "GlobeNewswire",
    "positivityScore": 2
  },
  {
    "title": "Hims and Hers launches copy of Wegovy pill for $49",
    "link": "https://www.the-independent.com/life-style/health-and-families/hims-and-hers-weight-loss-pill-wegovy-copy-b2914601.html",
    "description": "Hims' compounded version of the treatment is made from the same active ingredient, semaglutide, as the one from Danish drugmaker Novo Nordisk",
    "pubDate": "2026-02-05T14:06:56Z",
    "source": "The-independent.com",
    "sourceUrl": "https://www.the-independent.com/life-style/health-and-families/hims-and-hers-weight-loss-pill-wegovy-copy-b2914601.html",
    "category": "health",
    "author": "Amina Niasse",
    "positivityScore": 2
  },
  {
    "title": "TGF-β1 relieves burn injury induced pain by alleviating inflammation in mouse",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342029",
    "description": "Burn injuries are severe traumas characterized by tissue damage and inflammation, and pain is the common symptom of burn patients. Transforming growth factor beta 1 (TGF-β1) is a multifunctional cytokine involved in organ development, immune response, tumor b…",
    "pubDate": "2026-02-05T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342029",
    "category": "health",
    "author": "Shengfeng Gao, Mengting Wang, Lu Wang, Yasu Jiang, Peng Chen, Li Guo, Lili Ni, Fan Fei, Zhenhua Gong",
    "positivityScore": 2
  },
  {
    "title": "Mixed effects of complement in a chronic murine model of inflammatory erosive arthritis and pulmonary vascular disease",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340677",
    "description": "Complement’s role in the pathology of rheumatoid arthritis and pulmonary hypertension (PH) is not fully understood. We aimed to determine whether complement deficiency is protective against joint and lung disease using the tumor necrosis factor-transgenic (TN…",
    "pubDate": "2026-02-05T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340677",
    "category": "health",
    "author": "Kiana L. Chen, Stacey Duemmel, Michael Christof, Gaochan Wang, H. Mark Kenney, Marc Nuzzo, Qingfu Xu, Benjamin Korman, Homaira Rahimi",
    "positivityScore": 2
  },
  {
    "title": "An exorcist couldn't cure Jadin O'Brien but now she's an Olympic bobsledder",
    "link": "https://www.indystar.com/story/sports/college/notre-dame/2026/02/05/jadin-obrien-is-an-olympic-bobsledder-after-battling-pandas-notre-dame-heptathlete/88367082007/",
    "description": "Jadin O'Brien battled a rare disease called PANDAS, was a star heptathlete and now an Olympic bobsledder",
    "pubDate": "2026-02-05T09:30:31Z",
    "source": "The Indianapolis Star",
    "sourceUrl": "https://www.indystar.com/story/sports/college/notre-dame/2026/02/05/jadin-obrien-is-an-olympic-bobsledder-after-battling-pandas-notre-dame-heptathlete/88367082007/",
    "category": "health",
    "author": "David Woods, Special to IndyStar",
    "positivityScore": 2
  },
  {
    "title": "PCR Plastic Packaging Market Set to Reach US$ 58.27 Billion by 2035 as Global Fiscal Penalties Accelerate Adoption of Recycled Packaging Solutions | Astute Analytica",
    "link": "https://www.globenewswire.com/news-release/2026/02/05/3232866/0/en/PCR-Plastic-Packaging-Market-Set-to-Reach-US-58-27-Billion-by-2035-as-Global-Fiscal-Penalties-Accelerate-Adoption-of-Recycled-Packaging-Solutions-Astute-Analytica.html",
    "description": "Brands in personal care, cleaning products, and retail are targeting higher PCR blends amid EPR laws in multiple states. Challenges like resin consistency persist, but collaborations are expanding high-grade supply chains. Overall, the sector aligns with broa…",
    "pubDate": "2026-02-05T12:17:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/05/3232866/0/en/PCR-Plastic-Packaging-Market-Set-to-Reach-US-58-27-Billion-by-2035-as-Global-Fiscal-Penalties-Accelerate-Adoption-of-Recycled-Packaging-Solutions-Astute-Analytica.html",
    "category": "climate",
    "author": "AstuteAnalytica India Pvt. Ltd.",
    "positivityScore": 2
  },
  {
    "title": "Suzlon Energy Q3 profit rises nearly 15% to ₹445 cr",
    "link": "https://www.thehindubusinessline.com/companies/suzlon-energy-q3-profit-rises-nearly-15-to-445-cr/article70595189.ece",
    "description": "Suzlon Energy reports a nearly 15% rise in Q3 profit to ₹445 crore, driven by increased revenue and strong orderbook.",
    "pubDate": "2026-02-05T10:11:10Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/companies/suzlon-energy-q3-profit-rises-nearly-15-to-445-cr/article70595189.ece",
    "category": "climate",
    "author": "PTI",
    "positivityScore": 2
  },
  {
    "title": "Tata Power delivers strong Q3 FY26 performance; Q3 FY26 PAT grows to Rs 1,194 crore: 9M FY26 PAT rises to Rs 3,702 crore up 7 % (YoY)",
    "link": "https://www.thehindubusinessline.com/brandhub/pr-release/tata-power-delivers-strong-q3-fy26-performance-q3-fy26-pat-grows-to-rs-1194-crore-9m-fy26-pat-rises-to-rs-3702-crore-up-7-yoy/article70594550.ece",
    "description": "Tata Power delivers strong Q3 FY26 performance; Q3 FY26 PAT grows to Rs 1,194 crore: 9M FY26 PAT rises to Rs 3,702 crore up 7 % (YoY)",
    "pubDate": "2026-02-05T08:55:35Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/brandhub/pr-release/tata-power-delivers-strong-q3-fy26-performance-q3-fy26-pat-grows-to-rs-1194-crore-9m-fy26-pat-rises-to-rs-3702-crore-up-7-yoy/article70594550.ece",
    "category": "climate",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "Skeptical Science New Research for Week #6 2026",
    "link": "https://skepticalscience.com/new_research_2026_06.html",
    "description": "Open access notables\n\nRisk perception and response to changing wildfire hazards: family forest owners in the western US Pacific Northwest, Fischer et al., Climate Risk Management\n\nClimate models predict future increases in the frequency, magnitude, and durati…",
    "pubDate": "2026-02-05T07:08:24Z",
    "source": "Skepticalscience.com",
    "sourceUrl": "https://skepticalscience.com/new_research_2026_06.html",
    "category": "climate",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "Sir, You’re Behind on Your Cheese",
    "link": "https://dailyreckoning.com/sir-youre-behind-on-your-cheese/",
    "description": "This post Sir, You’re Behind on Your Cheese appeared first on Daily Reckoning.\nOne free weekend last May, Pam, Micah, and I decided to take a ride to Bologna, in Emilia-Romagna, a mere three hours by car from our home in Il Piemonte. Friends had told me that …",
    "pubDate": "2026-02-05T14:22:13Z",
    "source": "Dailyreckoning.com",
    "sourceUrl": "https://dailyreckoning.com/sir-youre-behind-on-your-cheese/",
    "category": "climate",
    "author": "Sean Ring",
    "positivityScore": 2
  },
  {
    "title": "In 1916, hybrid cars could’ve changed history. But Ford wouldn’t allow it.",
    "link": "http://www.popsci.com/technology/first-hybrid-cars-ford/",
    "description": "Henry Ford's monopoly on the automobile industry meant that hybrids wouldn't see the light of day for decades.\nThe post In 1916, hybrid cars could’ve changed history. But Ford wouldn’t allow it. appeared first on Popular Science.",
    "pubDate": "2026-02-05T14:01:00Z",
    "source": "Popular Science",
    "sourceUrl": "http://www.popsci.com/technology/first-hybrid-cars-ford/",
    "category": "climate",
    "author": "Bill Gourgey",
    "positivityScore": 2
  },
  {
    "title": "Integrated environmental DNA analysis and population assessment revealed a biannual breeding season of the Korean clawed salamander (Onychodactylus koreanus)",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342469",
    "description": "Determining the breeding season of a species is key to understanding its life cycle and to ensuring efficient conservation. Determining the breeding season is challenging for subterranean breeders. Environmental DNA (eDNA) applications have been proposed alon…",
    "pubDate": "2026-02-05T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342469",
    "category": "climate",
    "author": "Min-Woo Park, Jaejin Park, Jongsun Kim, Jiho Park, Narae Joo, Hahyun Nam, Daesik Park",
    "positivityScore": 2
  },
  {
    "title": "SpaceX Acquires xAI: Elon Musk’s Vision to Put AI in Orbit",
    "link": "https://www.androidheadlines.com/2026/02/spacex-acquires-xai-space-data-centers.html",
    "description": "Elon Musk's SpaceX has officially acquired xAI with the goal of building the first-ever network of AI data centers in space.",
    "pubDate": "2026-02-03T17:32:57Z",
    "source": "Android Headlines",
    "sourceUrl": "https://www.androidheadlines.com/2026/02/spacex-acquires-xai-space-data-centers.html",
    "category": "climate",
    "author": "Jean Leon",
    "positivityScore": 2
  },
  {
    "title": "Another Cold Blast to Grip US Northeast, Testing Power Demand",
    "link": "https://financialpost.com/pmn/business-pmn/another-cold-blast-to-grip-us-northeast-testing-power-demand",
    "description": "The US Northeast, including New York City, will get a brief touch of snow this weekend before a frigid blast of arctic air pushes through the region, leaving winter-weary residents shivering and putting additional stress on power grids and energy prices.",
    "pubDate": "2026-02-05T14:29:10Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/pmn/business-pmn/another-cold-blast-to-grip-us-northeast-testing-power-demand",
    "category": "climate",
    "author": "Bloomberg News",
    "positivityScore": 2
  },
  {
    "title": "High-quality histochemistry, immunohistochemistry, and immunofluorescence on xylene- and formalin-free paraffin-embedded tissues",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340480",
    "description": "Pathology is a vital part of modern medicine, playing an essential role in disease diagnosis, prognosis, and therapy choice. The field of pathology depends on traditional tissue embedding techniques, still routinely using toxic and even carcinogenic substance…",
    "pubDate": "2026-02-05T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340480",
    "category": "wildlife",
    "author": "Maarten Niemantsverdriet, Anne Mei Eshuis, Naomi van der Horst, Rory Ogink, Pien van Smeerdijk, Jose van der Starre-Gaal, Agnes Marije Hoogland",
    "positivityScore": 2
  },
  {
    "title": "Did Native Americans hunt bears?",
    "link": "https://www.lifesciencesworld.com/did-native-americans-hunt-bears/",
    "description": "Did Native Americans Hunt Bears? Unveiling a Complex Relationship Yes, Native Americans did hunt bears, but the practice was far more complex than simple sustenance. It was deeply interwoven with spirituality, respect, and sustainable resource management, var…",
    "pubDate": "2026-02-05T06:10:10Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/did-native-americans-hunt-bears/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Fight Against Galamsey: Gov’t Reclaims 800 Acres Of Mined Areas At Manso Nyankumase",
    "link": "https://thechronicle.com.gh/fight-against-galamsey-govt-reclaims-800-acres-of-mined-areas-at-manso-nyankumase/",
    "description": "About 800 acres of land degraded by illegal mining activities at Nyankumase in the Manso Adubia enclave in the Ashanti Region has been reclaimed as part of efforts by the Mahama government to restore degraded lands. The reclamation works, which started four m…",
    "pubDate": "2026-02-05T09:20:53Z",
    "source": "Thechronicle.com.gh",
    "sourceUrl": "https://thechronicle.com.gh/fight-against-galamsey-govt-reclaims-800-acres-of-mined-areas-at-manso-nyankumase/",
    "category": "wildlife",
    "author": "SEBASTIAN R. FREIKU",
    "positivityScore": 2
  },
  {
    "title": "What does hand sanitizer do to spiders?",
    "link": "https://www.lifesciencesworld.com/what-does-hand-sanitizer-do-to-spiders/",
    "description": "What Hand Sanitizer Does to Spiders: Unveiling the Effects Hand sanitizer likely kills spiders by dissolving their protective wax coating, leading to dehydration and potentially affecting their nervous system. This effect depends on the sanitizer’s alcohol co…",
    "pubDate": "2026-02-05T04:41:15Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-does-hand-sanitizer-do-to-spiders/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Where do black bears most often choose to den?",
    "link": "https://www.lifesciencesworld.com/where-do-black-bears-most-often-choose-to-den/",
    "description": "Where Do Black Bears Most Often Choose to Den? Black bears typically choose den sites that offer protection from the elements and predators, and these sites are usually found in natural cavities like hollow trees, under fallen logs, in rock crevices, or in se…",
    "pubDate": "2026-02-05T08:23:57Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/where-do-black-bears-most-often-choose-to-den/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "How long does it take for a baby mourning dove to fly?",
    "link": "https://www.lifesciencesworld.com/how-long-does-it-take-for-a-baby-mourning-dove-to-fly/",
    "description": "How Long Does It Take for a Baby Mourning Dove to Fly? A baby mourning dove’s journey to flight is relatively swift; they typically leave the nest and achieve flight capabilities within 11 to 15 days after hatching. Understanding this development can help app…",
    "pubDate": "2026-02-05T06:37:51Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-long-does-it-take-for-a-baby-mourning-dove-to-fly/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "STARFLEET ACADEMY Explains What Became of the Klingons in the 32nd Century",
    "link": "https://nerdist.com/article/star-trek-starfleet-academy-what-happened-klingons-32nd-century/",
    "description": "Episode four of Star Trek: Starfleet Academy finally explains what became of the mighty Klingon Empire in the 32 century.\nThe post STARFLEET ACADEMY Explains What Became of the Klingons in the 32nd Century appeared first on Nerdist.",
    "pubDate": "2026-01-29T08:00:00Z",
    "source": "Nerdist",
    "sourceUrl": "https://nerdist.com/article/star-trek-starfleet-academy-what-happened-klingons-32nd-century/",
    "category": "wildlife",
    "author": "Eric Diaz",
    "positivityScore": 2
  },
  {
    "title": "Opening of Rafah crossing heralds second phase of Gaza ceasefire plan",
    "link": "https://www.irishtimes.com/world/middle-east/2026/02/02/opening-of-rafah-crossing-heralds-second-phase-of-gaza-ceasefire-plan/",
    "description": "More than 20,000 Gaza residents need medical treatment abroad, but early stage of plan only allows for 150 to exit daily",
    "pubDate": "2026-02-02T15:37:35Z",
    "source": "The Irish Times",
    "sourceUrl": "https://www.irishtimes.com/world/middle-east/2026/02/02/opening-of-rafah-crossing-heralds-second-phase-of-gaza-ceasefire-plan/",
    "category": "people",
    "author": "Mark Weiss in Jerusalem",
    "positivityScore": 2
  },
  {
    "title": "What went right this week: not-so-lawless Britain, plus more",
    "link": "https://www.positive.news/society/good-news-stories-from-week-5-of-2026/",
    "description": "England’s murder rate plummeted, France said ‘non’ to social media for kids, and the world set a welcome record, plus more\nThe post What went right this week: not-so-lawless Britain, plus more appeared first on Positive News.",
    "pubDate": "Fri, 30 Jan 2026 04:00:09 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/good-news-stories-from-week-5-of-2026/",
    "category": "general",
    "positivityScore": -1
  },
  {
    "title": "Good News in History, February 5",
    "link": "https://www.goodnewsnetwork.org/events070205/",
    "description": "On this day 41 years ago, and in a charming little stint of political theater, the mayor of Rome, Ugo Vettere, and his counterpart Mr. Chedli Klibi in Carthage, Tunisia, met on a mission of goodwill to officially end the Third Punic War, which concluded with the destruction of Carthage 2,132 years ago. The agreement […]\nThe post Good News in History, February 5 appeared first on Good News Network.",
    "pubDate": "Thu, 05 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070205/",
    "category": "general",
    "positivityScore": -3
  },
  {
    "title": "The Most Chess-Obsessed Country in the World",
    "link": "https://reasonstobecheerful.world/india-most-chess-obsessed-country-in-the-world/",
    "description": "This article was originally published in the February edition of Rotary magazine. It’s 9 o’clock on a Sunday morning and the temperature is soaring toward the 90s as hundreds of children make their way toward the iconic Marina Beach in the southern Indian metropolis of Chennai. Yet there’s not a...\nThe post The Most Chess-Obsessed Country in the World appeared first on Reasons to be Cheerful.",
    "pubDate": "Fri, 30 Jan 2026 08:00:19 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/india-most-chess-obsessed-country-in-the-world/",
    "category": "general",
    "positivityScore": -3
  },
  {
    "title": "The City Where Traffic Fatalities Vanished",
    "link": "https://reasonstobecheerful.world/the-city-where-traffic-fatalities-vanished/",
    "description": "A U.S. city of 60,000 people would typically see around six to eight traffic fatalities every year. But Hoboken, New Jersey? They haven’t had a single fatal crash for nine years — since January 17, 2017, to be exact.  Campaigns for seatbelts, lower speed limits and sober driving have brought...\nThe post The City Where Traffic Fatalities Vanished appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 26 Jan 2026 08:00:05 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/the-city-where-traffic-fatalities-vanished/",
    "category": "general",
    "positivityScore": -3
  },
  {
    "title": "Inside the Teen-Run Hotline Meeting America’s Mental Health Crisis",
    "link": "https://reasonstobecheerful.world/teen-mental-health-peer-support-hotline-california/",
    "description": "On weekday evenings between 6 p.m. and 10 p.m. PST, the small, softly lit Teen Line office in Century City, CA, begins to buzz. A handful of high schoolers — many still in their school sweatshirts — settle into cubicles, put on headsets and begin answering calls, texts and emails...\nThe post Inside the Teen-Run Hotline Meeting America’s Mental Health Crisis appeared first on Reasons to be Cheerful.",
    "pubDate": "Fri, 23 Jan 2026 08:00:34 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/teen-mental-health-peer-support-hotline-california/",
    "category": "general",
    "positivityScore": -3
  }
]