[
  {
    "title": "Over 90 California Fish Stocks Almost Totally Rebuilt Thanks to Trawling Ban, Other Measures",
    "link": "https://www.goodnewsnetwork.org/over-90-california-fish-stocks-almost-totally-rebuilt-thanks-to-trawling-ban-other-measures/",
    "description": "Over the last 25 years, Californian fishing regulations have seen the dramatic recovery of various game fish like sea bass and rockfish to the point where they can be fished sustainably again. Collectively known as groundfish, these stocks were serially depleted in the 1990s and early 2000s. Fish like ocean perch and bocaccio live close […]\nThe post Over 90 California Fish Stocks Almost Totally Rebuilt Thanks to Trawling Ban, Other Measures appeared first on Good News Network.",
    "pubDate": "Mon, 16 Feb 2026 12:00:05 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/over-90-california-fish-stocks-almost-totally-rebuilt-thanks-to-trawling-ban-other-measures/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "8-Year-Old Maryland Girl Becomes Youngest Grammy Winner Ever with Daddy-Daughter Album",
    "link": "https://www.goodnewsnetwork.org/8-year-old-maryland-girl-becomes-youngest-grammy-winner-ever-with-daddy-daughter-album-collaboration/",
    "description": "An 8-year-old Maryland girl and her dad have made history with an album that’s the musical equivalent of sunshine. Aura V. and her father, whose recording name is Fyütch, won a Grammy this month for Best Children’s Music Album for their LP Harmony. The triumph makes Aura the youngest Grammy winner in the organization’s history, […]\nThe post 8-Year-Old Maryland Girl Becomes Youngest Grammy Winner Ever with Daddy-Daughter Album appeared first on Good News Network.",
    "pubDate": "Sun, 15 Feb 2026 21:08:29 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/8-year-old-maryland-girl-becomes-youngest-grammy-winner-ever-with-daddy-daughter-album-collaboration/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "From 10% to 47%: Cardiac Survival Rates Surge in Texas City That’s Empowering Citizens to Save Lives",
    "link": "https://www.goodnewsnetwork.org/cardiac-survival-rates-surge-from-10-to-47pt-in-texas-city-thats-empowering-citizens-to-save-lives/",
    "description": "Over the past two years, the city of McKinney, Texas, has significantly improved cardiac arrest survival rates through a coordinated effort between its fire and police departments—and, now, its citizens. Two years ago, if your heart stopped in McKinney, your chances of surviving were just 10 percent, the same as many U.S. cities. Today, that […]\nThe post From 10% to 47%: Cardiac Survival Rates Surge in Texas City That’s Empowering Citizens to Save Lives appeared first on Good News Network.",
    "pubDate": "Sun, 15 Feb 2026 18:48:02 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/cardiac-survival-rates-surge-from-10-to-47pt-in-texas-city-thats-empowering-citizens-to-save-lives/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Two Lost ‘Jungle Book’ Original Paintings Found in Family’s Home After a Century–They had No Clue What They Were",
    "link": "https://www.goodnewsnetwork.org/two-lost-jungle-book-original-watercolors-found-in-london-home-after-a-century/",
    "description": "Two original illustrations for Rudyard Kipling’s The Jungle Book that were lost for over a century have been discovered. The watercolors had been hanging unrecognized on the walls of a London family home for decades. The rediscovery increases the number of known surviving originals to just six out of an original set of 16. The […]\nThe post Two Lost ‘Jungle Book’ Original Paintings Found in Family’s Home After a Century–They had No Clue What They Were appeared first on Good News Network.",
    "pubDate": "Sun, 15 Feb 2026 15:00:51 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/two-lost-jungle-book-original-watercolors-found-in-london-home-after-a-century/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Lab grown human spinal cord heals after injury in major breakthrough",
    "link": "https://www.sciencedaily.com/releases/2026/02/260216044003.htm",
    "description": "Researchers have built a realistic human mini spinal cord in the lab and used it to simulate traumatic injury. The model reproduced key damage seen in real spinal cord injuries, including inflammation and scar formation. After treatment with fast moving “dancing molecules,” nerve fibers began growing again and scar tissue shrank. The results suggest the therapy could eventually help repair spinal cord damage.",
    "pubDate": "Mon, 16 Feb 2026 07:41:25 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260216044003.htm",
    "category": "health",
    "positivityScore": 10
  },
  {
    "title": "Web of undersea cables poised to become marine observatory",
    "link": "https://www.positive.news/environment/conservation/web-of-undersea-cables-poised-to-become-marine-observatory/",
    "description": "Telecom infrastructure at the ocean floor is being harnessed as a powerful conservation tool for vulnerable marine mammals\nThe post Web of undersea cables poised to become marine observatory appeared first on Positive News.",
    "pubDate": "Mon, 16 Feb 2026 10:23:21 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/environment/conservation/web-of-undersea-cables-poised-to-become-marine-observatory/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "What Happens When a Neighborhood Is Built Around a Farm?",
    "link": "https://reasonstobecheerful.world/agrihoods-neighborhoods-built-around-farms/",
    "description": "This story was originally published by Grist, an independent media organization dedicated to telling stories of climate solutions and a just future. Sign up for Grist’s weekly newsletter here. Picture the bucolic little town of a fairy tale. At its core stand medieval buildings, a square where folks hawk their...\nThe post What Happens When a Neighborhood Is Built Around a Farm? appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 16 Feb 2026 08:00:49 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/agrihoods-neighborhoods-built-around-farms/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Government rolls back nature protections to boost housing",
    "link": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "description": "Critics say government changes to a flagship biodiversity policy could stall nature recovery.",
    "pubDate": "Tue, 16 Dec 2025 17:51:04 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 8
  },
  {
    "title": "Magical Footage Shows Stag Strolling up to Lick a Man’s Camera Then Calmly Walking Away – WATCH",
    "link": "https://www.goodnewsnetwork.org/magical-footage-shows-stag-strolling-up-to-lick-a-mans-camera/",
    "description": "A new video from the Scottish Highlands shows a wild stag walking right up to a hiker, getting so close that his breath fogged up the stunned man’s camera lens. The ‘magical’ moment was captured by Craig who journeys around Scotland in a motorhome and documents his travels as the Roaming Thistle on social media. […]\nThe post Magical Footage Shows Stag Strolling up to Lick a Man’s Camera Then Calmly Walking Away – WATCH appeared first on Good News Network.",
    "pubDate": "Sun, 15 Feb 2026 16:38:03 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/magical-footage-shows-stag-strolling-up-to-lick-a-mans-camera/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny",
    "link": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-14-2026/",
    "description": "Our partner Rob Brezsny, who has a new book out, Astrology Is Real: Revelations from My Life as an Oracle, provides his weekly wisdom to enlighten our thinking and motivate our mood. Rob’s Free Will Astrology, is a syndicated weekly column appearing in over a hundred publications. He is also the author of Pronoia Is the Antidote […]\nThe post Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 11:00:18 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-14-2026/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 13",
    "link": "https://www.goodnewsnetwork.org/events070213/",
    "description": "This daily column at GNN.org features all the good news, anniversaries and notable birthdays from this day in history—February 13.\nThe post Good News in History, February 13 appeared first on Good News Network.",
    "pubDate": "Fri, 13 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070213/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Spark: How To Protest",
    "link": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "description": "Welcome back to The Spark, our monthly celebration of how people just like you are creating positive change, one meaningful step at a time. The Spark is generously supported by Laura Rice. Sign up to Reasons to be Cheerful’s weekly newsletter here and you’ll get The Spark in your inbox...\nThe post The Spark: How To Protest appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 02 Feb 2026 14:05:22 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Forests are changing fast and scientists are deeply concerned",
    "link": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "description": "Forests around the world are quietly transforming, and not for the better. A massive global analysis of more than 31,000 tree species reveals that forests are becoming more uniform, increasingly dominated by fast-growing “sprinter” trees, while slow-growing, long-lived species are disappearing. These slower species act as the backbone of forest ecosystems, storing carbon, stabilizing environments, and supporting rich webs of life—especially in tropical regions where biodiversity is highest.",
    "pubDate": "Mon, 09 Feb 2026 02:17:56 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "New FDA-Approved Device Uses Electric Fields to Treat Pancreatic Cancer",
    "link": "https://www.discovermagazine.com/new-fda-approved-device-uses-electric-fields-to-treat-pancreatic-cancer-48693",
    "description": "Learn more about the newly approved wearable treatment that disrupts pancreatic cancer tumor growth while letting patients continue daily life at home.",
    "pubDate": "2026-02-14T15:00:00Z",
    "source": "Discover Magazine",
    "sourceUrl": "https://www.discovermagazine.com/new-fda-approved-device-uses-electric-fields-to-treat-pancreatic-cancer-48693",
    "category": "health",
    "author": "Jenny Lehmann",
    "positivityScore": 6
  },
  {
    "title": "India's power generation capacity addition crosses 50 GW during April-January period",
    "link": "https://economictimes.indiatimes.com/industry/energy/power/indias-power-generation-capacity-addition-crosses-50-gw-during-april-january-period/articleshow/128385340.cms",
    "description": "India has made waves in the energy sector, recording an unprecedented power generation expansion of over 52 GW from April to January in this fiscal year alone. This impressive growth, fueled largely by solar power, breaks prior records and showcases the natio…",
    "pubDate": "2026-02-15T14:01:31Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/industry/energy/power/indias-power-generation-capacity-addition-crosses-50-gw-during-april-january-period/articleshow/128385340.cms",
    "category": "climate",
    "author": "PTI",
    "positivityScore": 6
  },
  {
    "title": "‘A different set of rules’: thermal drone footage shows Musk’s AI power plant flouting clean air regulations",
    "link": "https://www.theguardian.com/environment/2026/feb/13/elon-musk-xai-datacenters-air-pollution-mississippi",
    "description": "Images confirm xAI is continuing to defy EPA regulations in Mississippi to power its flagship datacenters\nElon Musk’s artificial intelligence company is continuing to fuel its datacenters with unpermitted gas turbines, an investigation by the Floodlight newsroom shows. Thermal footage captured by Floodlight via drone shows xAI is still burning gas at a facility in Southaven, Mississippi, despite a recent Environmental Protection Agency (EPA) ruling reiterating that doing so requires a state permit in advance.\nState regulators in Mississippi maintain that since the turbines are parked on tractor trailers, they don’t require permits. However, the EPA has long maintained that such pollution sources require permits under the Clean Air Act.\n Continue reading...",
    "pubDate": "Fri, 13 Feb 2026 18:00:15 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/13/elon-musk-xai-datacenters-air-pollution-mississippi",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Melting Antarctic ice may weaken a major carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "description": "Melting ice from West Antarctica once delivered huge amounts of iron to the Southern Ocean, but algae growth did not increase as expected. Researchers found the iron was in a form that marine life could not easily use. This means more melting ice does not automatically boost carbon absorption. In the future, Antarctic ice loss could actually reduce the ocean’s ability to slow climate change.",
    "pubDate": "Wed, 04 Feb 2026 04:32:51 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Scientists discover the enzyme that lets cancer rapidly rewire its DNA",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215225546.htm",
    "description": "Researchers have uncovered the enzyme behind chromothripsis, a chaotic chromosome-shattering event seen in about one in four cancers. The enzyme, N4BP2, breaks apart DNA trapped in tiny cellular structures, unleashing a burst of genetic changes that can help tumors rapidly adapt and resist therapy. Blocking the enzyme dramatically reduced this genomic destruction in cancer cells.",
    "pubDate": "Mon, 16 Feb 2026 01:00:42 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215225546.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Exercise may be one of the most powerful treatments for depression and anxiety",
    "link": "https://www.sciencedaily.com/releases/2026/02/260213020412.htm",
    "description": "A sweeping review of global research suggests that exercise—especially aerobic activities like running, swimming, and dancing—can be one of the most powerful ways to ease depression and anxiety. Across tens of thousands of people aged 10 to 90, exercise consistently reduced symptoms, often matching or even outperforming medication and talk therapy.",
    "pubDate": "Mon, 16 Feb 2026 01:58:04 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260213020412.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Scientists confirm one-dimensional electron behavior in phosphorus chains",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215225541.htm",
    "description": "For the first time, researchers have shown that self-assembled phosphorus chains can host genuinely one-dimensional electron behavior. Using advanced imaging and spectroscopy techniques, they separated the signals from chains aligned in different directions to reveal their true nature. The findings suggest that squeezing the chains closer together could trigger a dramatic shift from semiconductor to metal. That means simply adjusting density could unlock entirely new electronic states.",
    "pubDate": "Mon, 16 Feb 2026 06:52:35 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215225541.htm",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "Shinya Yamanaka Was Ranked Last in School—Then Won a Nobel Prize",
    "link": "https://economictimes.indiatimes.com/news/international/us/shinya-yamanaka-was-ranked-last-in-schoolthen-won-a-nobel-prize/articleshow/128376654.cms",
    "description": "Shinya Yamanaka, a Nobel laureate, did not follow a typical path to success. His curiosity and persistence led to a groundbreaking discovery in stem cell research. This work allows scientists to reprogram mature cells, offering vast potential for treating dis…",
    "pubDate": "2026-02-15T08:30:59Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/international/us/shinya-yamanaka-was-ranked-last-in-schoolthen-won-a-nobel-prize/articleshow/128376654.cms",
    "category": "science",
    "author": "Global Desk",
    "positivityScore": 4
  },
  {
    "title": "Brain inspired machines are better at math than expected",
    "link": "https://www.sciencedaily.com/releases/2026/02/260213223923.htm",
    "description": "Neuromorphic computers modeled after the human brain can now solve the complex equations behind physics simulations — something once thought possible only with energy-hungry supercomputers. The breakthrough could lead to powerful, low-energy supercomputers wh…",
    "pubDate": "2026-02-14T15:19:40Z",
    "source": "Science Daily",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260213223923.htm",
    "category": "science",
    "author": null,
    "positivityScore": 4
  },
  {
    "title": "India adds a record 52.5 GW of power generation capacity so far in FY26",
    "link": "https://www.livemint.com/industry/energy/india-power-capacity-renewable-energy-india-11771157985321.html",
    "description": "Companies have installed power generation capacity of 52.53 GW in the first nine months of FY26, surpassing the 34 GW installed in all of FY25, the power ministry said on Sunday.",
    "pubDate": "2026-02-15T13:27:57Z",
    "source": "Livemint",
    "sourceUrl": "https://www.livemint.com/industry/energy/india-power-capacity-renewable-energy-india-11771157985321.html",
    "category": "climate",
    "author": "Rituraj Baruah",
    "positivityScore": 4
  },
  {
    "title": "Tokens of AI Biases",
    "link": "https://chinamediaproject.org/2026/02/09/tokens-of-ai-bias/",
    "description": "This section collects opinion pieces from across the world commenting on the harms caused by the activities of the Chinese Communist Party and provides insight into the various solutions that experts and leaders suggest we pursue to protect our interests.",
    "pubDate": "2026-02-15T00:00:00Z",
    "source": "Chinamediaproject.org",
    "sourceUrl": "https://chinamediaproject.org/2026/02/09/tokens-of-ai-bias/",
    "category": "climate",
    "author": "February 15, 2026",
    "positivityScore": 4
  },
  {
    "title": "Emails Show Epstein Scheming That Environmental Destruction Could Solve “Overpopulation”",
    "link": "http://futurism.com/science-energy/epstein-climate-change-population",
    "description": "\"The earths forest fire. potentially a good thing for the species.\"\nThe post Emails Show Epstein Scheming That Environmental Destruction Could Solve “Overpopulation” appeared first on Futurism.",
    "pubDate": "2026-02-15T13:15:00Z",
    "source": "Futurism",
    "sourceUrl": "http://futurism.com/science-energy/epstein-climate-change-population",
    "category": "climate",
    "author": "Joe Wilkins",
    "positivityScore": 4
  },
  {
    "title": "New Energy Storage Solutions Are Killing Trump’s Coal Power Fantasy",
    "link": "https://cleantechnica.com/2026/02/14/new-energy-storage-solutions-are-killing-trumps-coal-power-fantasy/",
    "description": "The greedy, grasping, living cartoon of a Scrooge who currently occupies the White House is leveraging coal power to support his plans for killing as many Americans as possible. Hopefully he will leave office again — peacefully, this time — before doing much …",
    "pubDate": "2026-02-14T20:17:42Z",
    "source": "CleanTechnica",
    "sourceUrl": "https://cleantechnica.com/2026/02/14/new-energy-storage-solutions-are-killing-trumps-coal-power-fantasy/",
    "category": "climate",
    "author": "Tina Casey",
    "positivityScore": 4
  },
  {
    "title": "Rural drivers to face steepest bills under UK’s mileage-based electric vehicle tax",
    "link": "https://www.theguardian.com/environment/2026/feb/16/rural-drivers-uk-mileage-electric-vehicle-tax-labour",
    "description": "Analysis reveals big regional disparities as critics say Labour’s proposed levy could slow uptake of EVs\nDrivers in the south-west of England would pay nearly four times as much as those in London as a result of Labour’s mileage-based tax on electric cars, according to analysis of official data.\nThe 3p-a-mile road charge, announced in the autumn budget and due to take effect in 2028, is expected to raise £1.1bn a year, partly offsetting the loss of fuel duty revenues as drivers switch from petrol to electric vehicles.\n Continue reading...",
    "pubDate": "Mon, 16 Feb 2026 07:13:08 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/16/rural-drivers-uk-mileage-electric-vehicle-tax-labour",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Microplastics have reached Antarctica’s only native insect",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "description": "Even Antarctica’s toughest native insect can’t escape the reach of plastic pollution. Scientists have discovered that Belgica antarctica — a tiny, rice-sized midge and the southernmost insect on Earth — is already ingesting microplastics in the wild. While lab tests showed the hardy larvae can survive short-term exposure without obvious harm, those exposed to higher plastic levels had reduced fat reserves, hinting at hidden energy costs.",
    "pubDate": "Mon, 16 Feb 2026 07:48:45 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Yellowstone wolves may not have transformed the national park after all",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "description": "A new scientific review challenges the headline-grabbing claim that Yellowstone’s returning wolves triggered one of the strongest trophic cascades on Earth. Researchers found that the reported 1,500% surge in willow growth was based on circular calculations and questionable comparisons. After correcting for modeling and sampling flaws, the supposed ecosystem-wide boom largely disappears.",
    "pubDate": "Thu, 12 Feb 2026 08:51:03 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Scientists discover pets are helping an invasive flatworm spread",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210231550.htm",
    "description": "A new study shows that dogs and cats may be helping an invasive flatworm spread. Researchers analyzing over a decade of reports discovered the worm attached to pet fur. Its sticky mucus and ability to reproduce alone make it highly adaptable. Pets could be giving this slow-moving invader a major boost.",
    "pubDate": "Sat, 14 Feb 2026 09:34:47 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210231550.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Brain inflammation may be driving compulsive behavior",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215225606.htm",
    "description": "For years, compulsive behaviors have been viewed as bad habits stuck on autopilot. But new research in rats found the opposite: inflammation in a key decision-making brain region actually made behavior more deliberate, not more automatic. The change was linked to astrocytes, brain support cells that multiplied and disrupted nearby circuits. The discovery hints that some compulsive behaviors may arise from excessive, misdirected control rather than a loss of it.",
    "pubDate": "Mon, 16 Feb 2026 07:32:28 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215225606.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "One in three people carry this brain parasite but the body has a kill switch",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215225602.htm",
    "description": "A parasite that may already be hiding in your brain has a shocking survival trick: it can infect the very immune cells sent to destroy it. Yet most people never get sick, and new research from UVA Health reveals why. Scientists discovered that when Toxoplasma gondii invades CD8+ T cells — key defenders of the immune system — those cells can trigger a self-destruct mechanism powered by an enzyme called caspase-8. By sacrificing themselves, the infected cells also wipe out the parasite inside them.",
    "pubDate": "Mon, 16 Feb 2026 08:33:46 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215225602.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Large study finds no link between mRNA COVID vaccine in pregnancy and autism",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215085001.htm",
    "description": "Researchers tracked more than 400 toddlers to see whether mRNA COVID-19 vaccination during or just before pregnancy was linked to autism or developmental delays. After detailed assessments of speech, motor skills, behavior, and social development, they found no meaningful differences between vaccinated and unvaccinated groups. Experts say the results provide strong reassurance about vaccine safety in pregnancy.",
    "pubDate": "Sun, 15 Feb 2026 09:51:05 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215085001.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "How some COVID vaccines triggered rare blood-clot disorder",
    "link": "https://www.nature.com/articles/d41586-026-00457-4",
    "description": "",
    "pubDate": "2026-02-12T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00457-4",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Are wetter winters and frequent flooding here to stay?",
    "link": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "description": "Many places across the UK have experienced their wettest January in more than 100 years.",
    "pubDate": "Wed, 11 Feb 2026 02:59:08 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Landmark deal to cut global shipping emissions in tatters after US pressure",
    "link": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "description": "President Trump intervened in the talks calling the deal a \"green scam\".",
    "pubDate": "Fri, 17 Oct 2025 16:31:07 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Humans Have a Third Set of Teeth, New Medicine May Help Them Grow",
    "link": "https://www.popularmechanics.com/science/health/a70366090/humans-have-third-set-of-teeth-new-medicine/",
    "description": "A study out of Japan showed how targeting genes can regrow teeth in animals. Now, the team has turned to a human clinical trial.",
    "pubDate": "2026-02-15T12:47:30Z",
    "source": "Popular Mechanics",
    "sourceUrl": "https://www.popularmechanics.com/science/health/a70366090/humans-have-third-set-of-teeth-new-medicine/",
    "category": "science",
    "author": "Tim Newcomb",
    "positivityScore": 2
  },
  {
    "title": "Meet the American spies who helped mammograms save more lives",
    "link": "https://fortune.com/2026/02/15/breast-cancer-american-spies-missiles-to-mammograms/",
    "description": "To help fight breast cancer, a public-health expert recruited the spies whose top-secret work helped find hidden Russian missile bases.",
    "pubDate": "2026-02-15T13:30:00Z",
    "source": "Fortune",
    "sourceUrl": "https://fortune.com/2026/02/15/breast-cancer-american-spies-missiles-to-mammograms/",
    "category": "health",
    "author": "Erik German",
    "positivityScore": 2
  },
  {
    "title": "What happened to James Van Der Beek? #entertainment",
    "link": "https://alltoc.com/entertainment/what-happened-to-james-van-der-beek",
    "description": "The immediate facts and the response James Van Der Beek died at 48 after a multi year battle with colorectal cancer. The actor’s passing touched off an outpouring of tributes from colleagues, fans, and peers who remembered him both for his breakthrough role a…",
    "pubDate": "2026-02-15T04:05:14Z",
    "source": "Alltoc.com",
    "sourceUrl": "https://alltoc.com/entertainment/what-happened-to-james-van-der-beek",
    "category": "health",
    "author": "AllToc",
    "positivityScore": 2
  },
  {
    "title": "Bruce Springsteen – Tower Theater, Upper Darby, PA 12/31/1975 [50th Anniversary Edition] (2025)",
    "link": "https://exystence.net/blog/2026/02/14/bruce-springsteen-tower-theater-upper-darby-pa-12-31-1975-50th-anniversary-edition-2025/",
    "description": "2025 mix by Jon Altschiller. As we enter 2026, who could have imagined the Bruce Springsteen Live Archive series would be entering its twelfth year? The first show in the series, Apollo Theater, March 9, 2012, was released in November 2014; remarkably, 100 mo…",
    "pubDate": "2026-02-14T22:45:12Z",
    "source": "Exystence.net",
    "sourceUrl": "https://exystence.net/blog/2026/02/14/bruce-springsteen-tower-theater-upper-darby-pa-12-31-1975-50th-anniversary-edition-2025/",
    "category": "health",
    "author": "exy",
    "positivityScore": 2
  },
  {
    "title": "Sun Pharma: What should investors do?",
    "link": "https://www.thehindubusinessline.com/portfolio/stock-fundamental-analysis-india/sun-pharma-what-should-investors-do/article70628796.ece",
    "description": "Explore Sun Pharma's strong portfolio, innovative launches, and investment potential amidst market volatility for long-term growth.",
    "pubDate": "2026-02-14T15:48:29Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/portfolio/stock-fundamental-analysis-india/sun-pharma-what-should-investors-do/article70628796.ece",
    "category": "health",
    "author": "Sai Prabhakar",
    "positivityScore": 2
  },
  {
    "title": "UPSC Key: Seva Teerth, BNP wins Bangladesh elections, and New CPI",
    "link": "https://indianexpress.com/article/upsc-current-affairs/upsc-key-seva-teerth-pmo-bnp-wins-bangladesh-elections-new-cpi-10532308/",
    "description": "What is the importance of India hosting the AI Impact Summit 2026 for your UPSC exam? What significance do topics such as the India-USA relationship, AI Impact Summit, and new CPI have for both the Preliminary and Main exams? You can learn more by reading The…",
    "pubDate": "2026-02-14T12:33:46Z",
    "source": "The Indian Express",
    "sourceUrl": "https://indianexpress.com/article/upsc-current-affairs/upsc-key-seva-teerth-pmo-bnp-wins-bangladesh-elections-new-cpi-10532308/",
    "category": "health",
    "author": "Khushboo Kumari",
    "positivityScore": 2
  },
  {
    "title": "ランドリン ボタニカル 液体 柔軟剤 特大容量 リラックスグリーンティー 詰め替え 3倍サイズ 1290ml オーガニック",
    "link": "https://www.amazon.co.jp/-/en/Laundrin-Botanical-Softener-Capacity-Relaxing/dp/B099RGKMNY",
    "description": "Amazon.co.jp: Laundrin, Botanical Liquid Fabric Softener, Extra Large Capacity, Relaxing Green Tea, Refill, 3x Size, 48.2 fl oz (1,290 ml) : Health & Personal Care",
    "pubDate": "2026-02-15T06:35:00Z",
    "source": "Amazon.co.jp",
    "sourceUrl": "https://www.amazon.co.jp/-/en/Laundrin-Botanical-Softener-Capacity-Relaxing/dp/B099RGKMNY",
    "category": "health",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "7 Herbal teas that may boost sleep, digestion, immunity and overall wellness",
    "link": "https://www.naturalnews.com/2026-02-15-herbal-teas-boost-sleep-digestion-immunity-wellness.html",
    "description": "Herbal teas differ from green, black and oolong teas because they are not made from the Camellia sinensis plant but from dried fruits, flowers, roots and herbs. Most are naturally caffeine-free and used for specific wellness goals. Ginger and peppermint teas …",
    "pubDate": "2026-02-15T06:00:00Z",
    "source": "Naturalnews.com",
    "sourceUrl": "https://www.naturalnews.com/2026-02-15-herbal-teas-boost-sleep-digestion-immunity-wellness.html",
    "category": "health",
    "author": "Laura Harris",
    "positivityScore": 2
  },
  {
    "title": "India adds record over 52 GW power capacity in FY26",
    "link": "https://www.thehindubusinessline.com/companies/india-adds-record-over-52-gw-power-capacity-in-fy26/article70635637.ece",
    "description": "India sets a record by adding over 52 GW of power capacity in FY26, reaching 520,510.95 MW total capacity.",
    "pubDate": "2026-02-15T14:07:21Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/companies/india-adds-record-over-52-gw-power-capacity-in-fy26/article70635637.ece",
    "category": "climate",
    "author": "BL New Delhi Bureau",
    "positivityScore": 2
  },
  {
    "title": "Power generation capacity addition crosses 50 GW during Apr-Jan period",
    "link": "https://www.business-standard.com/industry/news/power-generation-capacity-addition-crosses-50-gw-during-apr-jan-period-126021500409_1.html",
    "description": "India's power generation capacity addition from all energy sources has crossed record the 50 GW-mark during April-January period in the ongoing fiscal year, according to an official statement.\nThis marks the highest-ever capacity addition in a single year, su…",
    "pubDate": "2026-02-15T12:01:59Z",
    "source": "Business Standard",
    "sourceUrl": "https://www.business-standard.com/industry/news/power-generation-capacity-addition-crosses-50-gw-during-apr-jan-period-126021500409_1.html",
    "category": "climate",
    "author": "Press Trust of India",
    "positivityScore": 2
  },
  {
    "title": "Forrest launches battery-powered trains as green deadline nears",
    "link": "https://www.abc.net.au/news/2026-02-15/fortescue-battery-electric-locomotives-pilbara/106022632",
    "description": "After years of delays, the Pilbara's largest carbon emitters are testing greener ways to haul iron ore, and Andrew Forrest has now joined their ranks.",
    "pubDate": "2026-02-14T23:00:03Z",
    "source": "ABC News (AU)",
    "sourceUrl": "https://www.abc.net.au/news/2026-02-15/fortescue-battery-electric-locomotives-pilbara/106022632",
    "category": "climate",
    "author": "Alistair Bates",
    "positivityScore": 2
  },
  {
    "title": "The great fitness mistake most of us make – and the simple solution that works",
    "link": "https://www.the-independent.com/health-and-fitness/biggest-fitness-mistakes-solution-easy-exercise-b2920018.html",
    "description": "In the latest Well Enough newsletter, Harry Bullmore talks to celebrity trainer Monique Alexander, who works with stars like Anne Hathaway, about why “all or nothing” approaches to exercise and food backfire – and how small, consistent actions lead to real re…",
    "pubDate": "2026-02-15T08:00:00Z",
    "source": "The-independent.com",
    "sourceUrl": "https://www.the-independent.com/health-and-fitness/biggest-fitness-mistakes-solution-easy-exercise-b2920018.html",
    "category": "climate",
    "author": "Harry Bullmore",
    "positivityScore": 2
  },
  {
    "title": "At what age do black bear cubs leave their mother?",
    "link": "https://www.lifesciencesworld.com/at-what-age-do-black-bear-cubs-leave-their-mother/",
    "description": "At What Age Do Black Bear Cubs Say Goodbye? Understanding Cub Independence Black bear cubs typically leave their mother in the spring of their second year, around 16-18 months old, after denning with her for a second winter. This crucial period allows cubs to…",
    "pubDate": "2026-02-15T07:05:33Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/at-what-age-do-black-bear-cubs-leave-their-mother/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Hard work, clear goals, discipline essential for success in life: Chief Justice of India Surya Kant",
    "link": "https://economictimes.indiatimes.com/news/india/hard-work-clear-goals-discipline-essential-for-success-in-life-chief-justice-of-india-surya-kant/articleshow/128373175.cms",
    "description": "During Maharshi Dayanand University's 50th anniversary, Chief Justice Surya Kant inspired attendees with his insights on achieving success. He urged the importance of having well-defined goals, coupled with hard work, discipline, and determination. Justice Ka…",
    "pubDate": "2026-02-15T06:02:52Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/india/hard-work-clear-goals-discipline-essential-for-success-in-life-chief-justice-of-india-surya-kant/articleshow/128373175.cms",
    "category": "wildlife",
    "author": "PTI",
    "positivityScore": 2
  },
  {
    "title": "Do catfish like flowing water?",
    "link": "https://www.lifesciencesworld.com/do-catfish-like-flowing-water/",
    "description": "Do Catfish Prefer Flowing Water Habitats? Unveiling Their Aquatic Preferences Do catfish like flowing water? Yes, many catfish species show a clear preference for moving water, using the current to their advantage for feeding and navigation. Understanding thi…",
    "pubDate": "2026-02-15T05:48:26Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/do-catfish-like-flowing-water/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Why do they throw the fish back?",
    "link": "https://www.lifesciencesworld.com/why-do-they-throw-the-fish-back/",
    "description": "Why Do They Throw the Fish Back? The Curious Case of Catch and Release Why do they throw the fish back? The act of releasing a caught fish, known as catch and release, is a conservation practice implemented to maintain healthy fish populations and ensure sust…",
    "pubDate": "2026-02-15T04:58:43Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/why-do-they-throw-the-fish-back/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "What is the lifespan of a molly fish in an aquarium?",
    "link": "https://www.lifesciencesworld.com/what-is-the-lifespan-of-a-molly-fish-in-an-aquarium/",
    "description": "What is the Lifespan of a Molly Fish in an Aquarium? The average lifespan of a healthy molly fish in a well-maintained aquarium is typically 3 to 5 years. Understanding factors influencing their longevity is crucial for ensuring a thriving aquatic environment…",
    "pubDate": "2026-02-15T03:27:36Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-is-the-lifespan-of-a-molly-fish-in-an-aquarium/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "A billionaire and an A-list actor found refuge in a 37-home Florida neighborhood with armed guards—proof that privacy is now the ultimate luxury",
    "link": "https://fortune.com/article/billionaires-florida-trophy-properties-mark-wahlberg-russell-weiner-real-estate-stone-creek-ranch/",
    "description": "The neighborhood includes guarded entrances and 24/7 security made up of armed ex-military and police, saving its rich residents money on protection.",
    "pubDate": "2026-02-15T12:40:49Z",
    "source": "Fortune",
    "sourceUrl": "https://fortune.com/article/billionaires-florida-trophy-properties-mark-wahlberg-russell-weiner-real-estate-stone-creek-ranch/",
    "category": "wildlife",
    "author": "Marco Quiroz-Gutierrez",
    "positivityScore": 2
  },
  {
    "title": "Indonesia takes emergency steps to save Mahakam dolphin",
    "link": "https://en.antaranews.com/news/404658/indonesia-takes-emergency-steps-to-save-mahakam-dolphin",
    "description": "The declining population of the Mahakam dolphin (Orcaella brevirostris), which lives in the Mahakam River, East Kalimantan, has been a concern for the ...",
    "pubDate": "2026-02-15T11:11:55Z",
    "source": "Antaranews.com",
    "sourceUrl": "https://en.antaranews.com/news/404658/indonesia-takes-emergency-steps-to-save-mahakam-dolphin",
    "category": "wildlife",
    "author": "Yashinta Difa Pramudyani",
    "positivityScore": 2
  },
  {
    "title": "Do flying squirrels carry babies?",
    "link": "https://www.lifesciencesworld.com/do-flying-squirrels-carry-babies/",
    "description": "Do Flying Squirrels Carry Babies? A Deep Dive into Gliding Parenthood Yes, flying squirrels do carry their babies. They specifically carry them in a secure pouch or by clinging to their mother’s fur until they are old enough to venture out on their own. Under…",
    "pubDate": "2026-02-15T07:17:38Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/do-flying-squirrels-carry-babies/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Olympic curling controversy takes aim at Canada",
    "link": "https://www.cbc.ca/sports/olympics/winter/curling/olympic-mens-curling-controversy-canada-9.7091098",
    "description": "Controversy is swirling in curling at the Winter Olympics and it's all centring on whether the mighty Canadian team is cheating. Both men's and women's teams have now been accused of the same infraction: double-touching the curling stone after it is released.",
    "pubDate": "2026-02-15T12:10:52Z",
    "source": "CBC News",
    "sourceUrl": "https://www.cbc.ca/sports/olympics/winter/curling/olympic-mens-curling-controversy-canada-9.7091098",
    "category": "people",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "The Qld farm putting troubled youth on the straight and narrow",
    "link": "https://www.abc.net.au/news/2026-02-15/woodstock-farm-program-helping-youth-avoid-life-of-crime/106337320",
    "description": "The rural-based social program in the shadow of Mt Tamborine has had remarkable success in rebuilding the lives of youth who have fallen through the cracks.",
    "pubDate": "2026-02-14T21:04:47Z",
    "source": "ABC News (AU)",
    "sourceUrl": "https://www.abc.net.au/news/2026-02-15/woodstock-farm-program-helping-youth-avoid-life-of-crime/106337320",
    "category": "people",
    "author": "Tobi Loftus",
    "positivityScore": 2
  },
  {
    "title": "Good News in History, February 14",
    "link": "https://www.goodnewsnetwork.org/events070214/",
    "description": "95 years ago today, the horror film Dracula starring Bela Lugosi was released. Adapted from the 1897 novel by Bram Stoker, it’s a tale of Count Dracula, a vampire who emigrates from Transylvania to England and preys upon the blood of living victims. WATCH his reaction to being shown a crucifix… (1931) Directed and co-produced […]\nThe post Good News in History, February 14 appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070214/",
    "category": "general",
    "positivityScore": -3
  }
]