[
  {
    "title": "Billionaire Tom Kaplan Auctions Rare Rembrandt Lion Drawing for $18M to Help Save the Animal it Depicts",
    "link": "https://www.goodnewsnetwork.org/billionaire-tom-kaplan-auctions-rare-rembrandt-lion-drawing-for-18m-to-help-save-the-animal-it-depicts/",
    "description": "Yesterday, Sotheby’s oversaw the record $18 million sale of a drawing by Rembrandt: one of 6 drafts he made of lions, and the only one to have resided in private hands. Those hands belong to Dr. Thomas S. Kaplan and his wife, who along with standing foremost among the world’s private Rembrandt collectors, ride in […]\nThe post Billionaire Tom Kaplan Auctions Rare Rembrandt Lion Drawing for $18M to Help Save the Animal it Depicts appeared first on Good News Network.",
    "pubDate": "Thu, 05 Feb 2026 14:00:42 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/billionaire-tom-kaplan-auctions-rare-rembrandt-lion-drawing-for-18m-to-help-save-the-animal-it-depicts/",
    "category": "general",
    "positivityScore": 13
  },
  {
    "title": "Here’s why US household energy bills are soaring – and how to fix it | Mark Wolfe",
    "link": "https://www.theguardian.com/commentisfree/2026/feb/03/us-energy-bills-trump",
    "description": "Trump has prioritized fossil fuel companies over consumers, hitting the lowest-income families hardest\nDonald Trump promised to cut energy prices by 50%. Instead, average electricity prices over the past year have risen by about 6.7%, while natural gas prices have increased by 10.8%. Energy prices are influenced by many factors beyond any president’s direct control, including market conditions, weather-driven demand, regional infrastructure constraints and the rapid growth of energy-intensive datacenters that are driving new system costs. Policy choices do not determine prices on their own, but they do shape market outcomes, and the direction of this administration’s energy policy has been clear.\nFrom his first days in office, President Trump made clear that his energy agenda would prioritize fossil fuel producers over consumers. His administration moved to expand US liquefied natural gas exports, increasing exposure to volatile global markets. At the same time, it froze wind power projects that provide some of the cheapest new electricity, intervened to keep costly coal plants running, and backed the elimination of energy-efficiency tax credits that lower household energy bills.\nMark Wolfe is executive director of National Energy Assistance Directors Association, co-director of the Center on Energy Poverty and Climate and adjunct faculty at the Trachtenberg School of Public Policy at George Washington University\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 15:00:02 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/commentisfree/2026/feb/03/us-energy-bills-trump",
    "category": "climate",
    "positivityScore": 12
  },
  {
    "title": "Green energy sector drove more than 90% of China’s investment growth last year, analysis finds",
    "link": "https://www.theguardian.com/world/2026/feb/05/china-green-energy-sector-investment-growth",
    "description": "Industry bigger than all but seven world economies, and accounts for more than third of China’s economic growth\nChina’s clean energy industries drove more than 90% of the country’s investment growth last year, making the sectors bigger than all but seven of the world’s economies, a new analysis has shown.\nFor the second time in three years, the report showed the manufacture, installation and export of batteries, electric cars, solar, wind and related technologies accounted for more than a third of China’s economic growth.\n Continue reading...",
    "pubDate": "Thu, 05 Feb 2026 00:01:14 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2026/feb/05/china-green-energy-sector-investment-growth",
    "category": "climate",
    "positivityScore": 12
  },
  {
    "title": "Shear comfort, the sheep helping people unload their worries",
    "link": "https://www.positive.news/lifestyle/health/shear-comfort-the-sheep-helping-people-unload-their-worries/",
    "description": "A Yorkshire therapist has discovered her intuitive flock of sheep has an unexpected route to emotional healing\nThe post Shear comfort, the sheep helping people unload their worries appeared first on Positive News.",
    "pubDate": "Tue, 03 Feb 2026 07:00:51 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/lifestyle/health/shear-comfort-the-sheep-helping-people-unload-their-worries/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Jaguars Recorded Meowing for the First Time Ever (LISTEN)",
    "link": "https://www.goodnewsnetwork.org/jaguars-recorded-meowing-for-the-first-time-ever-listen/",
    "description": "While searching for their cubs, the females of the world’s third-largest feline will make a sound that’s strikingly similar to what you’ve heard your own cat make. Weighing in excess of 300 lbs., the jaguar is a ferocious predator that can take large caiman and even cattle, but recent video camera trap footage has revealed […]\nThe post Jaguars Recorded Meowing for the First Time Ever (LISTEN) appeared first on Good News Network.",
    "pubDate": "Wed, 04 Feb 2026 16:30:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/jaguars-recorded-meowing-for-the-first-time-ever-listen/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Record Harvest Dubbed the ‘Potato Flood’ and Prompts Mass Spud Giveaways Across Berlin",
    "link": "https://www.goodnewsnetwork.org/record-harvest-dubbed-the-potato-flood-and-prompts-mass-spud-giveaways-across-berlin/",
    "description": "From Germany comes the story of mountains of potatoes as far as the eye can see going to feed anyone and everyone in Berlin and nearby towns. For German potato farmers, the early winter potato harvest has been a bumper crop—no, a banner crop—nay, it’s a full-on food-bank-buster crop. The “potato flood” as it’s being […]\nThe post Record Harvest Dubbed the ‘Potato Flood’ and Prompts Mass Spud Giveaways Across Berlin appeared first on Good News Network.",
    "pubDate": "Wed, 04 Feb 2026 14:00:24 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/record-harvest-dubbed-the-potato-flood-and-prompts-mass-spud-giveaways-across-berlin/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "How Denmark is inviting visitors to rediscover analogue play",
    "link": "https://www.positive.news/lifestyle/culture/how-denmark-is-inviting-visitors-to-rediscover-analogue-play/",
    "description": "In the birthplace of Lego and Hans Christian Andersen, Denmark invites visitors to rediscover play as an antidote to digital overload\nThe post How Denmark is inviting visitors to rediscover analogue play appeared first on Positive News.",
    "pubDate": "Wed, 04 Feb 2026 07:00:13 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/lifestyle/culture/how-denmark-is-inviting-visitors-to-rediscover-analogue-play/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "A field of wheat becomes the world’s largest living photograph",
    "link": "https://www.positive.news/environment/a-field-of-wheat-becomes-the-worlds-largest-living-photograph/",
    "description": "Farming Photographs will see a field divided into ‘pixels’ of different wheats to grow a photographic-style artwork\nThe post A field of wheat becomes the world’s largest living photograph appeared first on Positive News.",
    "pubDate": "Mon, 02 Feb 2026 07:00:13 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/environment/a-field-of-wheat-becomes-the-worlds-largest-living-photograph/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "NASA Webb Pushes Boundaries of Observable Universe Closer to Big Bang",
    "link": "https://www.goodnewsnetwork.org/nasa-webb-pushes-boundaries-of-observable-universe-closer-to-big-bang/",
    "description": "NASA’s James Webb Space Telescope has topped itself once again, delivering the confirmation of a bright galaxy that existed a mere 280 million years after the Big Bang; so close to the beginning of the universe as we understand. GNN reported on the last such discovery, a galaxy 300 million years after, and scientists are […]\nThe post NASA Webb Pushes Boundaries of Observable Universe Closer to Big Bang appeared first on Good News Network.",
    "pubDate": "Wed, 04 Feb 2026 19:30:06 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/nasa-webb-pushes-boundaries-of-observable-universe-closer-to-big-bang/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 4",
    "link": "https://www.goodnewsnetwork.org/events070204/",
    "description": "Happy 53rd Birthday to Oscar De La Hoya, nicknamed the “Golden Boy of Boxing,” and winner of many world titles at lightweight, super lightweight, welterweight, and middleweight. De La Hoya had won 17 title bouts, either for claiming belts or retaining them, before he tasted the first defeat of his career, a reign of dominance […]\nThe post Good News in History, February 4 appeared first on Good News Network.",
    "pubDate": "Wed, 04 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070204/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 3",
    "link": "https://www.goodnewsnetwork.org/events070203/",
    "description": "40 years ago today, a group of computer animators started Pixar Animation Studios out of a corporate spin-off from Lucasfilm. Pixar would go on to make their first film Toy Story, 9 years later, and over the following 20 years become the most critically admired animation studio in the world. After being turned down 45 […]\nThe post Good News in History, February 3 appeared first on Good News Network.",
    "pubDate": "Tue, 03 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070203/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Astonishing 1,400-year-old Tomb Featuring Giant Owl Sculpture Discovered in Mexico",
    "link": "https://www.goodnewsnetwork.org/astonishing-1400-year-old-tomb-featuring-giant-owl-sculpture-discovered-in-mexico/",
    "description": "It’s being called the most significant archaeological discovery in a decade: a tomb dating back 1,400 years decorated with murals and carvings of exquisite preservation. Belonging to one of Mexico’s non-Mayan native cultures, the Zapotecs, its most striking feature is a frieze of an enormous owl head, with a man’s face trapped in its beak. […]\nThe post Astonishing 1,400-year-old Tomb Featuring Giant Owl Sculpture Discovered in Mexico appeared first on Good News Network.",
    "pubDate": "Mon, 02 Feb 2026 12:00:51 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/astonishing-1400-year-old-tomb-featuring-giant-owl-sculpture-discovered-in-mexico/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Kentucky’s Rural and Urban Communities Unite over Climate Change",
    "link": "https://reasonstobecheerful.world/kentucky-communities-unite-over-climate-change/",
    "description": "This story was originally published by Next City, a nonprofit newsroom reporting on solutions for equitable and just cities, and The CivicLex Weekly, a newsroom covering local government in Lexington, Kentucky. Two myths tend to shape how people talk about Kentucky and climate change. One is that the state is a “climate...\nThe post Kentucky’s Rural and Urban Communities Unite over Climate Change appeared first on Reasons to be Cheerful.",
    "pubDate": "Tue, 27 Jan 2026 16:03:38 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/kentucky-communities-unite-over-climate-change/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Government rolls back nature protections to boost housing",
    "link": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "description": "Critics say government changes to a flagship biodiversity policy could stall nature recovery.",
    "pubDate": "Tue, 16 Dec 2025 17:51:04 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 8
  },
  {
    "title": "Wind farms provided a third of Ireland’s electricity in record 2025 but 13pc went to waste",
    "link": "https://www.independent.ie/irish-news/wind-farms-provided-a-third-of-irelands-electricity-in-record-2025-but-13pc-went-to-waste/a374771883.html",
    "description": "Increased wind energy production helped push down wholesale electricity prices from to €108.48 per megawatt hour (MWh) in December compared to €136.99 per megawatt hour 12 months previously, a new report reveals.",
    "pubDate": "2026-02-04T14:11:28Z",
    "source": "Independent.ie",
    "sourceUrl": "https://www.independent.ie/irish-news/wind-farms-provided-a-third-of-irelands-electricity-in-record-2025-but-13pc-went-to-waste/a374771883.html",
    "category": "climate",
    "author": "Eavan Murray",
    "positivityScore": 8
  },
  {
    "title": "We tried to buy nothing new for the whole of January. Here’s how we got on",
    "link": "https://www.positive.news/lifestyle/we-tried-to-buy-nothing-new-for-the-whole-of-january-heres-how-we-got-on/",
    "description": "Our team rose to the challenge of Buy Nothing New Month. Some fared better than others. This is what we learned taking part\nThe post We tried to buy nothing new for the whole of January. Here’s how we got on appeared first on Positive News.",
    "pubDate": "Wed, 04 Feb 2026 13:00:25 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/lifestyle/we-tried-to-buy-nothing-new-for-the-whole-of-january-heres-how-we-got-on/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "‘We just have to stop doing bad things and do good things’",
    "link": "https://www.positive.news/lifestyle/arts/we-just-have-to-stop-doing-bad-things-and-do-good-things/",
    "description": "Acclaimed novelist Ian McEwan argues that the future is still very much in our hands\nThe post ‘We just have to stop doing bad things and do good things’ appeared first on Positive News.",
    "pubDate": "Wed, 28 Jan 2026 13:30:02 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/lifestyle/arts/we-just-have-to-stop-doing-bad-things-and-do-good-things/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Behind the scenes of the first Positive News video podcast",
    "link": "https://www.positive.news/economics/good-business/behind-the-scenes-of-the-purpose-pioneers-podcast/",
    "description": "What it took to turn an idea into a podcast, and the conversations that emerged along the way\nThe post Behind the scenes of the first Positive News video podcast appeared first on Positive News.",
    "pubDate": "Tue, 27 Jan 2026 11:24:33 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/economics/good-business/behind-the-scenes-of-the-purpose-pioneers-podcast/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "New anthology rewrites the story of homelessness",
    "link": "https://www.positive.news/society/new-anthology-rewrites-the-story-of-homelessness/",
    "description": "Writers with experience of homelessness share tales of overcoming adversity in a new book\nThe post New anthology rewrites the story of homelessness appeared first on Positive News.",
    "pubDate": "Mon, 26 Jan 2026 21:21:57 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/new-anthology-rewrites-the-story-of-homelessness/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Life after: a terminal diagnosis",
    "link": "https://www.positive.news/society/life-after-a-terminal-diagnosis/",
    "description": "Faced with a terminal diagnosis, 27-year-old sailor Jazz Turner now plans to sail unassisted around the world\nThe post Life after: a terminal diagnosis appeared first on Positive News.",
    "pubDate": "Fri, 23 Jan 2026 14:37:12 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/life-after-a-terminal-diagnosis/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Moss Spores Riding on the Outside of the Space Station Survive For 9 Months",
    "link": "https://www.goodnewsnetwork.org/moss-spores-riding-on-the-outside-of-the-space-station-survive-for-9-months/",
    "description": "The reproductive spores of a moss species were able to somehow survive the vacuum of space during a 9-month stint outside the International Space Station. In the immortal words of Jeff Goldblum, life, uh, finds a way. Physcomitrella patens is known as a hardy pioneer species of spreading moss that readily cultivates on muddy ground. Scientists […]\nThe post Moss Spores Riding on the Outside of the Space Station Survive For 9 Months appeared first on Good News Network.",
    "pubDate": "Thu, 05 Feb 2026 12:00:46 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/moss-spores-riding-on-the-outside-of-the-space-station-survive-for-9-months/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 2",
    "link": "https://www.goodnewsnetwork.org/events070202/",
    "description": "150 years ago today, the National League of Professional Baseball Clubs was formed. The older of the two leagues that make up Major League Baseball (MLB) in the US and Canada, it is the oldest professional team sports league still in existence in the world. The American League was founded 25 years later and after […]\nThe post Good News in History, February 2 appeared first on Good News Network.",
    "pubDate": "Mon, 02 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070202/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Teens Build Igloo That Brings Together the Neighborhood After Difficult Ice Storm – LOOK",
    "link": "https://www.goodnewsnetwork.org/teens-build-igloo-that-brings-the-community-together-after-ice-storm/",
    "description": "While millions of Americans hunkered down in their homes after ice storms encrusted the mid-Atlantic, two young teens got busy building community spirit—by building an igloo. They constructed their igloo in front of a house that was destroyed by a house fire a few months ago. Adeline Sutich and her friend Maeve Ritchotte carved dozens […]\nThe post Teens Build Igloo That Brings Together the Neighborhood After Difficult Ice Storm – LOOK appeared first on Good News Network.",
    "pubDate": "Sun, 01 Feb 2026 21:46:11 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/teens-build-igloo-that-brings-the-community-together-after-ice-storm/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "A Coal Town Reborn",
    "link": "https://reasonstobecheerful.world/france-coal-town-reborn-loos-en-gohelle/",
    "description": "As the sun rises over Loos-en-Gohelle, its yellow rays gradually illuminate two great mounds on the edge of the former mining town. These hulking slag heaps, relics of the past, were created by what was once one of the largest coal mining regions in Europe. But while the industry vanished...\nThe post A Coal Town Reborn appeared first on Reasons to be Cheerful.",
    "pubDate": "Thu, 05 Feb 2026 08:00:55 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/france-coal-town-reborn-loos-en-gohelle/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "What We’re Reading: The Country Legalizing Half a Million Undocumented Migrants",
    "link": "https://reasonstobecheerful.world/what-were-reading-spain-legalizes-undocumented-migrants/",
    "description": "Welcome back to our weekly behind-the-scenes glimpse at what’s getting our team talking. Tell us what you’ve been reading at info@reasonstobecheerful.world and we just might feature it here. Recognition and respect Spain’s socialist-led coalition government has announced a plan to legalize the status of undocumented migrants, a measure expected to...\nThe post What We’re Reading: The Country Legalizing Half a Million Undocumented Migrants appeared first on Reasons to be Cheerful.",
    "pubDate": "Wed, 04 Feb 2026 16:39:14 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/what-were-reading-spain-legalizes-undocumented-migrants/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Spark: How To Protest",
    "link": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "description": "Welcome back to The Spark, our monthly celebration of how people just like you are creating positive change, one meaningful step at a time. The Spark is generously supported by Laura Rice. Sign up to Reasons to be Cheerful’s weekly newsletter here and you’ll get The Spark in your inbox...\nThe post The Spark: How To Protest appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 02 Feb 2026 14:05:22 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Affordable Daycare That Keeps Parents Close",
    "link": "https://reasonstobecheerful.world/little-break-coworking-space-on-site-child-care-michigan/",
    "description": "Saja Khuder was set to return to her job with a pharmaceutical firm after maternity leave. At the last minute, her child care plans fell through. Chase Mateusiak, a bioinformatician, was using a daycare that was “fine” but expensive — and which left his 18-month-old son “exhausted and unhappy” after...\nThe post The Affordable Daycare That Keeps Parents Close appeared first on Reasons to be Cheerful.",
    "pubDate": "Thu, 29 Jan 2026 08:00:43 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/little-break-coworking-space-on-site-child-care-michigan/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Scientists discover hidden deep-Earth structures shaping the magnetic field",
    "link": "https://www.sciencedaily.com/releases/2026/02/260205050039.htm",
    "description": "Deep inside Earth, two massive hot rock structures have been quietly shaping the planet’s magnetic field for millions of years. Using ancient magnetic records and advanced simulations, scientists discovered that these formations influence the movement of liquid iron in Earth’s core. Some parts of the magnetic field remained stable over vast stretches of time, while others changed dramatically.",
    "pubDate": "Thu, 05 Feb 2026 05:53:59 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260205050039.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "Air ambulance teams are changing who survives critical injuries",
    "link": "https://www.sciencedaily.com/releases/2026/02/260205025026.htm",
    "description": "Advanced care provided by air ambulance teams was linked to higher survival rates in major trauma patients. Researchers found that more people survived than predicted by standard models, including many with severe injuries and low chances of survival. Younger patients and those more responsive at first assessment benefited most. Outcomes for traumatic cardiac arrest also improved steadily over the study period.",
    "pubDate": "Thu, 05 Feb 2026 02:56:53 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260205025026.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "UK launches plan to tackle 'forever chemicals' amid growing concerns",
    "link": "https://www.bbc.com/news/articles/cz9vz249keno?at_medium=RSS&at_campaign=rss",
    "description": "Increasing testing for PFAS is part of the UK's first ever national plan for tackling the substances.",
    "pubDate": "Tue, 03 Feb 2026 00:06:49 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cz9vz249keno?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 6
  },
  {
    "title": "Access to innovative treatments: The real work starts now",
    "link": "https://www.politico.eu/sponsored-content/access-to-innovative-treatments-the-real-work-starts-now/",
    "description": "The UK has historically been a global leader in life sciences innovation, but recent statistics paint a worrying picture for medicines access. The right policy can start to reverse this. We are living in a time where the intersection between breakthrough scie…",
    "pubDate": "2026-02-03T14:15:22Z",
    "source": "POLITICO.eu",
    "sourceUrl": "https://www.politico.eu/sponsored-content/access-to-innovative-treatments-the-real-work-starts-now/",
    "category": "science",
    "author": "Roz Bekker, managing director UK and Ireland, Johnson & Johnson Innovative Medicine",
    "positivityScore": 6
  },
  {
    "title": "Novartis delivered high single-digit sales growth, achieved 40% core margin and further advanced the pipeline in 2025",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3231748/0/en/Novartis-delivered-high-single-digit-sales-growth-achieved-40-core-margin-and-further-advanced-the-pipeline-in-2025.html",
    "description": "Ad hoc announcement pursuant to Art. 53 LR                      Full year            Net sales grew +8% (cc1, +8% USD) with core operating income1 up +14%...",
    "pubDate": "2026-02-04T06:00:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3231748/0/en/Novartis-delivered-high-single-digit-sales-growth-achieved-40-core-margin-and-further-advanced-the-pipeline-in-2025.html",
    "category": "health",
    "author": "Novartis Pharma  AG",
    "positivityScore": 6
  },
  {
    "title": "Design as a Long-Term Capability: How Geekvape and Geek Bar Drive Systematic Innovation in the Global Design Ecosystem",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3231728/0/en/Design-as-a-Long-Term-Capability-How-Geekvape-and-Geek-Bar-Drive-Systematic-Innovation-in-the-Global-Design-Ecosystem.html",
    "description": "Shenzhen, China, Feb. 04, 2026 (GLOBE NEWSWIRE) -- In 2025, Geekvape and Geek Bar achieved a major breakthrough on the global design stage, driven by years of deep investment in design capability and systematic innovation. Together, the two brands won a total…",
    "pubDate": "2026-02-04T05:01:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3231728/0/en/Design-as-a-Long-Term-Capability-How-Geekvape-and-Geek-Bar-Drive-Systematic-Innovation-in-the-Global-Design-Ecosystem.html",
    "category": "health",
    "author": "Geekvape",
    "positivityScore": 6
  },
  {
    "title": "OPKO Health and Entera Bio Expand Partnership to Advance First-in-Class Oral Long Acting PTH Tablet for Patients with Hypoparathyroidism",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3231955/0/en/OPKO-Health-and-Entera-Bio-Expand-Partnership-to-Advance-First-in-Class-Oral-Long-Acting-PTH-Tablet-for-Patients-with-Hypoparathyroidism.html",
    "description": "This is the third program that successfully combines Entera’s oral peptide N-Tab® platform with OPKO’s advanced protein chemistry capabilities  The...",
    "pubDate": "2026-02-04T13:00:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3231955/0/en/OPKO-Health-and-Entera-Bio-Expand-Partnership-to-Advance-First-in-Class-Oral-Long-Acting-PTH-Tablet-for-Patients-with-Hypoparathyroidism.html",
    "category": "health",
    "author": "Entera Bio",
    "positivityScore": 6
  },
  {
    "title": "Saudi Arabia’s $2 Billion Solar Plan Lifts Turkish Energy Stocks",
    "link": "https://financialpost.com/pmn/business-pmn/saudi-arabias-2-billion-solar-plan-lifts-turkish-energy-stocks",
    "description": "Saudi Arabia will invest around $2 billion to build solar power plants in Turkey, in the first stage of a broader renewable-energy deal between the countries. Turkish energy stocks rose on the news.",
    "pubDate": "2026-02-04T14:21:46Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/pmn/business-pmn/saudi-arabias-2-billion-solar-plan-lifts-turkish-energy-stocks",
    "category": "climate",
    "author": "Bloomberg News",
    "positivityScore": 6
  },
  {
    "title": "Clean energy funding to be tied to stronger workers’ rights",
    "link": "https://www.gov.uk/government/news/clean-energy-funding-to-be-tied-to-stronger-workers-rights",
    "description": "Offshore wind firms must sign up to a ‘Fair Work Charter’ to participate in government renewables auctions.",
    "pubDate": "2026-02-04T13:30:28Z",
    "source": "Www.gov.uk",
    "sourceUrl": "https://www.gov.uk/government/news/clean-energy-funding-to-be-tied-to-stronger-workers-rights",
    "category": "climate",
    "author": "Department for Energy Security and Net Zero",
    "positivityScore": 6
  },
  {
    "title": "Gstar’s Solar Module Series First to Achieve India’s New BIS Certification",
    "link": "https://www.thehindubusinessline.com/brandhub/pr-release/gstars-solar-module-series-first-to-achieve-indias-new-bis-certification/article70591628.ece",
    "description": "Gstar’s Solar Module Series First to Achieve India’s New BIS Certification",
    "pubDate": "2026-02-04T12:18:53Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/brandhub/pr-release/gstars-solar-module-series-first-to-achieve-indias-new-bis-certification/article70591628.ece",
    "category": "climate",
    "author": null,
    "positivityScore": 6
  },
  {
    "title": "The Global Power Sector Faces a Reckoning in 2026",
    "link": "https://oilprice.com/Energy/Energy-General/The-Global-Power-Sector-Faces-a-Reckoning-in-2026.html",
    "description": "The global power sector is at a turning point in 2026. Electricity demand growth continues to accelerate, driven by an electrification push across all sectors and booming demand from data centers and transportation. At the same time, renewable energy capacity…",
    "pubDate": "2026-02-03T17:00:00Z",
    "source": "OilPrice.com",
    "sourceUrl": "https://oilprice.com/Energy/Energy-General/The-Global-Power-Sector-Faces-a-Reckoning-in-2026.html",
    "category": "climate",
    "author": "OilPrice.com",
    "positivityScore": 6
  },
  {
    "title": "IEX shares in focus after record power volume in January. Check details",
    "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-in-focus-after-record-power-volume-in-january-check-details/articleshow/127899378.cms",
    "description": "Indian Energy Exchange shares will be in focus on February 4 after the exchange posted its highest-ever monthly electricity traded volume in January 2026, up nearly 20% YoY. Higher power availability from renewables and coal lowered market prices, boosted liq…",
    "pubDate": "2026-02-04T04:02:38Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-in-focus-after-record-power-volume-in-january-check-details/articleshow/127899378.cms",
    "category": "climate",
    "author": "ETMarkets.com",
    "positivityScore": 6
  },
  {
    "title": "Mexico moves to combat pollution following Guardian investigations",
    "link": "https://www.theguardian.com/us-news/2026/feb/01/mexico-moves-to-combat-pollution-following-guardian-investigations",
    "description": "After stories revealed high levels of contamination in neighborhood around factory processing US toxic waste, government announces sweeping array of tactics\nThe Mexican government has announced it will pursue a sweeping array of tactics to combat industrial pollution, from $4.8m in fines against a plant processing US hazardous waste to the rollout of a new industrial air-monitoring system, following investigations by the Guardian and Quinto Elemento Lab, a Mexican investigative unit.\nThose stories revealed high levels of heavy-metal contamination in the neighborhood around the factory, Zinc Nacional, in the Monterrey metropolitan area, and showed the broader extent of industrial pollution in the region, linked to Monterrey’s role in manufacturing and recycling goods for the US market.\n Continue reading...",
    "pubDate": "Sun, 01 Feb 2026 17:08:27 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2026/feb/01/mexico-moves-to-combat-pollution-following-guardian-investigations",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Mexico factory that imports US toxic waste to relocate after Guardian report",
    "link": "https://www.theguardian.com/us-news/2025/may/03/mexico-zinc-nacional-factory-hazardous-waste-relocation",
    "description": "Zinc Nacional will move ‘most polluting’ operations after joint investigation found heavy-metals pollution in area\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nA factory processing US hazardous waste in Mexico has promised to relocate what authorities call its “most polluting” operations following a Guardian investigation.\nThe plant in the Monterrey metropolitan area recycles toxic steel dust sent by the US steel industry and recovers zinc, according to that reporting, which was produced in partnership with Quinto Elemento Lab, a Mexico investigative journalism unit. It revealed evidence of heavy-metals pollution in the surrounding neighborhoods.\n Continue reading...",
    "pubDate": "Sat, 03 May 2025 15:00:41 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2025/may/03/mexico-zinc-nacional-factory-hazardous-waste-relocation",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Melting Antarctic ice may weaken a major carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "description": "Melting ice from West Antarctica once delivered huge amounts of iron to the Southern Ocean, but algae growth did not increase as expected. Researchers found the iron was in a form that marine life could not easily use. This means more melting ice does not automatically boost carbon absorption. In the future, Antarctic ice loss could actually reduce the ocean’s ability to slow climate change.",
    "pubDate": "Wed, 04 Feb 2026 04:32:51 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Baby dinosaurs were the backbone of the Jurassic food chain",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201223727.htm",
    "description": "Despite growing into the largest animals ever to walk on land, sauropods began life small, exposed, and alone. Fossil evidence suggests their babies were frequently eaten by multiple predators, making them a key part of the Jurassic food chain. This steady supply of easy prey may explain why early predators thrived without needing extreme hunting adaptations. The findings offer a rare glimpse into how dinosaur ecosystems truly worked.",
    "pubDate": "Sun, 01 Feb 2026 22:50:10 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201223727.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Rare rocks beneath Australia reveal the origins of a critical metal",
    "link": "https://www.sciencedaily.com/releases/2026/01/260122074028.htm",
    "description": "Rare rocks buried deep in central Australia have revealed how a valuable niobium deposit formed during the breakup of an ancient supercontinent. More than 800 million years ago, tectonic rifting opened pathways that allowed metal-rich magma to rise from the mantle. These unusual rocks contain niobium, a key ingredient in high-strength steel, electric vehicles, and emerging energy technologies. The discovery offers fresh insight into how some of Earth’s most important mineral resources reach the surface.",
    "pubDate": "Fri, 23 Jan 2026 07:07:44 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260122074028.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "New nasal vaccine shows strong protection against H5N1 bird flu",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204114343.htm",
    "description": "As bird flu continues to circulate in animals and spill over into humans, researchers are racing to stop it before it adapts to spread widely between people. A new nasal spray vaccine showed strong protection against H5N1 in animal tests, outperforming traditional flu shots. Because it targets the nose and lungs, it may prevent infection at the earliest stage.",
    "pubDate": "Wed, 04 Feb 2026 11:43:43 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204114343.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "The hidden health impact of growing up with ADHD traits",
    "link": "https://www.sciencedaily.com/releases/2026/01/260124073920.htm",
    "description": "A large, decades-long study suggests that signs of ADHD in childhood may have consequences that extend well beyond school and behavior. Researchers followed nearly 11,000 people from childhood into midlife and found that those with strong ADHD traits at age 10 were more likely to experience multiple physical health problems and health-related disability by their mid-40s.",
    "pubDate": "Sat, 24 Jan 2026 07:39:20 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260124073920.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "‘Life was busy and full then everything stopped’, says mum-of-four diagnosed with cancer",
    "link": "https://www.irishtimes.com/health/2026/02/04/i-kept-telling-myself-that-it-would-pass-cancer-research-makes-a-huge-difference/",
    "description": "Clinical progress made over the past few years marks hopeful development",
    "pubDate": "2026-02-04T06:00:01Z",
    "source": "The Irish Times",
    "sourceUrl": "https://www.irishtimes.com/health/2026/02/04/i-kept-telling-myself-that-it-would-pass-cancer-research-makes-a-huge-difference/",
    "category": "science",
    "author": "Arlene Harris",
    "positivityScore": 4
  },
  {
    "title": "TIAN RUIXIANG Unveils Groundbreaking Artificial Intelligence Initiative with Top Insurance Firms, expecting USD 4 billion revenue increment at 300% growth annually to Redefine Enterprise Innovation Across insurance broker industry",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3232163/0/en/TIAN-RUIXIANG-Unveils-Groundbreaking-Artificial-Intelligence-Initiative-with-Top-Insurance-Firms-expecting-USD-4-billion-revenue-increment-at-300-growth-annually-to-Redefine-Enterp.html",
    "description": "Beijing, Feb. 04, 2026 (GLOBE NEWSWIRE) -- Tian Ruixiang Holdings Limited (“Tianruixiang” or the “Company”) (NASDAQ: TIRX), today announced the launch of its highly-anticipated Artificial Intelligence (“AI”) Strategic Initiative—a transformative, multi-billio…",
    "pubDate": "2026-02-04T14:15:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3232163/0/en/TIAN-RUIXIANG-Unveils-Groundbreaking-Artificial-Intelligence-Initiative-with-Top-Insurance-Firms-expecting-USD-4-billion-revenue-increment-at-300-growth-annually-to-Redefine-Enterp.html",
    "category": "health",
    "author": "Tian Ruixiang Holdings Ltd.",
    "positivityScore": 4
  },
  {
    "title": "Reliance Global Group Announces Strategic Launch of Scale51 Operating Model Through EZRA International Group",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3232045/0/en/Reliance-Global-Group-Announces-Strategic-Launch-of-Scale51-Operating-Model-Through-EZRA-International-Group.html",
    "description": "Company Outlines Next Phase of Growth Focused on Control Acquisitions Designed to Scale Breakthrough Technology Platforms Company Outlines Next Phase of Growth Focused on Control Acquisitions Designed to Scale Breakthrough Technology Platforms",
    "pubDate": "2026-02-04T13:30:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3232045/0/en/Reliance-Global-Group-Announces-Strategic-Launch-of-Scale51-Operating-Model-Through-EZRA-International-Group.html",
    "category": "health",
    "author": "Reliance Global Group, Inc.",
    "positivityScore": 4
  },
  {
    "title": "Veru to Report Fiscal 2026 First Quarter Financial Results on February 11th",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3232036/11676/en/Veru-to-Report-Fiscal-2026-First-Quarter-Financial-Results-on-February-11th.html",
    "description": "MIAMI, FL, Feb. 04, 2026 (GLOBE NEWSWIRE) -- Veru Inc. (NASDAQ: VERU), a late clinical stage biopharmaceutical company focused on developing innovative medicines for the treatment of cardiometabolic and inflammatory diseases, today announced it will host a co…",
    "pubDate": "2026-02-04T13:30:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3232036/11676/en/Veru-to-Report-Fiscal-2026-First-Quarter-Financial-Results-on-February-11th.html",
    "category": "health",
    "author": "Veru Inc.",
    "positivityScore": 4
  },
  {
    "title": "Wind farms provided a third of country's power in 2025",
    "link": "https://www.rte.ie/news/business/2026/0204/1556685-wind-energy-ireland-annual-report/",
    "description": "New figures published today show that Irish wind farms provided a third of the island of Ireland's electricity in 2025.",
    "pubDate": "2026-02-04T09:54:09Z",
    "source": "RTE",
    "sourceUrl": "https://www.rte.ie/news/business/2026/0204/1556685-wind-energy-ireland-annual-report/",
    "category": "climate",
    "author": "RTÉ News",
    "positivityScore": 4
  },
  {
    "title": "Japan’s unprecedented project could test the limits of deep-sea mining",
    "link": "https://grist.org/international/japans-unprecedented-project-could-test-the-limits-of-deep-sea-mining/",
    "description": "Japan is spending five weeks mining the sea floor. It is a technological milestone — and a stress test for how nations balance geopolitics, clean energy demand, and environmental risk.",
    "pubDate": "2026-02-03T09:45:00Z",
    "source": "Grist",
    "sourceUrl": "https://grist.org/international/japans-unprecedented-project-could-test-the-limits-of-deep-sea-mining/",
    "category": "climate",
    "author": "Rachel Ramirez",
    "positivityScore": 4
  },
  {
    "title": "Inside the polarizing plan to stash carbon in a California wetland",
    "link": "https://grist.org/solutions/inside-the-polarizing-plan-to-stash-carbon-in-a-california-wetland/",
    "description": "A proposal to store carbon dioxide deep below a restored Bay Area wetland is testing how — and where — California pursues climate solutions.",
    "pubDate": "2026-02-04T09:30:00Z",
    "source": "Grist",
    "sourceUrl": "https://grist.org/solutions/inside-the-polarizing-plan-to-stash-carbon-in-a-california-wetland/",
    "category": "wildlife",
    "author": "Miranda de Moraes",
    "positivityScore": 4
  },
  {
    "title": "How did the mongoose save the baby?",
    "link": "https://www.lifesciencesworld.com/how-did-the-mongoose-save-the-baby/",
    "description": "How the Mongoose Saved the Baby: A Tale of Instinct and Protection This article explores the astonishing scenarios of how the mongoose saved the baby, providing a comprehensive understanding of their protective behaviors and challenging common misconceptions …",
    "pubDate": "2026-02-03T01:59:01Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-did-the-mongoose-save-the-baby/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "Hamas hails reopening of Rafah crossing as big gain",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260202-presstv01.htm",
    "description": "Hamas has hailed the reopening of the Rafah crossing in southern Gaza Strip as a significant achievement of Palestinian resilience, pledging to make every effort to restore the vital crossing to full operation.",
    "pubDate": "2026-02-02T10:06:25Z",
    "source": "Globalsecurity.org",
    "sourceUrl": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260202-presstv01.htm",
    "category": "people",
    "author": "John Pike",
    "positivityScore": 4
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "One of Earth’s most abundant lifeforms has a fatal flaw",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201231205.htm",
    "description": "SAR11 bacteria dominate the world’s oceans by being incredibly efficient, shedding genes to survive in nutrient-poor waters. But that extreme streamlining appears to backfire when conditions change. Under stress, many cells keep copying their DNA without dividing, creating abnormal cells that grow large and die. This vulnerability may explain why SAR11 populations drop during phytoplankton blooms and could become more important as oceans grow less stable.",
    "pubDate": "Mon, 02 Feb 2026 09:21:36 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201231205.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Forty years of forest data reveal a changing Amazon",
    "link": "https://www.sciencedaily.com/releases/2026/01/260125081133.htm",
    "description": "After analyzing 40 years of tree records across the Andes and Amazon, researchers found that climate change is reshaping tropical forests in uneven ways. Some regions are steadily losing tree species, especially where conditions are hotter and drier, while others are seeing gains. Rainfall patterns turned out to be just as important as rising temperatures.",
    "pubDate": "Sun, 25 Jan 2026 08:27:34 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260125081133.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Microplastics are undermining the ocean’s power to absorb carbon",
    "link": "https://www.sciencedaily.com/releases/2026/01/260116035322.htm",
    "description": "Tiny plastic particles drifting through the oceans may be quietly weakening one of Earth’s most powerful climate defenses. New research suggests microplastics are disrupting marine life that helps oceans absorb carbon dioxide, while also releasing greenhouse gases as they break down. By interfering with plankton, microbes, and natural carbon cycles, these pollutants reduce the ocean’s ability to regulate global temperatures.",
    "pubDate": "Sat, 17 Jan 2026 21:58:02 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260116035322.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Sound machines might be making your sleep worse",
    "link": "https://www.sciencedaily.com/releases/2026/02/260203030529.htm",
    "description": "Sound machines may not be the sleep saviors many believe. Researchers found that pink noise significantly reduced REM sleep, while simple earplugs did a better job protecting deep, restorative sleep from traffic noise. When pink noise was combined with outside noise, sleep quality dropped even further. The results suggest that popular “sleep sounds” could be doing more harm than good—particularly for kids.",
    "pubDate": "Wed, 04 Feb 2026 00:58:14 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260203030529.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "A silent brain disease can quadruple dementia risk",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201223732.htm",
    "description": "Researchers studying nearly 2 million older adults found that cerebral amyloid angiopathy sharply raises the risk of developing dementia. Within five years, people with the condition were far more likely to be diagnosed than those without it. The increased risk was present even without a history of stroke. Experts say this makes early screening for memory and thinking changes especially important.",
    "pubDate": "Sun, 01 Feb 2026 23:08:47 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201223732.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Middle age is becoming a breaking point in the U.S.",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201062457.htm",
    "description": "Middle age is becoming a tougher chapter for many Americans, especially those born in the 1960s and early 1970s. Compared with earlier generations, they report more loneliness and depression, along with weaker physical strength and declining memory. These troubling trends stand out internationally, as similar declines are largely absent in other wealthy nations, particularly in Nordic Europe, where midlife well-being has improved.",
    "pubDate": "Sun, 01 Feb 2026 10:25:53 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201062457.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Two-month-old babies are already making sense of the world",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204114144.htm",
    "description": "At just two months old, babies are already organizing the world in their minds. Brain scans revealed distinct patterns as infants looked at pictures of animals, toys, and everyday objects, showing early category recognition. Scientists used AI to help decode these patterns, offering a rare glimpse into infant thinking. The results suggest babies begin learning and understanding far sooner than expected.",
    "pubDate": "Thu, 05 Feb 2026 00:14:20 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204114144.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "The fat you can’t see could be shrinking your brain",
    "link": "https://www.sciencedaily.com/releases/2026/01/260127112127.htm",
    "description": "Where your body stores fat may matter just as much as how much you carry—especially for your brain. Using advanced MRI scans and data from nearly 26,000 people, researchers identified two surprising fat patterns tied to faster brain aging, cognitive decline, and higher neurological disease risk. One involves unusually high fat buildup in the pancreas, even without much liver fat, while the other—often called “skinny fat”—affects people who don’t appear severely obese but carry excess fat relative to muscle.",
    "pubDate": "Wed, 28 Jan 2026 07:33:30 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260127112127.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "A common parasite in the brain is far more active than we thought",
    "link": "https://www.sciencedaily.com/releases/2026/01/260127112124.htm",
    "description": "A common parasite long thought to lie dormant is actually much more active and complex. Researchers found that Toxoplasma gondii cysts contain multiple parasite subtypes, not just one sleeping form. Some are primed to reactivate and cause disease, which helps explain why infections are so hard to treat. The discovery could reshape efforts to develop drugs that finally eliminate the parasite for good.",
    "pubDate": "Tue, 27 Jan 2026 23:11:20 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260127112124.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Atlas-guided discovery of transcription factors for T cell programming",
    "link": "https://www.nature.com/articles/s41586-025-09989-7",
    "description": "",
    "pubDate": "2026-02-04T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/s41586-025-09989-7",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Discovery Learning predicts battery cycle life from minimal experiments",
    "link": "https://www.nature.com/articles/s41586-025-09951-7",
    "description": "",
    "pubDate": "2026-02-04T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/s41586-025-09951-7",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "What are critical minerals and why do countries need them?",
    "link": "https://www.bbc.com/news/articles/cj6wwx7zxd9o?at_medium=RSS&at_campaign=rss",
    "description": "Countries are racing to secure the critical minerals and rare earths needed to make vital products.",
    "pubDate": "Thu, 05 Feb 2026 13:22:13 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cj6wwx7zxd9o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Spain's commitment to renewable energy may be in doubt",
    "link": "https://www.bbc.com/news/articles/cn410nll79po?at_medium=RSS&at_campaign=rss",
    "description": "The current government is politically weakened and the opposition wants more use of fossil fuels.",
    "pubDate": "Mon, 15 Dec 2025 00:02:06 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cn410nll79po?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Landmark deal to cut global shipping emissions in tatters after US pressure",
    "link": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "description": "President Trump intervened in the talks calling the deal a \"green scam\".",
    "pubDate": "Fri, 17 Oct 2025 16:31:07 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Biodegradation of polyethylene terephthalate microplastics by Paenibacillus naphthalenovorans PETKKU2: Response surface optimization and genomic evidence for an alternative degradation mechanism",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0341623",
    "description": "This study establishes Paenibacillus naphthalenovorans PETKKU2, isolated from landfill soil in Thailand, as the first reported member of this species capable of degrading polyethylene terephthalate microplastics (PET-MP). Initial screening identified PETKKU2 …",
    "pubDate": "2026-02-04T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0341623",
    "category": "science",
    "author": "Aophat Choonut, Nantharat Wongfaed, Auraiwan Poolpol, Sophon Boonlue, Kitirote Wantala, Onruthai Pinyakong, Pensri Plangklang, Alissara Reungsang",
    "positivityScore": 2
  },
  {
    "title": "Dassault and Nvidia partner to build industrial AI platform",
    "link": "https://siliconangle.com/2026/02/03/dassault-nvidia-partner-build-industrial-ai-platform/",
    "description": "Dassault Systèmes SA and Nvidia Corp. today announced a long-term strategic partnership aimed at creating a shared industrial artificial intelligence platform that combines science-based virtual twins with large-scale AI infrastructure to support applications…",
    "pubDate": "2026-02-03T16:00:54Z",
    "source": "SiliconANGLE News",
    "sourceUrl": "https://siliconangle.com/2026/02/03/dassault-nvidia-partner-build-industrial-ai-platform/",
    "category": "science",
    "author": "Paul Gillin",
    "positivityScore": 2
  },
  {
    "title": "Spur Therapeutics Presents New Phase 1/2 Data on Its Gene Therapy Candidate in Gaucher Disease at 22nd Annual WORLDSymposium™",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3231939/0/en/Spur-Therapeutics-Presents-New-Phase-1-2-Data-on-Its-Gene-Therapy-Candidate-in-Gaucher-Disease-at-22nd-Annual-WORLDSymposium.html",
    "description": "Spur Therapeutics Presents New Phase 1/2 Data on Its Gene Therapy Candidate in Gaucher Disease at 22nd Annual WORLDSymposium\n...",
    "pubDate": "2026-02-04T12:30:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3231939/0/en/Spur-Therapeutics-Presents-New-Phase-1-2-Data-on-Its-Gene-Therapy-Candidate-in-Gaucher-Disease-at-22nd-Annual-WORLDSymposium.html",
    "category": "health",
    "author": "Spur Therapeutics",
    "positivityScore": 2
  },
  {
    "title": "Zinc helps regenerate your aging immune system’s command center",
    "link": "https://www.naturalnews.com/2026-02-04-zinc-helps-regenerate-aging-immune-systems-command-center.html",
    "description": "Zinc is a critical mineral for immune function, directly supporting antibody production, T-cell activity and thymus gland health. Deficiency in zinc, common with age, leads to a shrunken thymus, reduced T-cell output and increased susceptibility to infections…",
    "pubDate": "2026-02-04T06:00:00Z",
    "source": "Naturalnews.com",
    "sourceUrl": "https://www.naturalnews.com/2026-02-04-zinc-helps-regenerate-aging-immune-systems-command-center.html",
    "category": "health",
    "author": "Willow Tohi",
    "positivityScore": 2
  },
  {
    "title": "CERo Therapeutics to Present Late-Breaking Oral Poster Session Highlighting Interim Phase 1 Data from CERTAIN-T Trial Highlighting Platelet Transfusion Independence in a High-Risk MDS/AML Patient",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3232151/0/en/CERo-Therapeutics-to-Present-Late-Breaking-Oral-Poster-Session-Highlighting-Interim-Phase-1-Data-from-CERTAIN-T-Trial-Highlighting-Platelet-Transfusion-Independence-in-a-High-Risk-.html",
    "description": "Poster to be presented at Tandem Meeting of the American Society of Transplantation and Cellular Therapy (ASTCT) and the Center for International Blood and Marrow Transplant Research (CIBMTR) on February 5, 2026",
    "pubDate": "2026-02-04T14:05:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3232151/0/en/CERo-Therapeutics-to-Present-Late-Breaking-Oral-Poster-Session-Highlighting-Interim-Phase-1-Data-from-CERTAIN-T-Trial-Highlighting-Platelet-Transfusion-Independence-in-a-High-Risk-.html",
    "category": "health",
    "author": "CERo Therapeutics Holdings, Inc.",
    "positivityScore": 2
  },
  {
    "title": "Investigating the effect of augmented reality-based virtual patient training on occupational therapy students’ clinical decision-making: A quasi-experimental study",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340759",
    "description": "Technology-enhanced education is an essential element of modern universities, improving clinical decision-making, and student performance. This study aimed to design and evaluate an augmented reality-based virtual patient (VPAR) educational model to enhance c…",
    "pubDate": "2026-02-04T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340759",
    "category": "health",
    "author": "Farshid Chahartangi, Nahid Zarifsanaiey, Manoosh Mehrabi, Bahareh Zeynalzadeh Ghoochani, Nahid Sharifzadeh",
    "positivityScore": 2
  },
  {
    "title": "RenovoRx Announces Clinical Data Supporting the TAMP™ Therapy Platform will be Presented at the SIO 2026 Annual Scientific Meeting",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3232046/0/en/RenovoRx-Announces-Clinical-Data-Supporting-the-TAMP-Therapy-Platform-will-be-Presented-at-the-SIO-2026-Annual-Scientific-Meeting.html",
    "description": "Results Support TAMP’s Novel Approach to Targeted, Pressure-Mediated Chemotherapeutic Delivery and Reinforces its Potential to Provide Individualized, Optimized Drug-Delivery Results Support TAMP’s Novel Approach to Targeted, Pressure-Mediated Chemotherapeuti…",
    "pubDate": "2026-02-04T13:30:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3232046/0/en/RenovoRx-Announces-Clinical-Data-Supporting-the-TAMP-Therapy-Platform-will-be-Presented-at-the-SIO-2026-Annual-Scientific-Meeting.html",
    "category": "health",
    "author": "RenovoRx, Inc.",
    "positivityScore": 2
  },
  {
    "title": "How to Get Health Cover From Ksh4,600 a Year on WhatsApp",
    "link": "https://www.kenyans.co.ke/featured/120466-how-get-health-cover-ksh4600-year-whatsapp",
    "description": "You can get the cover in under 10 minutes, all on WhatsApp, via simple and direct prompts, which saves on time and creates comfort and convenience.",
    "pubDate": "2026-02-04T13:12:44Z",
    "source": "Kenyans.co.ke",
    "sourceUrl": "https://www.kenyans.co.ke/featured/120466-how-get-health-cover-ksh4600-year-whatsapp",
    "category": "health",
    "author": "Samuel Mwanawanjuguna",
    "positivityScore": 2
  },
  {
    "title": "Balt’s Squid™ Liquid Embolic Receives FDA Approval for Adjunctive Treatment for Patients with Chronic Subdural Hematomas",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3232016/0/en/Balt-s-Squid-Liquid-Embolic-Receives-FDA-Approval-for-Adjunctive-Treatment-for-Patients-with-Chronic-Subdural-Hematomas.html",
    "description": "BOSTON, Feb. 04, 2026 (GLOBE NEWSWIRE) -- Balt, Inc., a global technology leader in neurovascular devices, today announced the Premarket Approval (PMA) of the Squid™ liquid embolic agent. Squid is approved for the embolization of the middle meningeal artery (…",
    "pubDate": "2026-02-04T13:01:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3232016/0/en/Balt-s-Squid-Liquid-Embolic-Receives-FDA-Approval-for-Adjunctive-Treatment-for-Patients-with-Chronic-Subdural-Hematomas.html",
    "category": "health",
    "author": "Balt Group",
    "positivityScore": 2
  },
  {
    "title": "Talk to your donors, not to yourself, to inspire action",
    "link": "https://futurefundraisingnow.com/2026/02/talk-to-your-donors-not-to-yourself-to-inspire-action/",
    "description": "Here’s an envelope that showed up in my mail the other day. I like that the teaser is personalized to the donor’s first name. Nice touch. But on the whole, the teaser is not the kind of thing anyone should be sending. I suspect that “redefine cancer for the n…",
    "pubDate": "2026-02-04T13:15:00Z",
    "source": "Futurefundraisingnow.com",
    "sourceUrl": "https://futurefundraisingnow.com/2026/02/talk-to-your-donors-not-to-yourself-to-inspire-action/",
    "category": "health",
    "author": "Jeff Brooks",
    "positivityScore": 2
  },
  {
    "title": "How W.E.B. DuBois and James McCune Smith Helped Combat Medical Racism in America",
    "link": "https://lithub.com/how-w-e-b-dubois-and-james-mccune-smith-helped-combat-medical-racism-in-america/",
    "description": "The most prominent of Du Bois’s intellectual influences was James McCune Smith. Brilliant and uncompromising, Smith was a public intellectual with the distinction of being the United States’ first university-trained Black doctor. In 1846, in a stinging and ex…",
    "pubDate": "2026-02-04T09:58:49Z",
    "source": "Lithub.com",
    "sourceUrl": "https://lithub.com/how-w-e-b-dubois-and-james-mccune-smith-helped-combat-medical-racism-in-america/",
    "category": "health",
    "author": "Michelle A. Williams",
    "positivityScore": 2
  },
  {
    "title": "Does Melafix work on mouth rot?",
    "link": "https://www.lifesciencesworld.com/does-melafix-work-on-mouth-rot/",
    "description": "Does Melafix Work on Mouth Rot: Separating Fact from Fiction While Melafix is often touted as a cure-all for fish ailments, its efficacy against mouth rot, a serious bacterial infection, is highly questionable and potentially harmful, making it an unreliable …",
    "pubDate": "2026-02-04T07:37:25Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/does-melafix-work-on-mouth-rot/",
    "category": "health",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Do squirrels bother bat houses?",
    "link": "https://www.lifesciencesworld.com/do-squirrels-bother-bat-houses/",
    "description": "Do Squirrels Bother Bat Houses?: Preventing Unwanted Occupants Squirrels can indeed cause problems for bats using bat houses. Learn how to deter squirrels and ensure your bat house provides a safe and welcoming habitat for its intended winged residents. Under…",
    "pubDate": "2026-02-04T07:11:58Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/do-squirrels-bother-bat-houses/",
    "category": "health",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Norwegian skier hands IOC a petition to 'ski fossil free' ahead of the Olympics",
    "link": "https://abcnews.go.com/Business/wireStory/norwegian-skier-hands-ioc-petition-ski-fossil-free-129841065",
    "description": "Norwegian skier Nikolai Schirmer has handed the International Olympic Committee a petition signed by more than 21,000 people who want to stop fossil fuel companies from bolstering their reputations by sponsoring winter sports",
    "pubDate": "2026-02-04T11:49:22Z",
    "source": "ABC News",
    "sourceUrl": "https://abcnews.go.com/Business/wireStory/norwegian-skier-hands-ioc-petition-ski-fossil-free-129841065",
    "category": "climate",
    "author": "JENNIFER MCDERMOTT Associated Press, FERNANDA FIGUEROA Associated Press",
    "positivityScore": 2
  },
  {
    "title": "India Data Center Market to Reach Over US$ 31.36 Billion by 2035 Driven by Generative AI, 5G Rollout, and Cloud Infrastructure Growth | Astute Analytica",
    "link": "https://www.globenewswire.com/news-release/2026/02/04/3231872/0/en/India-Data-Center-Market-to-Reach-Over-US-31-36-Billion-by-2035-Driven-by-Generative-AI-5G-Rollout-and-Cloud-Infrastructure-Growth-Astute-Analytica.html",
    "description": "India’s data center market is entering a high-growth phase, driven by explosive AI adoption, hyperscale cloud expansion, and nationwide digital transformation initiatives. Rapid capacity additions, rising investments from domestic conglomerates and global ope…",
    "pubDate": "2026-02-04T11:40:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/04/3231872/0/en/India-Data-Center-Market-to-Reach-Over-US-31-36-Billion-by-2035-Driven-by-Generative-AI-5G-Rollout-and-Cloud-Infrastructure-Growth-Astute-Analytica.html",
    "category": "climate",
    "author": "AstuteAnalytica India Pvt. Ltd.",
    "positivityScore": 2
  },
  {
    "title": "Copper Slips as Rising Stockpiles Put Focus Back on Soft Demand",
    "link": "https://financialpost.com/pmn/business-pmn/copper-slips-as-rising-stockpiles-put-focus-back-on-soft-demand",
    "description": "Copper slipped after its biggest one-day advance in more than three years, with investors shifting their focus back to the outlook for Chinese demand after a wild ride for the key industrial metal.",
    "pubDate": "2026-02-04T10:51:29Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/pmn/business-pmn/copper-slips-as-rising-stockpiles-put-focus-back-on-soft-demand",
    "category": "climate",
    "author": "Bloomberg News",
    "positivityScore": 2
  },
  {
    "title": "45 Symbols—Clay to Code: Translating Complex Ideas into Visual Identity",
    "link": "https://weandthecolor.com/45-symbols-clay-to-code-translating-complex-ideas-into-visual-identity/208037",
    "description": "45 Symbols—Clay to Code represents a massive shift in design pedagogy and visual anthropology. We often struggle to find meaning in random visual noise. Slanted Publishers provides a solution with this January 2026 release. It connects the 3,700-year-old Phai…",
    "pubDate": "2026-02-04T10:47:11Z",
    "source": "Weandthecolor.com",
    "sourceUrl": "https://weandthecolor.com/45-symbols-clay-to-code-translating-complex-ideas-into-visual-identity/208037",
    "category": "climate",
    "author": "Dirk Petzold",
    "positivityScore": 2
  },
  {
    "title": "It’s One of the Most Enduring Myths About Wine. You Probably Believe It. The Real Story Is Weirder.",
    "link": "https://slate.com/life/2026/02/red-wine-white-alcohol-sideways-effect-movie.html",
    "description": "Did a tiny movie really brainwash wine drinkers forever?",
    "pubDate": "2026-02-04T10:40:00Z",
    "source": "Slate Magazine",
    "sourceUrl": "https://slate.com/life/2026/02/red-wine-white-alcohol-sideways-effect-movie.html",
    "category": "climate",
    "author": "Willa Paskin",
    "positivityScore": 2
  },
  {
    "title": "Tata Power Q3 profit flat at ₹1,194 crore despite revenue dip",
    "link": "https://www.thehindubusinessline.com/markets/stock-markets/tata-power-q3-profit-flat-at-1194-crore-despite-revenue-dip/article70591779.ece",
    "description": "The renewable energy business emerged as a strong performer with profit surging 156 per cent to ₹547 crore in the quarter",
    "pubDate": "2026-02-04T13:04:05Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/markets/stock-markets/tata-power-q3-profit-flat-at-1194-crore-despite-revenue-dip/article70591779.ece",
    "category": "climate",
    "author": "Anupama Ghosh",
    "positivityScore": 2
  },
  {
    "title": "SpaceX Acquires xAI: Elon Musk’s Vision to Put AI in Orbit",
    "link": "https://www.androidheadlines.com/2026/02/spacex-acquires-xai-space-data-centers.html",
    "description": "Elon Musk's SpaceX has officially acquired xAI with the goal of building the first-ever network of AI data centers in space.",
    "pubDate": "2026-02-03T17:32:57Z",
    "source": "Android Headlines",
    "sourceUrl": "https://www.androidheadlines.com/2026/02/spacex-acquires-xai-space-data-centers.html",
    "category": "climate",
    "author": "Jean Leon",
    "positivityScore": 2
  },
  {
    "title": "Copenhagen Infrastructure Partners acquires Ørsted’s European onshore business",
    "link": "https://financialpost.com/globe-newswire/copenhagen-infrastructure-partners-acquires-orsteds-european-onshore-business",
    "description": "The acquisition marks a significant milestone for its fifth flagship fund, CI V, managed by Copenhagen Infrastructure Partners, as it further strengthens its European portfolio and its position as a leading fund within energy infrastructure and onshore renewa…",
    "pubDate": "2026-02-03T07:04:33Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/globe-newswire/copenhagen-infrastructure-partners-acquires-orsteds-european-onshore-business",
    "category": "climate",
    "author": "GlobeNewswire",
    "positivityScore": 2
  },
  {
    "title": "Equinor Reports Lower Q4 Earnings as Record Production Supports Cash Flow",
    "link": "https://finance.yahoo.com/news/equinor-reports-lower-q4-earnings-102709236.html",
    "description": "Equinor closed 2025 with record production levels while adjusting capital allocation amid lower commodity prices.",
    "pubDate": "2026-02-04T10:27:09Z",
    "source": "Yahoo Entertainment",
    "sourceUrl": "https://finance.yahoo.com/news/equinor-reports-lower-q4-earnings-102709236.html",
    "category": "climate",
    "author": "Charles Kennedy",
    "positivityScore": 2
  },
  {
    "title": "Does a hummingbird feeder have to hang?",
    "link": "https://www.lifesciencesworld.com/does-a-hummingbird-feeder-have-to-hang/",
    "description": "Does a Hummingbird Feeder Have to Hang? Unveiling Alternative Placement Strategies While traditionally suspended, the answer is no; a hummingbird feeder does not have to hang. Explore the fascinating possibilities of pedestal and windowsill mounting for these…",
    "pubDate": "2026-02-04T06:55:57Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/does-a-hummingbird-feeder-have-to-hang/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "Do eagles lay eggs in the same nest every year?",
    "link": "https://www.lifesciencesworld.com/do-eagles-lay-eggs-in-the-same-nest-every-year/",
    "description": "Do Eagles Lay Eggs in the Same Nest Every Year? Eagles, magnificent symbols of power and freedom, often exhibit fascinating nesting behaviors. While eagles will often return to and reuse the same nest each year, especially if it has proven successful in the p…",
    "pubDate": "2026-02-04T04:54:14Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/do-eagles-lay-eggs-in-the-same-nest-every-year/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "TARPON—A Telomere Analysis and Research Pipeline Optimized for Nanopore",
    "link": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1013915",
    "description": "Long-read sequencing has transformed many areas of biology and holds significant promise for telomere research by enabling analysis of nucleotide-level resolution chromosome arm–specific telomere length in both model organisms and humans. However, the adoptio…",
    "pubDate": "2026-02-04T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1013915",
    "category": "wildlife",
    "author": "Nathaniel Deimler, David V. Ho, Norbert Paul, Zoë Gill, Peter Baumann",
    "positivityScore": 2
  },
  {
    "title": "Letter From Minnesota: Our Work is to We Protect What We Love",
    "link": "https://lithub.com/letter-from-minnesota-our-work-is-to-we-protect-what-we-love/",
    "description": "For thousands of years before ICE made the Bishop Henry Whipple Federal Building the home base for their sweeping immigration roundup, this place has been known to the Dakota people as Bdote, where two waters come together, the confluence of",
    "pubDate": "2026-02-04T09:59:00Z",
    "source": "Lithub.com",
    "sourceUrl": "https://lithub.com/letter-from-minnesota-our-work-is-to-we-protect-what-we-love/",
    "category": "wildlife",
    "author": "Diane Wilson",
    "positivityScore": 2
  },
  {
    "title": "An Underground World Built to Make Mountains Disappear for Travel and Power",
    "link": "https://economictimes.indiatimes.com/news/international/us/an-underground-world-built-to-make-mountains-disappear-for-travel-and-power/articleshow/127905125.cms",
    "description": "Engineers are now building vital infrastructure deep underground, bypassing mountains. This modern approach uses advanced physics and machinery to create flat, efficient routes for travel and energy storage.  Projects like the Gotthard Base Tunnel are transfo…",
    "pubDate": "2026-02-04T09:23:02Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/international/us/an-underground-world-built-to-make-mountains-disappear-for-travel-and-power/articleshow/127905125.cms",
    "category": "wildlife",
    "author": "Global Desk",
    "positivityScore": 2
  },
  {
    "title": "STARFLEET ACADEMY Explains What Became of the Klingons in the 32nd Century",
    "link": "https://nerdist.com/article/star-trek-starfleet-academy-what-happened-klingons-32nd-century/",
    "description": "Episode four of Star Trek: Starfleet Academy finally explains what became of the mighty Klingon Empire in the 32 century.\nThe post STARFLEET ACADEMY Explains What Became of the Klingons in the 32nd Century appeared first on Nerdist.",
    "pubDate": "2026-01-29T08:00:00Z",
    "source": "Nerdist",
    "sourceUrl": "https://nerdist.com/article/star-trek-starfleet-academy-what-happened-klingons-32nd-century/",
    "category": "wildlife",
    "author": "Eric Diaz",
    "positivityScore": 2
  }
]