[
  {
    "title": "Urban Farm Shops Combine Dutch Greenhouse Technology and Food-Retail into One",
    "link": "https://www.goodnewsnetwork.org/urban-farm-shops-combine-dutch-greenhouse-technology-and-food-retail-into-one/",
    "description": "In the city of The Hague, a Dutch agri-tech firm has had the bright idea of combining a greenhouse grow operation with a grocery and delivery business. Called LocalDutch, their idea is that the greenhouse grocers will integrate on-site food production with direct-to-consumer retail and local delivery in a single location, hoping the result will […]\nThe post Urban Farm Shops Combine Dutch Greenhouse Technology and Food-Retail into One appeared first on Good News Network.",
    "pubDate": "Tue, 17 Feb 2026 12:00:39 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/urban-farm-shops-combine-dutch-greenhouse-technology-and-food-retail-into-one/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Community Rallies to Save Poor Town’s Last Youth Center –And Succeeds with Government Grant",
    "link": "https://www.goodnewsnetwork.org/community-rallies-to-save-poor-coastal-towns-last-youth-center-and-succeed-with-government-grant/",
    "description": "One of England’s poorest coastal towns is filled with “hope and relief” after their last youth center was saved from closure. The nonprofit Pie Factory Music has been based in Ramsgate, on the coast of Kent, for 13 years. It offers counseling, employment advice, life-skills, creative projects, or just a safe supportive space to make […]\nThe post Community Rallies to Save Poor Town’s Last Youth Center –And Succeeds with Government Grant appeared first on Good News Network.",
    "pubDate": "Mon, 16 Feb 2026 16:30:22 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/community-rallies-to-save-poor-coastal-towns-last-youth-center-and-succeed-with-government-grant/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Good News in History, February 17",
    "link": "https://www.goodnewsnetwork.org/events070217/",
    "description": "Happy 69th Birthday to a titan of folk music: the multi-instrumentalist Loreena McKennitt. Born in Manitoba to Irish-Scottish ancestry, she fell in love with Celtic music traditions after a trip to Ireland. She learned how to play the Celtic harp and used it on the busk to make money to record her first album. She […]\nThe post Good News in History, February 17 appeared first on Good News Network.",
    "pubDate": "Tue, 17 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070217/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Giant Seed Vault Freezes Beneath Atacama Desert, Preserving Chile’s Floral Diversity For the Ages",
    "link": "https://www.goodnewsnetwork.org/giant-seed-vault-freezes-beneath-atacama-desert-preserving-chiles-floral-diversity-for-the-ages/",
    "description": "Amid the scorching/freezing desert of Atacama in Chile, one of South America’s largest botanical storehouses aims to protect both the wild and cultivated heritage of the country’s plant life. Called the Initihuasi Seed Bank, this genetic mothership is the central node in a nationwide network of institutions that are safeguarding the country’s plant diversity, come […]\nThe post Giant Seed Vault Freezes Beneath Atacama Desert, Preserving Chile’s Floral Diversity For the Ages appeared first on Good News Network.",
    "pubDate": "Mon, 16 Feb 2026 19:30:10 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/giant-seed-vault-freezes-beneath-atacama-desert-preserving-chiles-floral-diversity-for-the-ages/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Secrets Behind Rome’s Self-Healing Concrete Leads Scientist to Launch Roman-Style Concrete Business",
    "link": "https://www.goodnewsnetwork.org/secrets-behind-romes-self-healing-concrete-leads-scientist-to-launch-roman-style-concrete-business/",
    "description": "A scientist who figured out the secret behind ancient Rome’s self-repairing concrete has recently confirmed his theory at a Pompeii building site where such concrete was in use. This marriage of theoretical and historical knowledge combined with hard evidence has inspired the very same scientist now 3 years later to open a concrete business selling […]\nThe post Secrets Behind Rome’s Self-Healing Concrete Leads Scientist to Launch Roman-Style Concrete Business appeared first on Good News Network.",
    "pubDate": "Mon, 16 Feb 2026 14:00:56 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/secrets-behind-romes-self-healing-concrete-leads-scientist-to-launch-roman-style-concrete-business/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Scientists discover brain switches that clear Alzheimer’s plaques",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215225555.htm",
    "description": "Researchers have identified two brain receptors that help the brain clear away amyloid beta, a hallmark of Alzheimer’s disease. By stimulating these receptors in mice, scientists increased levels of a natural amyloid-breaking enzyme, reduced buildup in the brain, and improved memory-related behavior. Because these receptors are common drug targets, the findings could open the door to affordable pill-based treatments with fewer side effects.",
    "pubDate": "Tue, 17 Feb 2026 05:30:08 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215225555.htm",
    "category": "health",
    "positivityScore": 8
  },
  {
    "title": "Government rolls back nature protections to boost housing",
    "link": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "description": "Critics say government changes to a flagship biodiversity policy could stall nature recovery.",
    "pubDate": "Tue, 16 Dec 2025 17:51:04 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 8
  },
  {
    "title": "Magical Footage Shows Stag Strolling up to Lick a Man’s Camera Then Calmly Walking Away – WATCH",
    "link": "https://www.goodnewsnetwork.org/magical-footage-shows-stag-strolling-up-to-lick-a-mans-camera/",
    "description": "A new video from the Scottish Highlands shows a wild stag walking right up to a hiker, getting so close that his breath fogged up the stunned man’s camera lens. The ‘magical’ moment was captured by Craig who journeys around Scotland in a motorhome and documents his travels as the Roaming Thistle on social media. […]\nThe post Magical Footage Shows Stag Strolling up to Lick a Man’s Camera Then Calmly Walking Away – WATCH appeared first on Good News Network.",
    "pubDate": "Sun, 15 Feb 2026 16:38:03 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/magical-footage-shows-stag-strolling-up-to-lick-a-mans-camera/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny",
    "link": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-14-2026/",
    "description": "Our partner Rob Brezsny, who has a new book out, Astrology Is Real: Revelations from My Life as an Oracle, provides his weekly wisdom to enlighten our thinking and motivate our mood. Rob’s Free Will Astrology, is a syndicated weekly column appearing in over a hundred publications. He is also the author of Pronoia Is the Antidote […]\nThe post Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 11:00:18 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-2-14-2026/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Spark: How To Protest",
    "link": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "description": "Welcome back to The Spark, our monthly celebration of how people just like you are creating positive change, one meaningful step at a time. The Spark is generously supported by Laura Rice. Sign up to Reasons to be Cheerful’s weekly newsletter here and you’ll get The Spark in your inbox...\nThe post The Spark: How To Protest appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 02 Feb 2026 14:05:22 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "‘Landmark’ greenwashing case against Australian gas giant Santos dismissed by federal court",
    "link": "https://www.theguardian.com/australia-news/2026/feb/17/santos-greenwashing-court-case-dismissed",
    "description": "Legal bid by shareholder advocacy group over alleged misleading ‘net zero’ and ‘clean energy’ claims fails\n\nFollow our Australia news live blog for latest updates\n\nSign up for climate and environment editor Adam Morton’s free Clear Air newsletter here\n\nGas company Santos has successfully defended a landmark greenwashing case in which it was accused of making misleading claims about its net zero plans and being a producer of “clean” energy.\nIn a blow for climate activists, the federal court on Tuesday dismissed the case brought by the shareholder advocacy group the Australasian Centre for Corporate Responsibility (ACCR).\n Continue reading...",
    "pubDate": "Tue, 17 Feb 2026 04:41:31 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/australia-news/2026/feb/17/santos-greenwashing-court-case-dismissed",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "Forests are changing fast and scientists are deeply concerned",
    "link": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "description": "Forests around the world are quietly transforming, and not for the better. A massive global analysis of more than 31,000 tree species reveals that forests are becoming more uniform, increasingly dominated by fast-growing “sprinter” trees, while slow-growing, long-lived species are disappearing. These slower species act as the backbone of forest ecosystems, storing carbon, stabilizing environments, and supporting rich webs of life—especially in tropical regions where biodiversity is highest.",
    "pubDate": "Mon, 09 Feb 2026 02:17:56 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "Why Invest in the Breast Cancer Market Now? USD 40.11 Bn Growth Signals Major Opportunity by 2035",
    "link": "https://www.globenewswire.com/news-release/2026/02/16/3238668/0/en/Why-Invest-in-the-Breast-Cancer-Market-Now-USD-40-11-Bn-Growth-Signals-Major-Opportunity-by-2035.html",
    "description": "The global breast cancer market size was evaluated at USD 26.23 billion in 2025 and is projected to be worth around USD 40.11 billion by 2035, growing at a CAGR of 4.34% from 2026 to 2035. The growing incidence of breast cancer, advancements in specific thera…",
    "pubDate": "2026-02-16T12:36:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/16/3238668/0/en/Why-Invest-in-the-Breast-Cancer-Market-Now-USD-40-11-Bn-Growth-Signals-Major-Opportunity-by-2035.html",
    "category": "health",
    "author": "Precedence Research",
    "positivityScore": 6
  },
  {
    "title": "How Suzlon’s ‘decoupling’ gambit is paying dividends",
    "link": "https://www.thehindubusinessline.com/specials/corporate-file/how-suzlons-decoupling-gambit-is-paying-dividends/article70636307.ece",
    "description": "Discover how Suzlon's innovative decoupling strategy enhances project development and execution, driving significant growth in the wind energy sector.",
    "pubDate": "2026-02-15T16:59:31Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/specials/corporate-file/how-suzlons-decoupling-gambit-is-paying-dividends/article70636307.ece",
    "category": "climate",
    "author": "M  Ramesh",
    "positivityScore": 6
  },
  {
    "title": "Mercedes-Benz’ eActros electric semi trucks arrive in Chile",
    "link": "http://electrek.co/2026/02/15/mercedes-benz-eactros-electric-semi-trucks-arrive-in-chile/",
    "description": "Mercedes-Benz’ truck division has reached a major milestone in their South American expansion, delivering their first, eActros 600 electric semi truck in Chile earlier this week.\n\n\n\n more…",
    "pubDate": "2026-02-15T21:25:14Z",
    "source": "Electrek",
    "sourceUrl": "http://electrek.co/2026/02/15/mercedes-benz-eactros-electric-semi-trucks-arrive-in-chile/",
    "category": "climate",
    "author": "Jo Borrás",
    "positivityScore": 6
  },
  {
    "title": "S. Australia Wholesale Electricity Prices fall 30% with Solar, Revealing Trump’s High-Cost Fossil Fuels Scam",
    "link": "https://www.juancole.com/2026/02/australia-wholesale-electricity.html",
    "description": "If fossil fuels were competitive, Trump wouldn't have to try so hard to stall permitting for new wind and solar projects",
    "pubDate": "2026-02-16T05:14:33Z",
    "source": "Juancole.com",
    "sourceUrl": "https://www.juancole.com/2026/02/australia-wholesale-electricity.html",
    "category": "climate",
    "author": "Juan Cole",
    "positivityScore": 6
  },
  {
    "title": "‘A different set of rules’: thermal drone footage shows Musk’s AI power plant flouting clean air regulations",
    "link": "https://www.theguardian.com/environment/2026/feb/13/elon-musk-xai-datacenters-air-pollution-mississippi",
    "description": "Images confirm xAI is continuing to defy EPA regulations in Mississippi to power its flagship datacenters\nElon Musk’s artificial intelligence company is continuing to fuel its datacenters with unpermitted gas turbines, an investigation by the Floodlight newsroom shows. Thermal footage captured by Floodlight via drone shows xAI is still burning gas at a facility in Southaven, Mississippi, despite a recent Environmental Protection Agency (EPA) ruling reiterating that doing so requires a state permit in advance.\nState regulators in Mississippi maintain that since the turbines are parked on tractor trailers, they don’t require permits. However, the EPA has long maintained that such pollution sources require permits under the Clean Air Act.\n Continue reading...",
    "pubDate": "Fri, 13 Feb 2026 18:00:15 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/13/elon-musk-xai-datacenters-air-pollution-mississippi",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Claims that AI can help fix climate dismissed as greenwashing",
    "link": "https://www.theguardian.com/technology/2026/feb/17/tech-companies-traditional-ai-generative-climate-breakdown-report",
    "description": "Industry using ‘diversionary’ tactics, says analyst, as energy-hungry complex functions such as video generation and deep research proliferate\nTech companies are conflating traditional artificial intelligence with generative AI when claiming the energy-hungry technology could help avert climate breakdown, according to a report.\nMost claims that AI can help avert climate breakdown refer to machine learning and not the energy-hungry chatbots and image generation tools driving the sector’s explosive growth of gas-guzzling datacentres, the analysis of 154 statements found.\n Continue reading...",
    "pubDate": "Tue, 17 Feb 2026 05:00:47 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/technology/2026/feb/17/tech-companies-traditional-ai-generative-climate-breakdown-report",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Floating cities of logs: can the ‘lungs of Africa’ survive its exploitation?",
    "link": "https://www.theguardian.com/global-development/2026/feb/16/floating-cities-of-logs-can-the-lungs-of-africa-survive-exploitation-congo-river",
    "description": "The Congo River basin is one of the planet’s most biodiverse ecosystems. But it is also home to a growing population and relentless trade in timber and charcoal\n“You can’t be scared of the storms,” says Jean de Dieu Mokuma as the sun sets on the Congo River behind him. “With the current, once your voyage has begun, there is no turning back.” Mokuma, along with his wife Marie-Therese and their two young children, is piloting a cargo of timber downstream lashed on to a precarious raft and tied to a canoe.\nFamilies wake up at dawn on rafts of logs and merchandise that are being transported down the Congo River by boat to Kinshasa, the DRC capital\n Continue reading...",
    "pubDate": "Mon, 16 Feb 2026 12:00:24 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/global-development/2026/feb/16/floating-cities-of-logs-can-the-lungs-of-africa-survive-exploitation-congo-river",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Ancient DNA solves 12,000-year-old mystery of rare genetic growth disorder",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005754.htm",
    "description": "An Ice Age double burial in Italy has yielded a stunning genetic revelation. DNA from a mother and daughter who lived over 12,000 years ago shows that the younger had a rare inherited growth disorder, confirmed through mutations in a key bone-growth gene. Her mother carried a milder version of the same mutation. The finding not only solves a long-standing mystery but also proves that rare genetic diseases stretch far back into prehistory.",
    "pubDate": "Tue, 17 Feb 2026 06:25:57 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005754.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Melting Antarctic ice may weaken a major carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "description": "Melting ice from West Antarctica once delivered huge amounts of iron to the Southern Ocean, but algae growth did not increase as expected. Researchers found the iron was in a form that marine life could not easily use. This means more melting ice does not automatically boost carbon absorption. In the future, Antarctic ice loss could actually reduce the ocean’s ability to slow climate change.",
    "pubDate": "Wed, 04 Feb 2026 04:32:51 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Mysterious RNA led scientists to a hidden layer of cancer",
    "link": "https://www.sciencedaily.com/releases/2026/02/260216084527.htm",
    "description": "A mysterious RNA found in breast cancer led scientists to uncover an entire hidden class of cancer-specific RNAs across dozens of tumor types. These molecules form unique molecular signatures that identify cancer type and subtype with remarkable accuracy. Some even drive tumor growth and metastasis. Because many are released into the bloodstream, a simple blood test can track how patients respond to treatment and predict survival.",
    "pubDate": "Tue, 17 Feb 2026 03:50:37 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260216084527.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Scientists discover the enzyme that lets cancer rapidly rewire its DNA",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215225546.htm",
    "description": "Researchers have uncovered the enzyme behind chromothripsis, a chaotic chromosome-shattering event seen in about one in four cancers. The enzyme, N4BP2, breaks apart DNA trapped in tiny cellular structures, unleashing a burst of genetic changes that can help tumors rapidly adapt and resist therapy. Blocking the enzyme dramatically reduced this genomic destruction in cancer cells.",
    "pubDate": "Mon, 16 Feb 2026 01:00:42 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215225546.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Scientists confirm one-dimensional electron behavior in phosphorus chains",
    "link": "https://www.sciencedaily.com/releases/2026/02/260215225541.htm",
    "description": "For the first time, researchers have shown that self-assembled phosphorus chains can host genuinely one-dimensional electron behavior. Using advanced imaging and spectroscopy techniques, they separated the signals from chains aligned in different directions to reveal their true nature. The findings suggest that squeezing the chains closer together could trigger a dramatic shift from semiconductor to metal. That means simply adjusting density could unlock entirely new electronic states.",
    "pubDate": "Mon, 16 Feb 2026 06:52:35 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260215225541.htm",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "Alexander Fleming’s Forgotten Petri Dish Sparked the Antibiotic Revolution",
    "link": "https://economictimes.indiatimes.com/news/international/us/alexander-flemings-forgotten-petri-dish-sparked-the-antibiotic-revolution/articleshow/128411282.cms",
    "description": "A chance observation in Alexander Fleming's London lab in 1928 led to a medical revolution. Fleming noticed mold killing bacteria in a petri dish. This discovery, penicillin, was later developed into a life-saving drug. It transformed treatments for infection…",
    "pubDate": "2026-02-16T06:55:32Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/international/us/alexander-flemings-forgotten-petri-dish-sparked-the-antibiotic-revolution/articleshow/128411282.cms",
    "category": "science",
    "author": "Global Desk",
    "positivityScore": 4
  },
  {
    "title": "Low Dose Sublingual Ketamine",
    "link": "https://www.psychologytoday.com/us/blog/the-leading-edge/202602/low-dose-sublingual-ketamine",
    "description": "Discover a new low-dose, inexpensive, at-home treatment for depression that is revolutionizing the treatment of neuropsychiatric disorders.",
    "pubDate": "2026-02-15T19:08:47Z",
    "source": "Psychology Today",
    "sourceUrl": "https://www.psychologytoday.com/us/blog/the-leading-edge/202602/low-dose-sublingual-ketamine",
    "category": "science",
    "author": "Mitchell B. Liester M.D.",
    "positivityScore": 4
  },
  {
    "title": "$3.25+ Bn Human Microbiome Market Trends and Global Forecasts, 2035, Driven by Advancements in Microbiome Sequencing, Rising Investments in R&D, and Increasing Demand for Personalized Medicine",
    "link": "https://www.globenewswire.com/news-release/2026/02/16/3238647/28124/en/3-25-Bn-Human-Microbiome-Market-Trends-and-Global-Forecasts-2035-Driven-by-Advancements-in-Microbiome-Sequencing-Rising-Investments-in-R-D-and-Increasing-Demand-for-Personalized-Me.html",
    "description": "The human microbiome market offers growth opportunities through advancements in microbiome sequencing, rising investments in R&D, and increasing demand for personalized medicine. Key drivers include strategic partnerships, regulatory approvals for microbiome …",
    "pubDate": "2026-02-16T11:50:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/16/3238647/28124/en/3-25-Bn-Human-Microbiome-Market-Trends-and-Global-Forecasts-2035-Driven-by-Advancements-in-Microbiome-Sequencing-Rising-Investments-in-R-D-and-Increasing-Demand-for-Personalized-Me.html",
    "category": "health",
    "author": "Research and Markets",
    "positivityScore": 4
  },
  {
    "title": "Roche announces positive phase III results for Gazyva/Gazyvaro in primary membranous nephropathy, marking a significant milestone in this autoimmune disease",
    "link": "https://www.globenewswire.com/news-release/2026/02/16/3238524/0/en/Roche-announces-positive-phase-III-results-for-Gazyva-Gazyvaro-in-primary-membranous-nephropathy-marking-a-significant-milestone-in-this-autoimmune-disease.html",
    "description": "Basel, 16 February 2026 - Roche (SIX: RO, ROG; OTCQX: RHHBY) announced today that the phase III MAJESTY study in adults with primary membranous nephropathy met its primary endpoint, showing statistically significant and clinically meaningful results with Gazy…",
    "pubDate": "2026-02-16T06:00:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/16/3238524/0/en/Roche-announces-positive-phase-III-results-for-Gazyva-Gazyvaro-in-primary-membranous-nephropathy-marking-a-significant-milestone-in-this-autoimmune-disease.html",
    "category": "health",
    "author": "F. Hoffmann-La Roche Ltd",
    "positivityScore": 4
  },
  {
    "title": "Stock Market Highlights for February 16: Sensex jumps 650.39 points to settle at 83,277.15; Nifty advances 211.65 points to 25,682.75; Nifty Auto down nearly 1%",
    "link": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-16th-february-2026/article70634974.ece",
    "description": "Sensex, Nifty, Share Prices Highlights: Benchmark indices Sensex and Nifty, which opened on a weak note, recovered to trade firm. At 3:30 pm, Sensex was at 83,305.44, up +678.68 points (0.82%). Nifty was at 25,681.60, up +210.5 points (0.83%). The Indian rupe…",
    "pubDate": "2026-02-16T10:47:13Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-16th-february-2026/article70634974.ece",
    "category": "climate",
    "author": "Team BL, KS Badri Narayanan",
    "positivityScore": 4
  },
  {
    "title": "Fall in coal-fired power generation in India & China in 2025, a first in 50 years",
    "link": "https://www.thehindubusinessline.com/economy/fall-in-coal-fired-power-generation-in-india-china-in-2025-a-first-in-50-years/article70637595.ece",
    "description": "The year 2025 was an outlier for coal-based electricity generation, which declined in the world’s top consuming centres — China and India — a first in the last 50 years.",
    "pubDate": "2026-02-16T06:18:04Z",
    "source": "BusinessLine",
    "sourceUrl": "https://www.thehindubusinessline.com/economy/fall-in-coal-fired-power-generation-in-india-china-in-2025-a-first-in-50-years/article70637595.ece",
    "category": "climate",
    "author": "Rishi Ranjan Kala",
    "positivityScore": 4
  },
  {
    "title": "Equitable Water Management",
    "link": "https://www.rand.org/pubs/external_publications/EP71248.html",
    "description": "This guidebook was developed in response to growing recognition within the water sector that water services are not equitably distributed.",
    "pubDate": "2026-02-16T09:00:00Z",
    "source": "Rand.org",
    "sourceUrl": "https://www.rand.org/pubs/external_publications/EP71248.html",
    "category": "climate",
    "author": "Linnea Warren May, Alexandra Ntazinda, Michelle E. Miro, Lena Easton-Calabria, Krista Romita Grocholski",
    "positivityScore": 4
  },
  {
    "title": "Fresh polls, ND’s ups and downs, President Maria and Alexis, Violanta’s green adviser, Goldair, Piraeus Bank and Thriassio",
    "link": "https://en.protothema.gr/2026/02/16/fresh-polls-nds-ups-and-downs-president-maria-and-alexis-violantas-green-adviser-goldair-piraeus-bank-and-thriassio/",
    "description": "Chang’s “Golden Panda” & the Greece–UAE memorandum in Abu Dhabi\nThe post Fresh polls, ND’s ups and downs, President Maria and Alexis, Violanta’s green adviser, Goldair, Piraeus Bank and Thriassio appeared first on ProtoThema English.",
    "pubDate": "2026-02-16T06:59:49Z",
    "source": "Protothema.gr",
    "sourceUrl": "https://en.protothema.gr/2026/02/16/fresh-polls-nds-ups-and-downs-president-maria-and-alexis-violantas-green-adviser-goldair-piraeus-bank-and-thriassio/",
    "category": "climate",
    "author": "Newsroom",
    "positivityScore": 4
  },
  {
    "title": "How do you treat viral disease in fish?",
    "link": "https://www.lifesciencesworld.com/how-do-you-treat-viral-disease-in-fish/",
    "description": "How Do You Treat Viral Disease in Fish? While direct treatment of viral infections in fish is often limited, successful management hinges on strengthening the fish’s immune system and mitigating secondary infections, ultimately creating an environment that fa…",
    "pubDate": "2026-02-16T04:57:35Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-do-you-treat-viral-disease-in-fish/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Microplastics have reached Antarctica’s only native insect",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "description": "Even Antarctica’s toughest native insect can’t escape the reach of plastic pollution. Scientists have discovered that Belgica antarctica — a tiny, rice-sized midge and the southernmost insect on Earth — is already ingesting microplastics in the wild. While lab tests showed the hardy larvae can survive short-term exposure without obvious harm, those exposed to higher plastic levels had reduced fat reserves, hinting at hidden energy costs.",
    "pubDate": "Mon, 16 Feb 2026 07:48:45 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212234214.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Yellowstone wolves may not have transformed the national park after all",
    "link": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "description": "A new scientific review challenges the headline-grabbing claim that Yellowstone’s returning wolves triggered one of the strongest trophic cascades on Earth. Researchers found that the reported 1,500% surge in willow growth was based on circular calculations and questionable comparisons. After correcting for modeling and sampling flaws, the supposed ecosystem-wide boom largely disappears.",
    "pubDate": "Thu, 12 Feb 2026 08:51:03 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260212025612.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Scientists discover pets are helping an invasive flatworm spread",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210231550.htm",
    "description": "A new study shows that dogs and cats may be helping an invasive flatworm spread. Researchers analyzing over a decade of reports discovered the worm attached to pet fur. Its sticky mucus and ability to reproduce alone make it highly adaptable. Pets could be giving this slow-moving invader a major boost.",
    "pubDate": "Sat, 14 Feb 2026 09:34:47 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210231550.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Nearly 200,000 people reveal the real key to heart health",
    "link": "https://www.sciencedaily.com/releases/2026/02/260216084521.htm",
    "description": "A decades-long study of nearly 200,000 adults challenges the low-carb versus low-fat debate. Both eating patterns were tied to lower heart disease risk when they emphasized whole grains, plant-based foods, and healthy fats. Versions filled with refined carbs and animal fats increased risk instead. Quality, not just quantity, appears to make the difference.",
    "pubDate": "Tue, 17 Feb 2026 00:29:36 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260216084521.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "This new blood test could detect cancer before it shows up on scans",
    "link": "https://www.sciencedaily.com/releases/2026/02/260216044002.htm",
    "description": "A new light-based sensor can spot incredibly tiny amounts of cancer biomarkers in blood, raising the possibility of earlier and simpler cancer detection. The technology merges DNA nanotechnology, CRISPR, and quantum dots to generate a clear signal from just a few molecules. In lung cancer tests, it worked even in real patient serum samples. Researchers hope it could eventually power portable blood tests for cancer and other diseases.",
    "pubDate": "Mon, 16 Feb 2026 20:48:34 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260216044002.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Are wetter winters and frequent flooding here to stay?",
    "link": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "description": "Many places across the UK have experienced their wettest January in more than 100 years.",
    "pubDate": "Wed, 11 Feb 2026 02:59:08 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Landmark deal to cut global shipping emissions in tatters after US pressure",
    "link": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "description": "President Trump intervened in the talks calling the deal a \"green scam\".",
    "pubDate": "Fri, 17 Oct 2025 16:31:07 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Ultra-fast pulsar found near the Milky Way’s supermassive black hole",
    "link": "https://www.sciencedaily.com/releases/2026/02/260217005751.htm",
    "description": "Scientists scanning the heart of the Milky Way have spotted a tantalizing signal: a possible ultra-fast pulsar spinning every 8.19 milliseconds near Sagittarius A*, the supermassive black hole at our galaxy’s core. Pulsars act like incredibly precise cosmic clocks, and finding one in this extreme environment could open a rare window into how space-time behaves under intense gravity.",
    "pubDate": "Tue, 17 Feb 2026 06:15:42 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260217005751.htm",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "The Red Marks of Pseudo-Medicine: Gua Sha",
    "link": "https://sciencebasedmedicine.org/the-red-marks-of-pseudo-medicine-gua-sha/",
    "description": "Claiming that an inflammatory response to injury is inherently therapeutic is a massive leap of faith.\nThe post The Red Marks of Pseudo-Medicine: Gua Sha first appeared on Science-Based Medicine.",
    "pubDate": "2026-02-16T08:30:00Z",
    "source": "Sciencebasedmedicine.org",
    "sourceUrl": "https://sciencebasedmedicine.org/the-red-marks-of-pseudo-medicine-gua-sha/",
    "category": "science",
    "author": "William Mitchell",
    "positivityScore": 2
  },
  {
    "title": "The Photo That Unlocked DNA: Rosalind Franklin’s Breakthrough",
    "link": "https://economictimes.indiatimes.com/news/international/us/the-photo-that-unlocked-dna-rosalind-franklins-breakthrough/articleshow/128411627.cms",
    "description": "In May 1952, Rosalind Franklin and Raymond Gosling captured Photo 51, a crucial X-ray diffraction image revealing DNA's helical structure. Franklin's meticulous analysis provided precise measurements of the molecule's dimensions and backbone placement. This f…",
    "pubDate": "2026-02-16T07:07:02Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/international/us/the-photo-that-unlocked-dna-rosalind-franklins-breakthrough/articleshow/128411627.cms",
    "category": "science",
    "author": "Global Desk",
    "positivityScore": 2
  },
  {
    "title": "After weight loss breakthrough: The hard truth about staying slim",
    "link": "https://www.standardmedia.co.ke/health/health-science/article/2001540949/after-weight-loss-breakthrough-the-hard-truth-about-staying-slim",
    "description": "To prevent weight regain, consider building meals around lean protein and whole grains and noticing where calories might be creeping in, such as snacks, sugary drinks and alcohol.",
    "pubDate": "2026-02-16T09:01:43Z",
    "source": "Standard Digital",
    "sourceUrl": "https://www.standardmedia.co.ke/health/health-science/article/2001540949/after-weight-loss-breakthrough-the-hard-truth-about-staying-slim",
    "category": "health",
    "author": "The Conversation",
    "positivityScore": 2
  },
  {
    "title": "Two injections a year may transform hypertension care, says Lancet review",
    "link": "https://www.business-standard.com/health/hypertension-two-injections-year-lancet-long-acting-therapies-126021600911_1.html",
    "description": "High Blood Pressure Treatment: A new Lancet review highlights innovative hypertension treatments, including twice-yearly injections that may offer long-lasting blood pressure control.",
    "pubDate": "2026-02-16T12:15:52Z",
    "source": "Business Standard",
    "sourceUrl": "https://www.business-standard.com/health/hypertension-two-injections-year-lancet-long-acting-therapies-126021600911_1.html",
    "category": "health",
    "author": "Sarjna Rai",
    "positivityScore": 2
  },
  {
    "title": "Harness Therapeutics Nominates HRN001, a First-in-Class Drug Candidate for Huntington’s Disease and Establishes Clinical Advisory Board",
    "link": "https://www.globenewswire.com/news-release/2026/02/16/3238537/0/en/Harness-Therapeutics-Nominates-HRN001-a-First-in-Class-Drug-Candidate-for-Huntington-s-Disease-and-Establishes-Clinical-Advisory-Board.html",
    "description": "HRN001 is a potent and specific antisense oligonucleotide designed to drive controlled upregulation of FAN1, a genetically validated target in...",
    "pubDate": "2026-02-16T07:00:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/16/3238537/0/en/Harness-Therapeutics-Nominates-HRN001-a-First-in-Class-Drug-Candidate-for-Huntington-s-Disease-and-Establishes-Clinical-Advisory-Board.html",
    "category": "health",
    "author": "Harness Therapeutics",
    "positivityScore": 2
  },
  {
    "title": "Top U.S. General Joins the Fight for Rare Earth Security",
    "link": "https://oilprice.com/Energy/Energy-General/Top-US-General-Joins-the-Fight-for-Rare-Earth-Security.html",
    "description": "Retired General Jack Keane, former Vice Chief of Staff of the U.S. Army and a long-standing voice on defense readiness, has joined the board of REalloys as the company brings online North America’s first industrial-scale heavy rare-earth processing and metall…",
    "pubDate": "2026-02-16T11:00:00Z",
    "source": "OilPrice.com",
    "sourceUrl": "https://oilprice.com/Energy/Energy-General/Top-US-General-Joins-the-Fight-for-Rare-Earth-Security.html",
    "category": "climate",
    "author": "Tom Kool",
    "positivityScore": 2
  },
  {
    "title": "Torrent Power to acquire Nabha Power from L&T for ₹6,889 crore",
    "link": "https://www.livemint.com/companies/news/torrent-power-to-acquire-nabha-power-ltd-from-l-t-for-rs-6-889-crore-11771230553580.html",
    "description": "The acquisition comes as India’s power generation capacity expands rapidly amid rising electricity demand.",
    "pubDate": "2026-02-16T09:50:40Z",
    "source": "Livemint",
    "sourceUrl": "https://www.livemint.com/companies/news/torrent-power-to-acquire-nabha-power-ltd-from-l-t-for-rs-6-889-crore-11771230553580.html",
    "category": "climate",
    "author": "Rituraj Baruah",
    "positivityScore": 2
  },
  {
    "title": "Nearly half of L.A County's pavement may be unnecessary, new map finds",
    "link": "https://www.yahoo.com/news/articles/nearly-half-l-countys-pavement-110000901.html",
    "description": "Researchers have released the first parcel-level analysis to map all paved surfaces across L.A. County. In particular, large parking lots are ripe for change...",
    "pubDate": "2026-02-16T11:00:00Z",
    "source": "Yahoo Entertainment",
    "sourceUrl": "https://www.yahoo.com/news/articles/nearly-half-l-countys-pavement-110000901.html",
    "category": "climate",
    "author": "Meg Tanaka",
    "positivityScore": 2
  },
  {
    "title": "The key factors to consider when finding the best hearing aid for you",
    "link": "https://www.the-independent.com/life-style/health-and-families/hearing-aid-specsavers-budget-b2921045.html",
    "description": "Finding the best hearing aid can improve your daily life and ability to communicate",
    "pubDate": "2026-02-16T09:42:35Z",
    "source": "The-independent.com",
    "sourceUrl": "https://www.the-independent.com/life-style/health-and-families/hearing-aid-specsavers-budget-b2921045.html",
    "category": "climate",
    "author": "Camilla Foster",
    "positivityScore": 2
  },
  {
    "title": "Let there be design: ESA’s Genesis mission passes PDR",
    "link": "https://www.esa.int/Applications/Satellite_navigation/Let_there_be_design_ESA_s_Genesis_mission_passes_PDR",
    "description": "In December last year, teams from the European Space Agency (ESA) and industry completed the system Preliminary Design Review (PDR) for ESA’s Genesis mission, which will measure Earth down to the millimetre. The improved measurement of Earth will benefit fiel…",
    "pubDate": "2026-02-16T13:30:00Z",
    "source": "Esa.int",
    "sourceUrl": "https://www.esa.int/Applications/Satellite_navigation/Let_there_be_design_ESA_s_Genesis_mission_passes_PDR",
    "category": "climate",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "Despite Rollbacks, U.S. Fossil Fuels Face Tough Road Ahead",
    "link": "https://e360.yale.edu/digest/endangerment-coal-oil-demand",
    "description": "Last week, the Trump administration declared the federal government has no legal authority to regulate greenhouse gases, its latest move aimed at weakening regulations and boosting fossil fuels. And yet, analysts continue to see waning fortunes for miners and…",
    "pubDate": "2026-02-16T12:01:00Z",
    "source": "Yale.edu",
    "sourceUrl": "https://e360.yale.edu/digest/endangerment-coal-oil-demand",
    "category": "climate",
    "author": null,
    "positivityScore": 2
  },
  {
    "title": "What is the lateral line in cartilaginous fish?",
    "link": "https://www.lifesciencesworld.com/what-is-the-lateral-line-in-cartilaginous-fish/",
    "description": "What is the Lateral Line in Cartilaginous Fish? The lateral line in cartilaginous fish is a specialized sensory system allowing them to detect water movement, pressure gradients, and vibrations in their surroundings; it is, in essence, their aquatic sixth sen…",
    "pubDate": "2026-02-16T05:04:26Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-is-the-lateral-line-in-cartilaginous-fish/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "What game can 300 Win Mag take down?",
    "link": "https://www.lifesciencesworld.com/what-game-can-300-win-mag-take-down/",
    "description": "What Game Can a .300 Win Mag Really Take Down? The .300 Winchester Magnum, or .300 Win Mag, is a powerful and versatile cartridge capable of ethically harvesting virtually any game animal on the planet. It’s a favorite for pursuing everything from whitetail d…",
    "pubDate": "2026-02-16T03:26:22Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-game-can-300-win-mag-take-down/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "What attracts whitetail deer the best?",
    "link": "https://www.lifesciencesworld.com/what-attracts-whitetail-deer-the-best/",
    "description": "What Attracts Whitetail Deer the Best? What attracts whitetail deer the best? is a multifaceted question, but the short answer is this: A combination of high-quality food sources, reliable water, secure bedding areas, and minimal pressure are what attracts wh…",
    "pubDate": "2026-02-16T07:50:49Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/what-attracts-whitetail-deer-the-best/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "How did horses become feral?",
    "link": "https://www.lifesciencesworld.com/how-did-horses-become-feral/",
    "description": "How Did Horses Become Feral? Exploring the Path to Wildness How did horses become feral? Feral horse populations descend from domesticated ancestors who either escaped, were released, or were intentionally abandoned, allowing them to adapt and thrive in the w…",
    "pubDate": "2026-02-16T04:22:44Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-did-horses-become-feral/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 2
  },
  {
    "title": "When the CIA Stopped Lying, The New York Times Stopped Reporting",
    "link": "https://www.fairobserver.com/politics/when-the-cia-stopped-lying-the-new-york-times-stopped-reporting/",
    "description": "Everyone should know by now that mainstream media has better things to do than home in on the truth. It’s not entirely their fault. First of all, what is the truth? Is it reported facts? Facts don’t tell a story and the media’s job is to tell stories.  If the…",
    "pubDate": "2026-02-16T14:12:12Z",
    "source": "Fair Observer",
    "sourceUrl": "https://www.fairobserver.com/politics/when-the-cia-stopped-lying-the-new-york-times-stopped-reporting/",
    "category": "people",
    "author": "Peter Isackson",
    "positivityScore": 2
  },
  {
    "title": "Space programmes reflect ancient scientific spirit in modern form: Rajnath",
    "link": "https://www.business-standard.com/india-news/space-programmes-reflect-ancient-scientific-spirit-in-modern-form-rajnath-126021500807_1.html",
    "description": "India's space missions like Chandrayaan and Aditya-L1 are not just technological achievements but a modern expression that ancient scientific spirit has always been a part of our cultural identity, Defence Minister Rajnath Singh said here on Sunday.\nAt the in…",
    "pubDate": "2026-02-16T01:27:49Z",
    "source": "Business Standard",
    "sourceUrl": "https://www.business-standard.com/india-news/space-programmes-reflect-ancient-scientific-spirit-in-modern-form-rajnath-126021500807_1.html",
    "category": "people",
    "author": "Press Trust of India",
    "positivityScore": 2
  },
  {
    "title": "Good News in History, February 14",
    "link": "https://www.goodnewsnetwork.org/events070214/",
    "description": "95 years ago today, the horror film Dracula starring Bela Lugosi was released. Adapted from the 1897 novel by Bram Stoker, it’s a tale of Count Dracula, a vampire who emigrates from Transylvania to England and preys upon the blood of living victims. WATCH his reaction to being shown a crucifix… (1931) Directed and co-produced […]\nThe post Good News in History, February 14 appeared first on Good News Network.",
    "pubDate": "Sat, 14 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070214/",
    "category": "general",
    "positivityScore": -3
  }
]