[
  {
    "title": "New auction delivers unprecedented clean, homegrown power",
    "link": "https://www.gov.uk/government/news/new-auction-delivers-unprecedented-clean-homegrown-power",
    "description": "Record solar, onshore wind, and tidal projects - building on last month’s offshore wind success - deliver Britain’s biggest-ever clean energy auction.",
    "pubDate": "2026-02-10T07:54:09Z",
    "source": "Www.gov.uk",
    "sourceUrl": "https://www.gov.uk/government/news/new-auction-delivers-unprecedented-clean-homegrown-power",
    "category": "climate",
    "author": "Department for Energy Security and Net Zero",
    "positivityScore": 12
  },
  {
    "title": "U.S. Food and Drug Administration Accepts New Drug Application and Grants Priority Review for Takeda’s Oveporexton (TAK-861) as a Potential First-in-Class Therapy for Narcolepsy Type 1",
    "link": "https://financialpost.com/pmn/business-wire-news-releases-pmn/u-s-food-and-drug-administration-accepts-new-drug-application-and-grants-priority-review-for-takedas-oveporexton-tak-861-as-a-potential-first-in-class-therapy-for-narcolepsy-type-1",
    "description": "This FDA Acceptance is a Milestone for People Living with Narcolepsy Type 1 Who Need New and Different Treatment Options Oveporexton is an Orexin Agonist Designed to Restore Orexin Signaling and Address the Underlying Orexin Deficiency that Causes Narcolepsy …",
    "pubDate": "2026-02-10T08:18:05Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/pmn/business-wire-news-releases-pmn/u-s-food-and-drug-administration-accepts-new-drug-application-and-grants-priority-review-for-takedas-oveporexton-tak-861-as-a-potential-first-in-class-therapy-for-narcolepsy-type-1",
    "category": "health",
    "author": "Business Wire",
    "positivityScore": 10
  },
  {
    "title": "What went right this week: the good news that matters",
    "link": "https://www.positive.news/society/good-news-stories-from-week-6-of-2026/",
    "description": "A third of cancer cases are ‘avoidable’, Africa powers ahead on solar, and the push for global tax justice gathers pace, plus more good news\nThe post What went right this week: the good news that matters appeared first on Positive News.",
    "pubDate": "Fri, 06 Feb 2026 05:30:18 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/good-news-stories-from-week-6-of-2026/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Life lessons: former Olympian Aimee Fuller on what life so far has taught her",
    "link": "https://www.positive.news/society/life-lessons-aimee-fuller/",
    "description": "Now presenting the 2026 Winter Games on TNT, the former Team GB Olympic snowboarder reflects on what has shaped her life beyond the slopes\nThe post Life lessons: former Olympian Aimee Fuller on what life so far has taught her appeared first on Positive News.",
    "pubDate": "Thu, 05 Feb 2026 16:46:15 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/life-lessons-aimee-fuller/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Lost Painting by the ‘Illustrious Woman’ Painter of the Renaissance Surfaces in N. Carolina After 100 Years",
    "link": "https://www.goodnewsnetwork.org/lost-painting-by-the-illustrious-woman-painter-of-the-renaissance-surfaces-in-n-carolina-after-100-years/",
    "description": "A lost work by the most famous female artist of the Renaissance has surfaced at a North Carolina estate. The story of how Portrait of a Canon Regular was found begins in 1920 when it was photographed in black and white—before vanishing from all knowledge. 104 years later, art historian Michael Cole recorded a lecture on the […]\nThe post Lost Painting by the ‘Illustrious Woman’ Painter of the Renaissance Surfaces in N. Carolina After 100 Years appeared first on Good News Network.",
    "pubDate": "Wed, 11 Feb 2026 13:00:14 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/lost-painting-by-the-illustrious-woman-painter-of-the-renaissance-surfaces-in-n-carolina-after-100-years/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 10",
    "link": "https://www.goodnewsnetwork.org/events070210/",
    "description": "86 years ago today, In the Mood, by Glenn Miller reached #1 on the charts in the US. It’s one of those jazz tunes that everybody knows, even if they don’t know it by name. The saxophone opening is iconic, and the recording by Miller (though other versions had existed) was taken for the Library […]\nThe post Good News in History, February 10 appeared first on Good News Network.",
    "pubDate": "Tue, 10 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070210/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 9",
    "link": "https://www.goodnewsnetwork.org/events070209/",
    "description": "152 years ago today, American Pulitzer Prize-winning Poet Amy Lowell was born. During a career that spanned just over a dozen years, she wrote and published over 650 poems, yet scholars cite Lowell’s tireless efforts to awaken American readers to contemporary trends in poetry, including by substantially aiding the rise of Ezra Pound’s work, as […]\nThe post Good News in History, February 9 appeared first on Good News Network.",
    "pubDate": "Mon, 09 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070209/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Government rolls back nature protections to boost housing",
    "link": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "description": "Critics say government changes to a flagship biodiversity policy could stall nature recovery.",
    "pubDate": "Tue, 16 Dec 2025 17:51:04 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 8
  },
  {
    "title": "How to promote universities’ research and development into green agricultural products – A tripartite evolutionary game analysis",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342240",
    "description": "Research into green agricultural products significantly enhances the sustainable development of China’s agriculture. These products ensure food safety, meet quality demands, reduce pollution, and advance agricultural green transformation. Utilising evolutiona…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342240",
    "category": "science",
    "author": "Lin Xiong, Luyao Chang, Yiyi Luo, Hansheng Wu, Yuchao Wang, Huile Jin",
    "positivityScore": 8
  },
  {
    "title": "AI and Data Centres Surge in Global Electricity Consumption Projected to Reach 1,300 TWh by 2035, AI to Save USD 110 Billion in Power Plant Operations",
    "link": "https://www.globenewswire.com/news-release/2026/02/10/3235450/0/en/AI-and-Data-Centres-Surge-in-Global-Electricity-Consumption-Projected-to-Reach-1-300-TWh-by-2035-AI-to-Save-USD-110-Billion-in-Power-Plant-Operations.html",
    "description": "According to data published by Precedence Research, the growing investment in data centres, driven by artificial intelligence (AI), has already led to data centres consuming around 1% of global electricity. As AI adoption continues to rise, data centre electr…",
    "pubDate": "2026-02-10T14:30:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/10/3235450/0/en/AI-and-Data-Centres-Surge-in-Global-Electricity-Consumption-Projected-to-Reach-1-300-TWh-by-2035-AI-to-Save-USD-110-Billion-in-Power-Plant-Operations.html",
    "category": "climate",
    "author": "Precedence Research",
    "positivityScore": 8
  },
  {
    "title": "The shifting reality of knife crime in the UK",
    "link": "https://www.positive.news/society/the-shifting-reality-of-knife-crime-in-the-uk/",
    "description": "Despite the ‘broken Britain’ headlines, violent crime is falling – including knife crime. We meet the people helping to make the streets safer\nThe post The shifting reality of knife crime in the UK appeared first on Positive News.",
    "pubDate": "Wed, 11 Feb 2026 10:55:27 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/the-shifting-reality-of-knife-crime-in-the-uk/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Will Pride in Place put communities back in charge of regeneration?",
    "link": "https://www.positive.news/society/will-pride-in-place-put-communities-back-in-charge-of-regeneration/",
    "description": "Tom Pattinson talks to the UK prime minister about a new scheme to help communities revive their neighbourhoods\nThe post Will Pride in Place put communities back in charge of regeneration? appeared first on Positive News.",
    "pubDate": "Fri, 06 Feb 2026 13:09:39 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/will-pride-in-place-put-communities-back-in-charge-of-regeneration/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Transcendental Meditation Found to Calm Genes Associated with Both Aging and Stress",
    "link": "https://www.goodnewsnetwork.org/transcendental-meditation-found-to-calm-genes-associated-with-both-aging-and-stress/",
    "description": "A study looking at how transcendental meditation affects genetic expression found that this popular form of mediation suppressed the activation of genes associated with stress responses. Okay, no surprise there—mediation is a calming, relaxing activity. However, the authors report evidence that the same genes found to be associated in stress response have been newly associated […]\nThe post Transcendental Meditation Found to Calm Genes Associated with Both Aging and Stress appeared first on Good News Network.",
    "pubDate": "Tue, 10 Feb 2026 16:30:55 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/transcendental-meditation-found-to-calm-genes-associated-with-both-aging-and-stress/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Spark: How To Protest",
    "link": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "description": "Welcome back to The Spark, our monthly celebration of how people just like you are creating positive change, one meaningful step at a time. The Spark is generously supported by Laura Rice. Sign up to Reasons to be Cheerful’s weekly newsletter here and you’ll get The Spark in your inbox...\nThe post The Spark: How To Protest appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 02 Feb 2026 14:05:22 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Forests are changing fast and scientists are deeply concerned",
    "link": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "description": "Forests around the world are quietly transforming, and not for the better. A massive global analysis of more than 31,000 tree species reveals that forests are becoming more uniform, increasingly dominated by fast-growing “sprinter” trees, while slow-growing, long-lived species are disappearing. These slower species act as the backbone of forest ecosystems, storing carbon, stabilizing environments, and supporting rich webs of life—especially in tropical regions where biodiversity is highest.",
    "pubDate": "Mon, 09 Feb 2026 02:17:56 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260208233836.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "Scientists discover how life experiences rewrite the immune system",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210040608.htm",
    "description": "Why does the same virus barely faze one person while sending another to the hospital? New research shows the answer lies in a molecular record etched into our immune cells by both our genes and our life experiences. Scientists at the Salk Institute have created a detailed epigenetic map of human immune cells, revealing how inherited traits and past exposures—like infections, vaccines, or even environmental chemicals—shape immune responses in different ways.",
    "pubDate": "Wed, 11 Feb 2026 00:02:01 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210040608.htm",
    "category": "health",
    "positivityScore": 6
  },
  {
    "title": "Kainova Therapeutics Secures $32M CAD to Accelerate Development of Immuno-Oncology and Inflammation Therapies",
    "link": "https://financialpost.com/globe-newswire/kainova-therapeutics-secures-32m-cad-to-accelerate-development-of-immuno-oncology-and-inflammation-therapies",
    "description": "Financing led by Investissement Québec with continued support from long-standing investors Plans include the acceleration of clinical development of breakthrough GPCR targeting treatments for patients MONTREAL and STRASBOURG, France and BOSTON, Feb. 10, 2026 …",
    "pubDate": "2026-02-10T08:04:25Z",
    "source": "Financial Post",
    "sourceUrl": "https://financialpost.com/globe-newswire/kainova-therapeutics-secures-32m-cad-to-accelerate-development-of-immuno-oncology-and-inflammation-therapies",
    "category": "science",
    "author": "GlobeNewswire",
    "positivityScore": 6
  },
  {
    "title": "Reducing OGT and O-GlcNAcylation enhance the anticancer effects of oxaliplatin in SW620 metastatic colorectal cancer cells",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0341971",
    "description": "O-GlcNAcylation, a single attachment of N-acetylglucosamine (GlcNAc) on serine/threonine residues of nuclear-cytoplasmic proteins, is frequently upregulated in various cancers and implicated in several aspects of tumor progression. Growing evidence reports th…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0341971",
    "category": "health",
    "author": "Thirasak Bunsuk, Juthamard Chantaraamporn, Photsathorn Mutapat, Penchatr Diskul Na Ayudthaya, Daranee Chokchaichamnankit, Chantragan Srisomsap, Jisnuson Svasti, Voraratt Champattanachai",
    "positivityScore": 6
  },
  {
    "title": "Gray wolf appears in Los Angeles county for first time in more than 100 years",
    "link": "https://www.theguardian.com/us-news/2026/feb/10/gray-wolf-los-angeles-county",
    "description": "Three-year-old black coat female, known as BEY03F, crossed into LA county around 6am on 7 February\nA gray wolf wandered into Los Angeles county for the first time in more than a century on Saturday morning.\n“This is the most southern verified record of a gray wolf in modern times,” Axel Hunnicutt, gray wolf coordinator for the California department of fish and wildlife, said.\n Continue reading...",
    "pubDate": "Tue, 10 Feb 2026 23:43:21 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2026/feb/10/gray-wolf-los-angeles-county",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "‘The normal should be darkness’: why one Belgian national park is turning off ‘pointless’ streetlights",
    "link": "https://www.theguardian.com/environment/2026/feb/11/lights-belgian-park-lamps-light-polluted-night-time-environment-wildlife",
    "description": "The radical project is an attempt to preserve wildlife in one of Europe’s most light-polluted countries, but can they persuade local people they will still feel safe?\nTwo yellowing street lamps cast a pool of light on the dark road winding into the woods outside Mazée village. This scene is typical for narrow countryside roads in Wallonia in the south of Belgium. “Having lights here is logical,” says André Detournay, 77, who has lived in the village for four decades. “I walk here with my dog and it makes me feel safe and gives me some protection from theft.”\nBelgium glows like a Christmas decoration at night, as witnessed from space. It is one of the most light-polluted countries in Europe, with the Milky Way scarcely visible except in the most remote areas.\n Continue reading...",
    "pubDate": "Wed, 11 Feb 2026 12:00:05 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/11/lights-belgian-park-lamps-light-polluted-night-time-environment-wildlife",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Melting Antarctic ice may weaken a major carbon sink",
    "link": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "description": "Melting ice from West Antarctica once delivered huge amounts of iron to the Southern Ocean, but algae growth did not increase as expected. Researchers found the iron was in a form that marine life could not easily use. This means more melting ice does not automatically boost carbon absorption. In the future, Antarctic ice loss could actually reduce the ocean’s ability to slow climate change.",
    "pubDate": "Wed, 04 Feb 2026 04:32:51 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260204042457.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "When immune cells stop fighting cancer and start helping it",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210040604.htm",
    "description": "Scientists have uncovered a surprising way tumors turn the immune system to their advantage. Researchers at the University of Geneva found that neutrophils—normally frontline defenders against infection—can be reprogrammed inside tumors to fuel cancer growth instead. Once exposed to the tumor environment, these immune cells begin producing a molecule called CCL3 that actively promotes tumor progression.",
    "pubDate": "Tue, 10 Feb 2026 10:28:42 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210040604.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Scientists find a clue to human brain evolution in finger length",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210040559.htm",
    "description": "Human evolution has long been tied to growing brain size, and new research suggests prenatal hormones may have played a surprising role. By studying the relative lengths of index and ring fingers — a clue to oestrogen and testosterone exposure in the womb — researchers found that higher prenatal estrogen was linked to larger head size in newborn boys.",
    "pubDate": "Tue, 10 Feb 2026 09:42:37 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210040559.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "The dark side of green technology: what do electric vehicles really cost?",
    "link": "https://www.nature.com/articles/d41586-026-00385-3",
    "description": "",
    "pubDate": "2026-02-09T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00385-3",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "Quote of the day by George Bernard Shaw: “The reasonable man adapts himself to the world; the unreasonable one persists in trying to adapt the world to himself” Why “the unreasonable man” matters in modern progress",
    "link": "https://economictimes.indiatimes.com/news/international/us/quotes-of-the-day-by-george-bernard-shaw-the-reasonable-man-adapts-himself-to-the-world-the-unreasonable-one-persists-in-trying-to-adapt-the-world-to-himself-why-the-unreasonable-man-matters-in-modern-progress/articleshow/128125864.cms",
    "description": "Quote of the day by George Bernard Shaw: “The reasonable man adapts himself to the world; the unreasonable one persists in trying to adapt the world to himself” George Bernard Shaw, Nobel-winning playwright and social critic, challenged norms for measurable p…",
    "pubDate": "2026-02-10T10:59:13Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/international/us/quotes-of-the-day-by-george-bernard-shaw-the-reasonable-man-adapts-himself-to-the-world-the-unreasonable-one-persists-in-trying-to-adapt-the-world-to-himself-why-the-unreasonable-man-matters-in-modern-progress/articleshow/128125864.cms",
    "category": "science",
    "author": "Piyush Shukla",
    "positivityScore": 4
  },
  {
    "title": "The multi-faceted effects of technology-driven productivity surge in the crop & livestock sector in Greece: Evidence from the FABLE Calculator",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0341900",
    "description": "This paper the effects of a technology-driven increase in crop and livestock productivity on key agricultural, land-use, and environmental indicators in Greece, using the FABLE (Food, Agriculture, Biodiversity, Land Use, and Energy) Calculator. Through empiri…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0341900",
    "category": "climate",
    "author": "Phoebe Koundouri, Konstantinos Dellis, Olympia Miziaki",
    "positivityScore": 4
  },
  {
    "title": "Cyclical loading, daily feeding modality and the saturation response in the developing skull",
    "link": "https://www.nature.com/articles/s41598-026-39109-y",
    "description": "Diet-induced cyclical loading causes elevated bony responses in mammal jaws, an adaptive phenomenon likewise observed between increased locomotor stresses and limb growth. Mammal limbs exhibit reduced mechanosensitivity and osteogenesis after prolonged cyclic…",
    "pubDate": "2026-02-10T00:00:00Z",
    "source": "Nature.com",
    "sourceUrl": "https://www.nature.com/articles/s41598-026-39109-y",
    "category": "wildlife",
    "author": "Susan E. Lad, Hui Ding, Carmen E. Alvarez, Rebecca J. Anderson, William W. Aberger, Frederick T. Lockie, Maryna Chuma, Talia J. Thornton, Olivia P. Heming, Jonathan C. Couri, Jenna M. McKinnon, Hannah M. Morris, Daniel F. Liggio, Eun Suh Sung, Matthew J. Ravosa",
    "positivityScore": 4
  },
  {
    "title": "How did the mongoose save the baby?",
    "link": "https://www.lifesciencesworld.com/how-did-the-mongoose-save-the-baby/",
    "description": "How the Mongoose Saved the Baby: A Tale of Instinct and Protection This article explores the astonishing scenarios of how the mongoose saved the baby, providing a comprehensive understanding of their protective behaviors and challenging common misconceptions …",
    "pubDate": "2026-02-03T01:59:01Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/how-did-the-mongoose-save-the-baby/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 4
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "This ancient animal was one of the first to eat plants on land",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210231546.htm",
    "description": "Hundreds of millions of years ago, the first animals to crawl onto land were strict meat-eaters, even as plants had already taken over the landscape. Now scientists have uncovered a 307-million-year-old fossil that rewrites that story: one of the earliest known land vertebrates to start eating plants. The animal, named Tyrannoroter heberti, was a stocky, football-sized creature with a skull packed with specialized teeth designed for crushing and grinding vegetation.",
    "pubDate": "Wed, 11 Feb 2026 03:19:21 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210231546.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Scientists find genes that existed before all life on Earth",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210082913.htm",
    "description": "Life’s story may stretch further back than scientists once thought. Some genes found in nearly every organism today were already duplicated before all life shared a common ancestor. By tracking these rare genes, researchers can investigate how early cells worked and what features of life emerged first. New computational tools are now helping scientists unlock this hidden chapter of evolution.",
    "pubDate": "Tue, 10 Feb 2026 08:42:05 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210082913.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Your cat’s purr says more than you think",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210040619.htm",
    "description": "Your cat’s purr may say more about who they are than their meow ever could. Scientists discovered that purrs are stable and uniquely identifiable, while meows change dramatically depending on context. Domestic cats, in particular, have evolved highly flexible meows as a way to communicate with humans. The purr, meanwhile, stays constant—making it a reliable marker of individual identity.",
    "pubDate": "Wed, 11 Feb 2026 03:56:29 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210040619.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "A bonobo’s pretend tea party is rewriting what we know about imagination",
    "link": "https://www.sciencedaily.com/releases/2026/02/260210040605.htm",
    "description": "A bonobo named Kanzi surprised scientists by successfully playing along in pretend tea party experiments, tracking imaginary juice and grapes as if they were real. He consistently pointed to the correct locations of pretend items, while still choosing real food when given the option. The results suggest that imagination may not be exclusive to humans after all.",
    "pubDate": "Tue, 10 Feb 2026 23:04:44 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260210040605.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Italy’s Winter Olympics are stunning from space",
    "link": "https://www.sciencedaily.com/releases/2026/02/260209211229.htm",
    "description": "Satellite imagery reveals how the 2026 Winter Olympics are spread across northern Italy, from alpine valleys to historic cities. Events are hosted in mountain resorts, while Milan and Verona frame the Games with opening and closing ceremonies. The view includes iconic features like Lake Garda and the Venetian lagoon. Together, they show the vast scale and unique setting of this year’s Olympics.",
    "pubDate": "Mon, 09 Feb 2026 21:12:29 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260209211229.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Publishing less won’t save the research system",
    "link": "https://www.nature.com/articles/d41586-026-00419-w",
    "description": "",
    "pubDate": "2026-02-10T00:00:00.000Z",
    "source": "Nature",
    "sourceUrl": "https://www.nature.com/articles/d41586-026-00419-w",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Are wetter winters and frequent flooding here to stay?",
    "link": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "description": "Many places across the UK have experienced their wettest January in more than 100 years.",
    "pubDate": "Wed, 11 Feb 2026 02:59:08 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cvgjw0kpd89o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Landmark deal to cut global shipping emissions in tatters after US pressure",
    "link": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "description": "President Trump intervened in the talks calling the deal a \"green scam\".",
    "pubDate": "Fri, 17 Oct 2025 16:31:07 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Nasa's mega Moon rocket arrives at launch pad for Artemis II mission",
    "link": "https://www.bbc.com/news/articles/cly148lvyevo?at_medium=RSS&at_campaign=rss",
    "description": "Final preparations now get underway for the first crewed mission to the Moon in more than 50 years.",
    "pubDate": "Sun, 18 Jan 2026 01:22:46 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cly148lvyevo?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "When does the Nasa Moon mission launch and who are the Artemis II crew?",
    "link": "https://www.bbc.com/news/articles/c0q4w3l0wdvo?at_medium=RSS&at_campaign=rss",
    "description": "The first crewed Moon mission in 50 years could launch in February, ahead of a future lunar landing.",
    "pubDate": "Tue, 03 Feb 2026 13:18:51 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c0q4w3l0wdvo?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "SpaceX pulls off Starship rocket launch in much-needed comeback",
    "link": "https://www.bbc.com/news/articles/cly69z9lwnno?at_medium=RSS&at_campaign=rss",
    "description": "The Starship rocket is critical to the company's hopes of one day carrying people to the Moon and Mars.",
    "pubDate": "Wed, 27 Aug 2025 13:00:47 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cly69z9lwnno?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 2
  },
  {
    "title": "Phenom strengthens AI hiring platform with Be Applied acquisition",
    "link": "https://siliconangle.com/2026/02/10/phenom-strengthens-ai-hiring-platform-applied-acquisition/",
    "description": "Artificial intelligence-based human resources company Phenom People Inc. announced today that it has acquired Be Applied Ltd., an AI-driven cognitive assessment solution provider that validates candidate and employee capabilities at scale, for an undisclosed …",
    "pubDate": "2026-02-10T13:30:39Z",
    "source": "SiliconANGLE News",
    "sourceUrl": "https://siliconangle.com/2026/02/10/phenom-strengthens-ai-hiring-platform-applied-acquisition/",
    "category": "science",
    "author": "Duncan Riley",
    "positivityScore": 2
  },
  {
    "title": "What Is Quantum Computing and Its Future Impact?",
    "link": "https://www.c-sharpcorner.com/article/what-is-quantum-computing-and-its-future-impact/",
    "description": "Explore quantum computing's potential to revolutionize industries like healthcare, finance, and cybersecurity. Discover how it surpasses classical computing limits.",
    "pubDate": "2026-02-10T06:39:06Z",
    "source": "C-sharpcorner.com",
    "sourceUrl": "https://www.c-sharpcorner.com/article/what-is-quantum-computing-and-its-future-impact/",
    "category": "science",
    "author": "noreply@c-sharpcorner.com (Saurav Kumar)",
    "positivityScore": 2
  },
  {
    "title": "Karnataka: Minister Patil urges global health experts to unite & build stronger nations",
    "link": "https://economictimes.indiatimes.com/news/india/karnataka-minister-patil-urges-global-health-experts-to-unite-build-stronger-nations/articleshow/128162973.cms",
    "description": "Karnataka's medical education minister Dr. Sharan Prakash R Patil addressed the World Health Exhibition in Dubai. He emphasized Karnataka's advancements in medical education and healthcare. Dr. Patil called for global cooperation to strengthen nations through…",
    "pubDate": "2026-02-10T14:19:20Z",
    "source": "The Times of India",
    "sourceUrl": "https://economictimes.indiatimes.com/news/india/karnataka-minister-patil-urges-global-health-experts-to-unite-build-stronger-nations/articleshow/128162973.cms",
    "category": "health",
    "author": "ET Bureau",
    "positivityScore": 2
  },
  {
    "title": "BioCardia Files Pre-Submission for FDA Approval of Helix™ Transendocardial Delivery Catheter for Therapeutic and Diagnostic Agent Delivery to the Heart",
    "link": "https://www.globenewswire.com/news-release/2026/02/10/3235432/0/en/BioCardia-Files-Pre-Submission-for-FDA-Approval-of-Helix-Transendocardial-Delivery-Catheter-for-Therapeutic-and-Diagnostic-Agent-Delivery-to-the-Heart.html",
    "description": "SUNNYVALE, Calif., Feb. 10, 2026 (GLOBE NEWSWIRE) -- BioCardia, Inc. [Nasdaq: BCDA], a developer of cellular and cell-derived therapeutics for the treatment of cardiovascular and pulmonary diseases, today reported it has completed its Pre-Submission to FDA un…",
    "pubDate": "2026-02-10T14:15:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/10/3235432/0/en/BioCardia-Files-Pre-Submission-for-FDA-Approval-of-Helix-Transendocardial-Delivery-Catheter-for-Therapeutic-and-Diagnostic-Agent-Delivery-to-the-Heart.html",
    "category": "health",
    "author": "BioCardia, Inc.",
    "positivityScore": 2
  },
  {
    "title": "Prospective Evaluation of Antibody Response post COVID-19 vaccination in older persons ≧ 60 years old (PEARL 60): A longitudinal 15-months study in a tertiary centre in Malaysia",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340891",
    "description": "Older adults exhibit heterogeneous immune responses to COVID-19 vaccination, yet the relative contributions of age, comorbidity, vaccine platform, and infection history to antibody durability remain incompletely defined. Understanding these determinants is es…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340891",
    "category": "health",
    "author": "Kejal Hasmukharay, Ashutosh Kumar Verma, Kiirtaara Aravindhan, Prakhaash Raaj S. Alagappan, Aisya Karynna Md Kamal, Nurul Syuhada Zulhaimi, Nor Izzati Saedon, Jamal I-Ching-Sam, Tan Maw Pin, Reena Rajasuriar",
    "positivityScore": 2
  },
  {
    "title": "Fangzhou’s MaaS Platform Recognized as Industry Leader at Guangdong Digital Economy Conference",
    "link": "https://www.globenewswire.com/news-release/2026/02/10/3235107/0/en/Fangzhou-s-MaaS-Platform-Recognized-as-Industry-Leader-at-Guangdong-Digital-Economy-Conference.html",
    "description": "GUANGZHOU, China, Feb. 10, 2026 (GLOBE NEWSWIRE) -- Fangzhou Inc. (“Fangzhou” or the “Company”) (HKEX: 06086), a leading provider of AI-driven Internet healthcare solutions, received prominent industry recognition at the “Digital Intelligence Powering Guangdo…",
    "pubDate": "2026-02-10T10:56:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/10/3235107/0/en/Fangzhou-s-MaaS-Platform-Recognized-as-Industry-Leader-at-Guangdong-Digital-Economy-Conference.html",
    "category": "health",
    "author": "Fangzhou Inc.",
    "positivityScore": 2
  },
  {
    "title": "Environmental influences on community participation among people with multiple sclerosis: A mixed methods study",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342678",
    "description": "Objective To examine the influence of environmental factors (EFs) and personal factors (PFs) on community participation among people with multiple sclerosis (PwMS) and identify areas for improvement.   Methods A mixed methods explanatory sequential design was…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342678",
    "category": "health",
    "author": "Bishan Yang, Ivan Molton, Andrew Humbert, Carolyn Baylor, Emma Gregg, Dawn Ehde, Jennifer Sullivan, Elysa Lanz, Michael Schiller, Philip Hurvitz, Danbi Lee",
    "positivityScore": 2
  },
  {
    "title": "Effects of pentosan polysulfate sodium on joint structure and function out to six months in naturally-occurring canine osteoarthritis",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342409",
    "description": "Objective To evaluate the durability of effect and disease modification potential of a six-week course of pentosan polysulfate sodium (PPS) therapy out to 26 weeks (six months) in companion dogs with naturally-occurring osteoarthritis.   Design Twenty mixed-b…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342409",
    "category": "health",
    "author": "Catherine J. M. Stapledon, Ravi Krishnan, Rachel A. Peat, Christian Reiter, Marjorie E. Milne, Stewart D. Ryan, Sebastien H. Bauquier, Thierry Beths",
    "positivityScore": 2
  },
  {
    "title": "Acceptability and safety of one versus three months of rifapentine and isoniazid to prevent tuberculosis in people exposed in the household or workplace in Brazil: The Ultra-Curto randomized controlled trial",
    "link": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004758",
    "description": "In a multi-center, randomized controlled trial, Betina Durovni and colleagues assess the acceptability and safety of a short-course tuberculosis preventive therapy taken daily or weekly for different durations by persons recently exposed to tuberculosis. shor…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1004758",
    "category": "health",
    "author": "Betina Durovni, Marcelo Cordeiro-Santos, Solange Cesar Cavalcante, Renata Spener-Gomes, Jamile Garcia, Silvia Cohn, Valeria Saraceni, Beatriz Kohler, Lawrence H. Moulton, Alexandra Brito da Souza, Abiye Berihun, Mark Marzinke, Richard E. Chaisson, the Ultra Curto Study Team",
    "positivityScore": 2
  },
  {
    "title": "Sphingolipid metabolism-related genes B4GALNT1 and CERS4 as prognostic biomarkers in lung adenocarcinoma",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340437",
    "description": "Sphingolipid metabolism is an important component of various biological processes, particularly in cancer pathology. This metabolic pathway significantly influences the behavior of cancer cells by regulating growth, apoptosis, and survival. Although modulatin…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340437",
    "category": "health",
    "author": "Jieun Jeon, Junho Kang, Jae-Hyung Park, Jae-Ho Lee, Dong Eun Kim, Woo-Jae Park, Shin Kim",
    "positivityScore": 2
  },
  {
    "title": "The Long Shadow of the “Jewish Question”",
    "link": "https://www.thenation.com/article/world/long-shadow-of-the-jewish-question/",
    "description": "Joseph Dana\n\n\n\nAfter the Holocaust, Israel was hailed as the solution to an essentially antisemitic debate. Now, as another genocide unfolds—in Gaza—Jews are once again questioning the question.\r\n\n\r\n\n\nThe post The Long Shadow of the “Jewish Question” appeared…",
    "pubDate": "2026-02-10T10:00:00Z",
    "source": "Thenation.com",
    "sourceUrl": "https://www.thenation.com/article/world/long-shadow-of-the-jewish-question/",
    "category": "health",
    "author": "Joseph Dana",
    "positivityScore": 2
  },
  {
    "title": "Spain Construction Equipment Industry Report 2025-2030 Featuring Prominent Vendors - Caterpillar, Komatsu, Volvo, Hitachi, Liebherr, SANY, XCMG, JCB, Kobelco, Zoomlion, Hyundai",
    "link": "https://www.globenewswire.com/news-release/2026/02/10/3235097/28124/en/Spain-Construction-Equipment-Industry-Report-2025-2030-Featuring-Prominent-Vendors-Caterpillar-Komatsu-Volvo-Hitachi-Liebherr-SANY-XCMG-JCB-Kobelco-Zoomlion-Hyundai.html",
    "description": "The Spain Construction Equipment Market is anticipated to grow from 26,800 units in 2024 to 34,966 units by 2030, with a CAGR of 4.53%. Tariffs on non-EU imports like machinery from China and Japan are raising equipment costs by 5-10%, boosting demand for loc…",
    "pubDate": "2026-02-10T10:41:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/10/3235097/28124/en/Spain-Construction-Equipment-Industry-Report-2025-2030-Featuring-Prominent-Vendors-Caterpillar-Komatsu-Volvo-Hitachi-Liebherr-SANY-XCMG-JCB-Kobelco-Zoomlion-Hyundai.html",
    "category": "climate",
    "author": "Research and Markets",
    "positivityScore": 2
  },
  {
    "title": "Mexico Construction Equipment Industry Report 2026-2031 - Caterpillar, LiuGong, Komatsu, Liebherr, Volvo CE, John Deere, XCMG are the Front-runners by Offering a Diverse Set of Equipment",
    "link": "https://www.globenewswire.com/news-release/2026/02/10/3235093/28124/en/Mexico-Construction-Equipment-Industry-Report-2026-2031-Caterpillar-LiuGong-Komatsu-Liebherr-Volvo-CE-John-Deere-XCMG-are-the-Front-runners-by-Offering-a-Diverse-Set-of-Equipment.html",
    "description": "The Mexico construction equipment market, valued at 32,188 units in 2025, is projected to grow at a CAGR of 3.08%, reaching 38,612 units by 2031. Earthmoving equipment, led by excavators, holds the largest market share, driven by the expanding mining sector. …",
    "pubDate": "2026-02-10T10:32:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/10/3235093/28124/en/Mexico-Construction-Equipment-Industry-Report-2026-2031-Caterpillar-LiuGong-Komatsu-Liebherr-Volvo-CE-John-Deere-XCMG-are-the-Front-runners-by-Offering-a-Diverse-Set-of-Equipment.html",
    "category": "climate",
    "author": "Research and Markets",
    "positivityScore": 2
  },
  {
    "title": "How Capitalism Transformed the Natural World",
    "link": "https://www.thenation.com/?post_type=article&p=585125",
    "description": "Kohei Saito\n\n\n\nIn her new book, Alyssa Battistoni explores how nature came to be treated as a supposedly cost-free supplement of capital accumulation. \r\n\n\r\n\n\nThe post How Capitalism Transformed the Natural World appeared first on The Nation.",
    "pubDate": "2026-02-10T10:00:00Z",
    "source": "Thenation.com",
    "sourceUrl": "https://www.thenation.com/?post_type=article&p=585125",
    "category": "climate",
    "author": "Kohei Saito",
    "positivityScore": 2
  },
  {
    "title": "Best Powder Electrolytes (2026)",
    "link": "https://zacjohnson.com/best-powder-electrolytes/",
    "description": "Electrolyte powders have become the go-to hydration solution for athletes, active adults, and anyone dealing with dehydration from exercise, heat, illness, or",
    "pubDate": "2026-02-10T14:00:55Z",
    "source": "Zacjohnson.com",
    "sourceUrl": "https://zacjohnson.com/best-powder-electrolytes/",
    "category": "climate",
    "author": "Zac Johnson",
    "positivityScore": 2
  },
  {
    "title": "Investigations of a new EPS-insulated mortar-free reusable interlocking block for sustainable buildings",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342329",
    "description": "Sustainable, energy-efficient, and reusable construction systems have increasingly been demanded due to the increasing amount of plastics, waste, demolition debris, and the carbon footprints associated with existing traditional materials used in the construct…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0342329",
    "category": "climate",
    "author": "Hui Gao, Moses Mwenda Karani, Li Zuo, Zhongwei Zhao",
    "positivityScore": 2
  },
  {
    "title": "The influence of city size versus urban form on land surface temperature variation and the surface urban heat island effect: A cross-city analysis of German cities",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340060",
    "description": "This paper seeks to: 1) determine the extent of the intra-urban surface urban heat island (SUHI) effect within German cities using novel urbanization-level data with high spatial resolution, and 2) to assess the influence of city size and urban form using thi…",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340060",
    "category": "climate",
    "author": "Regan Doyle, Tobias Leichtle, Stephan Pauleit, Hannes Taubenböck",
    "positivityScore": 2
  },
  {
    "title": "Economic Digest: Nepal’s Business News in a Snap",
    "link": "https://english.khabarhub.com/2026/08/534223/",
    "description": "KATHMANDU: Economic Digest offers a concise yet comprehensive overview of significant business happenings in Nepal, presented in easily digestible summaries. Nepal’s economy is showing mixed signals as political uncertainty ahead of the March 5 elections weig…",
    "pubDate": "2026-02-08T02:15:55Z",
    "source": "Khabarhub.com",
    "sourceUrl": "https://english.khabarhub.com/2026/08/534223/",
    "category": "climate",
    "author": "Khabarhub",
    "positivityScore": 2
  },
  {
    "title": "Ryan Coogler Interview: ‘Sinners,’ Oscar Records, Losing Chadwick",
    "link": "http://www.hollywoodreporter.com/movies/movie-features/ryan-coogler-interview-sinners-oscars-chadwick-boseman-1236500968/",
    "description": "The ‘Sinners' director silenced skeptics by scoring big at the box office and making the most nominated film ever. After a decade of hitmaking, is he finally ready to admit that this is where he deserves to be?",
    "pubDate": "2026-02-10T14:00:00Z",
    "source": "Hollywood Reporter",
    "sourceUrl": "http://www.hollywoodreporter.com/movies/movie-features/ryan-coogler-interview-sinners-oscars-chadwick-boseman-1236500968/",
    "category": "climate",
    "author": "David Canfield",
    "positivityScore": 2
  },
  {
    "title": "South Africa records decline in rhino poaching",
    "link": "https://www.rt.com/africa/632253-south-africa-records-decline-rhino-poaching/",
    "description": "South Africa’s Forestry Ministry has reported that 352 rhinos were poached in the country in 2025, down from 420 in 2024 Read Full Article at RT.com",
    "pubDate": "2026-02-10T12:44:46Z",
    "source": "RT",
    "sourceUrl": "https://www.rt.com/africa/632253-south-africa-records-decline-rhino-poaching/",
    "category": "wildlife",
    "author": "RT",
    "positivityScore": 2
  },
  {
    "title": "Consultations open on four new fisheries management plans",
    "link": "https://www.gov.uk/government/news/consultations-open-on-four-new-fisheries-management-plans",
    "description": "Fisheries management plans secure the long-term sustainability of UK fish stocks",
    "pubDate": "2026-02-10T10:14:20Z",
    "source": "Www.gov.uk",
    "sourceUrl": "https://www.gov.uk/government/news/consultations-open-on-four-new-fisheries-management-plans",
    "category": "wildlife",
    "author": "Department for Environment, Food & Rural Affairs",
    "positivityScore": 2
  },
  {
    "title": "Capital projects pose challenge to wildlife conservation, says PS Museiya",
    "link": "https://www.standardmedia.co.ke/health/health-science/article/2001540530/capital-projects-pose-challenge-to-wildlife-conservation-says-ps-museiya",
    "description": "The ongoing capital projects have displaced tens of animals while exposing others to poachers, leading to a drop in the number of some species.",
    "pubDate": "2026-02-10T12:15:36Z",
    "source": "Standard Digital",
    "sourceUrl": "https://www.standardmedia.co.ke/health/health-science/article/2001540530/capital-projects-pose-challenge-to-wildlife-conservation-says-ps-museiya",
    "category": "wildlife",
    "author": "Antony Gitonga",
    "positivityScore": 2
  },
  {
    "title": "The hidden cost of beef",
    "link": "https://theecologist.org/2026/feb/10/hidden-cost-beef",
    "description": "Brazil’s Cerrado is being transformed by industrial agriculture - with British trade playing a direct role in the loss of water systems, biodiversity and climate stability.",
    "pubDate": "2026-02-10T10:09:33Z",
    "source": "Theecologist.org",
    "sourceUrl": "https://theecologist.org/2026/feb/10/hidden-cost-beef",
    "category": "wildlife",
    "author": "brendan",
    "positivityScore": 2
  },
  {
    "title": "STARFLEET ACADEMY Explains What Became of the Klingons in the 32nd Century",
    "link": "https://nerdist.com/article/star-trek-starfleet-academy-what-happened-klingons-32nd-century/",
    "description": "Episode four of Star Trek: Starfleet Academy finally explains what became of the mighty Klingon Empire in the 32 century.\nThe post STARFLEET ACADEMY Explains What Became of the Klingons in the 32nd Century appeared first on Nerdist.",
    "pubDate": "2026-01-29T08:00:00Z",
    "source": "Nerdist",
    "sourceUrl": "https://nerdist.com/article/star-trek-starfleet-academy-what-happened-klingons-32nd-century/",
    "category": "wildlife",
    "author": "Eric Diaz",
    "positivityScore": 2
  },
  {
    "title": "Pet Sanctuary Takes in Overflow from Homeless Shelter Amid Unprecedented Cold Snap",
    "link": "https://www.goodnewsnetwork.org/pet-sanctuary-takes-in-overflow-from-homeless-shelter-amid-unprecedented-cold-snap/",
    "description": "A cat shelter in Green Bay has opened its doors to anyone seeking shelter from the Siberian temperatures pummeling the Midwest this week. Safe Haven Pet Sanctuary typically takes in felines in need of special assistance and care for blindness or other disabilities, but with warming shelters so crowded they’re turning people away, management has […]\nThe post Pet Sanctuary Takes in Overflow from Homeless Shelter Amid Unprecedented Cold Snap appeared first on Good News Network.",
    "pubDate": "Wed, 11 Feb 2026 09:00:49 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/pet-sanctuary-takes-in-overflow-from-homeless-shelter-amid-unprecedented-cold-snap/",
    "category": "general",
    "positivityScore": -1
  },
  {
    "title": "Good News in History, February 11",
    "link": "https://www.goodnewsnetwork.org/events070211/",
    "description": "100 years ago today, one of the most iconic chefs in the modern era, Paul Bocuse, was born. Bocuse is credited with many things, and it’s difficult to summarize his accomplishments and legacy but to name a few, he has been named “Chef of the Century,” holds the record for consecutive yearly 3-star awards by […]\nThe post Good News in History, February 11 appeared first on Good News Network.",
    "pubDate": "Wed, 11 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070211/",
    "category": "general",
    "positivityScore": -1
  },
  {
    "title": "Frog Wiped Out by Disease Returns to the Wild With the Help of ‘Frog Spas’ and ‘Frog Saunas’",
    "link": "https://www.goodnewsnetwork.org/beautiful-australian-frog-returns-to-the-wild-with-the-help-of-frog-spas-and-frog-saunas/",
    "description": "This beautiful amphibian is being reintroduced to wetlands around Australia’s capital of Canberra after suffering a population collapse due to chytrid fungus. Called the green and golden bell frog, these animals were bred in captivity and will be released in groups of 15 into ponds and wetlands having been immunized against a disease caused by […]\nThe post Frog Wiped Out by Disease Returns to the Wild With the Help of ‘Frog Spas’ and ‘Frog Saunas’ appeared first on Good News Network.",
    "pubDate": "Tue, 10 Feb 2026 19:30:23 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/beautiful-australian-frog-returns-to-the-wild-with-the-help-of-frog-spas-and-frog-saunas/",
    "category": "general",
    "positivityScore": -1
  },
  {
    "title": "Good News in History, February 8",
    "link": "https://www.goodnewsnetwork.org/events070208/",
    "description": "58 years ago today, Planet of the Apes starring Charlton Heston was released in theaters. In the film, an astronaut crew crash-lands on a strange planet in the distant future. Although the planet appears desolate at first, the surviving crew members stumble upon a society in which apes have evolved into creatures with human-like intelligence and speech. […]\nThe post Good News in History, February 8 appeared first on Good News Network.",
    "pubDate": "Sun, 08 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070208/",
    "category": "general",
    "positivityScore": -3
  }
]