[
  {
    "title": "Study Shows Vaporizing E-Waste Makes it Easy to Recover Precious Metals at 13-Times Lower Costs",
    "link": "https://www.goodnewsnetwork.org/study-shows-vaporizing-e-waste-makes-it-easy-to-recover-precious-metals-at-13-times-lower-costs/",
    "description": "By instantaneously heating electronics to 3,000°C via an electrical current, scientists have found a way to extract decent grades of precious metals without creating hazardous waste. According to their analysis, relying on e-waste for a precious metals supply could be 13-times cheaper than mining them from the ground. However, previous methods have involved throwing this […]\nThe post Study Shows Vaporizing E-Waste Makes it Easy to Recover Precious Metals at 13-Times Lower Costs appeared first on Good News Network.",
    "pubDate": "Tue, 03 Feb 2026 14:00:29 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/study-shows-vaporizing-e-waste-makes-it-easy-to-recover-precious-metals-at-13-times-lower-costs/",
    "category": "general",
    "positivityScore": 13
  },
  {
    "title": "Acupuncture for Rescued Elephants Provides Relief from Chronic Pain and Nerve Damage in India Care Center",
    "link": "https://www.goodnewsnetwork.org/acupuncture-for-rescued-elephants-provides-relief-from-chronic-pain-and-nerve-damage-in-india-care-center/",
    "description": "The largest wildlife rescue organization in India has started using acupuncture to help elephants recover from chronic pain, nerve damage, and mobility issues after their years of captivity or hard labor. Their veterinary team sought training in alternative medicine so the techniques could be used alongside conventional veterinary medicine and found they boosted recovery rates […]\nThe post Acupuncture for Rescued Elephants Provides Relief from Chronic Pain and Nerve Damage in India Care Center appeared first on Good News Network.",
    "pubDate": "Sun, 01 Feb 2026 16:25:09 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/acupuncture-for-rescued-elephants-provides-relief-from-chronic-pain-and-nerve-damage-in-india-care-center/",
    "category": "general",
    "positivityScore": 13
  },
  {
    "title": "Here’s why US household energy bills are soaring – and how to fix it | Mark Wolfe",
    "link": "https://www.theguardian.com/commentisfree/2026/feb/03/us-energy-bills-trump",
    "description": "Trump has prioritized fossil fuel companies over consumers, hitting the lowest-income families hardest\nDonald Trump promised to cut energy prices by 50%. Instead, average electricity prices over the past year have risen by about 6.7%, while natural gas prices have increased by 10.8%. Energy prices are influenced by many factors beyond any president’s direct control, including market conditions, weather-driven demand, regional infrastructure constraints and the rapid growth of energy-intensive datacenters that are driving new system costs. Policy choices do not determine prices on their own, but they do shape market outcomes, and the direction of this administration’s energy policy has been clear.\nFrom his first days in office, President Trump made clear that his energy agenda would prioritize fossil fuel producers over consumers. His administration moved to expand US liquefied natural gas exports, increasing exposure to volatile global markets. At the same time, it froze wind power projects that provide some of the cheapest new electricity, intervened to keep costly coal plants running, and backed the elimination of energy-efficiency tax credits that lower household energy bills.\nMark Wolfe is executive director of National Energy Assistance Directors Association, co-director of the Center on Energy Poverty and Climate and adjunct faculty at the Trachtenberg School of Public Policy at George Washington University\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 15:00:02 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/commentisfree/2026/feb/03/us-energy-bills-trump",
    "category": "climate",
    "positivityScore": 12
  },
  {
    "title": "A natural aging molecule may help restore memory in Alzheimer’s",
    "link": "https://www.sciencedaily.com/releases/2026/01/260124003829.htm",
    "description": "Researchers have found that a natural aging-related molecule can repair key memory processes affected by Alzheimer’s disease. The compound improves communication between brain cells and restores early memory abilities that typically fade first. Because it already exists in the body and declines with age, boosting it may offer a safer way to protect the brain. The discovery hints at a new strategy for slowing cognitive ageing before severe damage sets in.",
    "pubDate": "Sun, 25 Jan 2026 02:17:02 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260124003829.htm",
    "category": "health",
    "positivityScore": 12
  },
  {
    "title": "Shear comfort, the sheep helping people unload their worries",
    "link": "https://www.positive.news/lifestyle/health/shear-comfort-the-sheep-helping-people-unload-their-worries/",
    "description": "A Yorkshire therapist has discovered her intuitive flock of sheep has an unexpected route to emotional healing\nThe post Shear comfort, the sheep helping people unload their worries appeared first on Positive News.",
    "pubDate": "Tue, 03 Feb 2026 07:00:51 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/lifestyle/health/shear-comfort-the-sheep-helping-people-unload-their-worries/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "What went right this week: Europe’s energy ‘tipping point’, plus more",
    "link": "https://www.positive.news/society/good-news-stories-from-week-4-of-2026/",
    "description": "Europe’s green energy ‘tipping point’, a US cancer milestone, and a big beast released, plus more\nThe post What went right this week: Europe’s energy ‘tipping point’, plus more appeared first on Positive News.",
    "pubDate": "Fri, 23 Jan 2026 04:30:20 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/good-news-stories-from-week-4-of-2026/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "The energy inside: three people powering the green transition",
    "link": "https://www.positive.news/environment/the-energy-inside-three-people-powering-the-green-transition/",
    "description": "Behind the green transition are the people whose work and lives are shaped by the winds of change\nThe post The energy inside: three people powering the green transition appeared first on Positive News.",
    "pubDate": "Thu, 22 Jan 2026 13:50:05 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/environment/the-energy-inside-three-people-powering-the-green-transition/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "13-year-old Ditches Lifejacket and Makes ‘Superhuman’ Swim to Save Family Swept out to Sea",
    "link": "https://www.goodnewsnetwork.org/13-year-old-ditches-lifejacket-and-makes-superhuman-swim-to-save-family-swept-out-to-sea/",
    "description": "A 13-year-old boy has been hailed as a hero after swimming 4 hours through rough seas to rescue his family. A family of 4 was enjoying a holiday in Australia’s southwest coast near Quindalup when strong winds blew their inflatable paddleboards out to sea. The boy was separated from his mom and 2 siblings before […]\nThe post 13-year-old Ditches Lifejacket and Makes ‘Superhuman’ Swim to Save Family Swept out to Sea appeared first on Good News Network.",
    "pubDate": "Tue, 03 Feb 2026 16:30:55 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/13-year-old-ditches-lifejacket-and-makes-superhuman-swim-to-save-family-swept-out-to-sea/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "At 67,800-years-old, These Handprints Just Discovered in Indonesia Are Oldest Example of Rock Art",
    "link": "https://www.goodnewsnetwork.org/at-67800-years-old-these-handprints-just-discovered-in-indonesia-are-oldest-example-of-rock-art/",
    "description": "The discovery of stylized handprints dating back at least 67,800 years in a limestone cave in Indonesia has broken the country’s own record for the world’s oldest-known example of rock art. It provides direct evidence that humans have been crossing the sea intentionally for nearly 70,000 years, as Man traveled from the Asian continent across […]\nThe post At 67,800-years-old, These Handprints Just Discovered in Indonesia Are Oldest Example of Rock Art appeared first on Good News Network.",
    "pubDate": "Mon, 02 Feb 2026 16:20:22 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/at-67800-years-old-these-handprints-just-discovered-in-indonesia-are-oldest-example-of-rock-art/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "Nebraska Woman Learns to Row, Then Becomes First Female to Cross the Atlantic Alone in 3,000 Mile Race",
    "link": "https://www.goodnewsnetwork.org/nebraska-woman-learns-to-row-then-becomes-first-female-to-cross-the-atlantic-alone-in-3000-mile-race/",
    "description": "The ocean dreams took hold of Taryn Smith when she was living in landlocked Nebraska, craving open-water adventures as a young adult in Omaha. Smith, who’s now 25, read an article about an all-female rowing team that set a world record in the Great Pacific Race in 2022, rowing from Monterrey, California to Hawaii in […]\nThe post Nebraska Woman Learns to Row, Then Becomes First Female to Cross the Atlantic Alone in 3,000 Mile Race appeared first on Good News Network.",
    "pubDate": "Sun, 01 Feb 2026 23:31:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/nebraska-woman-learns-to-row-then-becomes-first-female-to-cross-the-atlantic-alone-in-3000-mile-race/",
    "category": "general",
    "positivityScore": 11
  },
  {
    "title": "A field of wheat becomes the world’s largest living photograph",
    "link": "https://www.positive.news/environment/a-field-of-wheat-becomes-the-worlds-largest-living-photograph/",
    "description": "Farming Photographs will see a field divided into ‘pixels’ of different wheats to grow a photographic-style artwork\nThe post A field of wheat becomes the world’s largest living photograph appeared first on Positive News.",
    "pubDate": "Mon, 02 Feb 2026 07:00:13 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/environment/a-field-of-wheat-becomes-the-worlds-largest-living-photograph/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Revolutionary therapy treats ‘untreatable’ blood cancer",
    "link": "https://www.positive.news/society/revolutionary-therapy-treats-untreatable-blood-cancer/",
    "description": "Gene therapy which turns white blood cells into a disease-busting “living drug” has reversed previously untreatable blood cancers\nThe post Revolutionary therapy treats ‘untreatable’ blood cancer appeared first on Positive News.",
    "pubDate": "Thu, 29 Jan 2026 14:34:58 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/revolutionary-therapy-treats-untreatable-blood-cancer/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Good News in History, February 3",
    "link": "https://www.goodnewsnetwork.org/events070203/",
    "description": "40 years ago today, a group of computer animators started Pixar Animation Studios out of a corporate spin-off from Lucasfilm. Pixar would go on to make their first film Toy Story, 9 years later, and over the following 20 years become the most critically admired animation studio in the world. After being turned down 45 […]\nThe post Good News in History, February 3 appeared first on Good News Network.",
    "pubDate": "Tue, 03 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070203/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Astonishing 1,400-year-old Tomb Featuring Giant Owl Sculpture Discovered in Mexico",
    "link": "https://www.goodnewsnetwork.org/astonishing-1400-year-old-tomb-featuring-giant-owl-sculpture-discovered-in-mexico/",
    "description": "It’s being called the most significant archaeological discovery in a decade: a tomb dating back 1,400 years decorated with murals and carvings of exquisite preservation. Belonging to one of Mexico’s non-Mayan native cultures, the Zapotecs, its most striking feature is a frieze of an enormous owl head, with a man’s face trapped in its beak. […]\nThe post Astonishing 1,400-year-old Tomb Featuring Giant Owl Sculpture Discovered in Mexico appeared first on Good News Network.",
    "pubDate": "Mon, 02 Feb 2026 12:00:51 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/astonishing-1400-year-old-tomb-featuring-giant-owl-sculpture-discovered-in-mexico/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Math Teacher Becomes UK Scrabble Champ, Reveals the 2-Letter Words Experts Use to Win",
    "link": "https://www.goodnewsnetwork.org/math-teacher-becomes-uk-scrabble-champ-reveals-the-2-letter-words/",
    "description": "A math teacher recently became the top female Scrabble champion in the UK—scoring 1,000 points more than her opponents. Natalie Zolty outsmarted scrabble grandmaster Gary Oliver to claim the top spot by playing the word ‘zendiks’, which means heretics or unbelievers. The 61-year-old won the top division during the UK Open competition held January 9th […]\nThe post Math Teacher Becomes UK Scrabble Champ, Reveals the 2-Letter Words Experts Use to Win appeared first on Good News Network.",
    "pubDate": "Sun, 01 Feb 2026 18:33:52 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/math-teacher-becomes-uk-scrabble-champ-reveals-the-2-letter-words/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "One Armed Golfer Gets Hole-in-One After Learning the Game Since His Accident: ‘Golf Gave me the Will to Live’",
    "link": "https://www.goodnewsnetwork.org/one-armed-golfer-gets-hole-in-one-after-learning-the-game-since-his-accident/",
    "description": "Golfers as old as 103 have hit holes-in-one—but have you ever heard of the feat being achieved by someone with only one arm? But recently, an Irish golfer celebrated sinking his first ever hole-in-one, after learning how to play the game since an accident left him with only one arm. A physically-challenged golfer is celebrating […]\nThe post One Armed Golfer Gets Hole-in-One After Learning the Game Since His Accident: ‘Golf Gave me the Will to Live’ appeared first on Good News Network.",
    "pubDate": "Sat, 31 Jan 2026 19:59:49 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/one-armed-golfer-gets-hole-in-one-after-learning-the-game-since-his-accident/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Helping with Grandkids May Protect Against Cognitive Decline, Shows New Research",
    "link": "https://www.goodnewsnetwork.org/helping-with-grandkids-may-protect-against-cognitive-decline-new-research/",
    "description": "Being an involved grandparent is good for the brain, according to a new study which showed that caring for grandchildren may serve as a “buffer” against cognitive decline and dementia in older adults. “Many grandparents provide regular care for their grandchildren—care that supports families, and society more broadly—but an open question is whether caregiving for […]\nThe post Helping with Grandkids May Protect Against Cognitive Decline, Shows New Research appeared first on Good News Network.",
    "pubDate": "Sat, 31 Jan 2026 16:07:39 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/helping-with-grandkids-may-protect-against-cognitive-decline-new-research/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Polar Bears are in Better Physical Shape than 25 Years Ago, Despite Sea Ice Losses",
    "link": "https://www.goodnewsnetwork.org/polar-bears-are-in-better-physical-shape-than-25-years-ago-despite-sea-ice-losses/",
    "description": "Polar bears are in better physical health than they were 25 years ago, despite the decrease in sea ice, reveals new research. The well-being of the iconic white mammals living around the Norwegian island of Svalbard has improved in the face of climate change, likely due to better opportunities to hunt. The scientists were ‘surprised’ […]\nThe post Polar Bears are in Better Physical Shape than 25 Years Ago, Despite Sea Ice Losses appeared first on Good News Network.",
    "pubDate": "Sat, 31 Jan 2026 15:08:06 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/polar-bears-are-in-better-physical-shape-than-25-years-ago-despite-sea-ice-losses/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Kentucky’s Rural and Urban Communities Unite over Climate Change",
    "link": "https://reasonstobecheerful.world/kentucky-communities-unite-over-climate-change/",
    "description": "This story was originally published by Next City, a nonprofit newsroom reporting on solutions for equitable and just cities, and The CivicLex Weekly, a newsroom covering local government in Lexington, Kentucky. Two myths tend to shape how people talk about Kentucky and climate change. One is that the state is a “climate...\nThe post Kentucky’s Rural and Urban Communities Unite over Climate Change appeared first on Reasons to be Cheerful.",
    "pubDate": "Tue, 27 Jan 2026 16:03:38 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/kentucky-communities-unite-over-climate-change/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "The Nationwide Photo Project Preserving India’s Architecture",
    "link": "https://reasonstobecheerful.world/india-amit-pasricha-photography-preserve-architecture/",
    "description": "In the town of Jaisalmer in the western Indian state of Rajasthan, Patwon Ki Haveli shimmers in the haze of the Thar Desert, not far from its famed golden fort. With intricately carved balconies, courtyards where shadows dance as light filters through latticed windows, and rooms that echo with history,...\nThe post The Nationwide Photo Project Preserving India’s Architecture appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 19 Jan 2026 08:00:04 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/india-amit-pasricha-photography-preserve-architecture/",
    "category": "general",
    "positivityScore": 9
  },
  {
    "title": "Plan to allow fishing around Chagos Islands alarms conservationists",
    "link": "https://www.theguardian.com/world/2026/feb/03/conservationists-oppose-proposal-allow-fishing-chagos-islands",
    "description": "Chagossian people would be allowed to fish in area that has teemed with life since ban was introduced in 2010\nOne of the most precious marine reserves in the world, home to sharks, turtles and rare tropical fish, will be opened to some fishing for the first time in 16 years under the UK government’s deal to hand back the Chagos Islands to Mauritius.\nAllowing non-commercial fishing in the marine protected area (MPA) is seen as an essential part of the Chagossian people’s return to the islands, as the community previously relied on fishing as their main livelihood. But some conservationists have raised the alarm, as nature has thrived in the waters of the Indian Ocean since it was protected from fishing.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 12:08:08 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2026/feb/03/conservationists-oppose-proposal-allow-fishing-chagos-islands",
    "category": "climate",
    "positivityScore": 8
  },
  {
    "title": "New catalyst turns carbon dioxide into clean fuel source",
    "link": "https://www.sciencedaily.com/releases/2026/02/260203030548.htm",
    "description": "Researchers have found that manganese, an abundant and inexpensive metal, can be used to efficiently convert carbon dioxide into formate, a potential hydrogen source for fuel cells. The key was a clever redesign that made the catalyst last far longer than similar low-cost materials. Surprisingly, the improved manganese catalyst even beat many expensive precious-metal options. The discovery could help turn greenhouse gas into clean energy ingredients.",
    "pubDate": "Tue, 03 Feb 2026 06:08:34 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260203030548.htm",
    "category": "climate",
    "positivityScore": 8
  },
  {
    "title": "Scientists discover protein that could heal leaky gut and ease depression",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201231240.htm",
    "description": "Chronic stress can damage the gut’s protective lining, triggering inflammation that may worsen depression. New research shows that stress lowers levels of a protein called Reelin, which plays a key role in both gut repair and brain health. Remarkably, a single injection restored Reelin levels and produced antidepressant-like effects in preclinical models. The findings hint at a future treatment that targets depression through the gut–brain connection.",
    "pubDate": "Mon, 02 Feb 2026 11:37:15 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201231240.htm",
    "category": "health",
    "positivityScore": 8
  },
  {
    "title": "Government rolls back nature protections to boost housing",
    "link": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "description": "Critics say government changes to a flagship biodiversity policy could stall nature recovery.",
    "pubDate": "Tue, 16 Dec 2025 17:51:04 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/c3r7zp418p8o?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 8
  },
  {
    "title": "Conductive Ink Market to Reach US$ 6.24 Billion by 2035 Driven by Solar Photovoltaics, Flexible Electronics, and EV Printed Electronics Says Astute Analytica",
    "link": "https://www.globenewswire.com/news-release/2026/02/02/3230253/0/en/Conductive-Ink-Market-to-Reach-US-6-24-Billion-by-2035-Driven-by-Solar-Photovoltaics-Flexible-Electronics-and-EV-Printed-Electronics-Says-Astute-Analytica.html",
    "description": "The global conductive ink market growth is driven by rapid adoption in photovoltaic (solar) manufacturing and flexible electronics. Key trends include increased silver paste usage in heterojunction (HJT) solar cells and advancements in conductive materials. T…",
    "pubDate": "2026-02-02T13:20:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/02/3230253/0/en/Conductive-Ink-Market-to-Reach-US-6-24-Billion-by-2035-Driven-by-Solar-Photovoltaics-Flexible-Electronics-and-EV-Printed-Electronics-Says-Astute-Analytica.html",
    "category": "health",
    "author": "AstuteAnalytica India Pvt. Ltd.",
    "positivityScore": 8
  },
  {
    "title": "Limbal Stem Cell Deficiency Market Set to Transform During the Forecast Period (2025–2034) With Innovative Treatment Advances | DelveInsight",
    "link": "https://www.globenewswire.com/news-release/2026/02/02/3230533/0/en/Limbal-Stem-Cell-Deficiency-Market-Set-to-Transform-During-the-Forecast-Period-2025-2034-With-Innovative-Treatment-Advances-DelveInsight.html",
    "description": "The dynamics of the limbal stem cell deficiency drugs market are anticipated to change owing to improvements in research and development, rising prevalence, and an aging population. Additionally, the expected launch of emerging therapies, such as Claris Bioth…",
    "pubDate": "2026-02-02T18:00:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/02/3230533/0/en/Limbal-Stem-Cell-Deficiency-Market-Set-to-Transform-During-the-Forecast-Period-2025-2034-With-Innovative-Treatment-Advances-DelveInsight.html",
    "category": "health",
    "author": "DelveInsight Business Research LLP",
    "positivityScore": 8
  },
  {
    "title": "‘We just have to stop doing bad things and do good things’",
    "link": "https://www.positive.news/lifestyle/arts/we-just-have-to-stop-doing-bad-things-and-do-good-things/",
    "description": "Acclaimed novelist Ian McEwan argues that the future is still very much in our hands\nThe post ‘We just have to stop doing bad things and do good things’ appeared first on Positive News.",
    "pubDate": "Wed, 28 Jan 2026 13:30:02 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/lifestyle/arts/we-just-have-to-stop-doing-bad-things-and-do-good-things/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Behind the scenes of the first Positive News video podcast",
    "link": "https://www.positive.news/economics/good-business/behind-the-scenes-of-the-purpose-pioneers-podcast/",
    "description": "What it took to turn an idea into a podcast, and the conversations that emerged along the way\nThe post Behind the scenes of the first Positive News video podcast appeared first on Positive News.",
    "pubDate": "Tue, 27 Jan 2026 11:24:33 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/economics/good-business/behind-the-scenes-of-the-purpose-pioneers-podcast/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "New anthology rewrites the story of homelessness",
    "link": "https://www.positive.news/society/new-anthology-rewrites-the-story-of-homelessness/",
    "description": "Writers with experience of homelessness share tales of overcoming adversity in a new book\nThe post New anthology rewrites the story of homelessness appeared first on Positive News.",
    "pubDate": "Mon, 26 Jan 2026 21:21:57 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/new-anthology-rewrites-the-story-of-homelessness/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Life after: a terminal diagnosis",
    "link": "https://www.positive.news/society/life-after-a-terminal-diagnosis/",
    "description": "Faced with a terminal diagnosis, 27-year-old sailor Jazz Turner now plans to sail unassisted around the world\nThe post Life after: a terminal diagnosis appeared first on Positive News.",
    "pubDate": "Fri, 23 Jan 2026 14:37:12 +0000",
    "source": "Positive News",
    "sourceUrl": "https://www.positive.news/society/life-after-a-terminal-diagnosis/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Farmers’ Kids Cuddle Up with New Born Calf on the Couch After She Nearly Froze Outside",
    "link": "https://www.goodnewsnetwork.org/farmers-kids-cuddle-up-with-new-born-calf-on-the-couch-after-she-nearly-froze-outside/",
    "description": "Over last weekend, a Kentucky farming family welcomed a new calf into a frigid world of single digit temperatures, and quickly realized it wasn’t going to last the night. So being a mother as well as a farmer, Macey Sorrell decided to bring the calf into their home where she was certain it would be […]\nThe post Farmers’ Kids Cuddle Up with New Born Calf on the Couch After She Nearly Froze Outside appeared first on Good News Network.",
    "pubDate": "Tue, 03 Feb 2026 12:00:29 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/farmers-kids-cuddle-up-with-new-born-calf-on-the-couch-after-she-nearly-froze-outside/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "January 14th Marked the Longest Period Without a Nuclear Detonation Since the Atomic Age Began",
    "link": "https://www.goodnewsnetwork.org/january-14th-marked-the-longest-period-without-a-nuclear-detonation-since-the-atomic-age-began/",
    "description": "8 years, 4 months, and 29 days—that’s how long it’s been since the last nuclear weapon was detonated on Earth—and it’s also the longest such timespan since the nuclear age began. Since that fateful day in the sands of America’s southwest in 1945, it’s actually rather mind-boggling how many nuclear weapons have been donated. Dylan […]\nThe post January 14th Marked the Longest Period Without a Nuclear Detonation Since the Atomic Age Began appeared first on Good News Network.",
    "pubDate": "Mon, 02 Feb 2026 19:30:13 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/january-14th-marked-the-longest-period-without-a-nuclear-detonation-since-the-atomic-age-began/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "New Ultrasonic Imaging System Can Detect Deadly Defects in All Types of Concrete",
    "link": "https://www.goodnewsnetwork.org/new-ultrasonic-imaging-system-can-detect-deadly-defects-in-all-types-of-concrete/",
    "description": "If a physician needs to see what’s gone wrong inside a human body, it’s easy enough to order an ultrasound scan. But if the structural engineer wants to do the same in a block of concrete, his options are of limited effectiveness. The range of materials that concrete contains, such as stone, clay, chalk, slate, […]\nThe post New Ultrasonic Imaging System Can Detect Deadly Defects in All Types of Concrete appeared first on Good News Network.",
    "pubDate": "Mon, 02 Feb 2026 14:00:49 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/new-ultrasonic-imaging-system-can-detect-deadly-defects-in-all-types-of-concrete/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, February 2",
    "link": "https://www.goodnewsnetwork.org/events070202/",
    "description": "150 years ago today, the National League of Professional Baseball Clubs was formed. The older of the two leagues that make up Major League Baseball (MLB) in the US and Canada, it is the oldest professional team sports league still in existence in the world. The American League was founded 25 years later and after […]\nThe post Good News in History, February 2 appeared first on Good News Network.",
    "pubDate": "Mon, 02 Feb 2026 08:00:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070202/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Teens Build Igloo That Brings Together the Neighborhood After Difficult Ice Storm – LOOK",
    "link": "https://www.goodnewsnetwork.org/teens-build-igloo-that-brings-the-community-together-after-ice-storm/",
    "description": "While millions of Americans hunkered down in their homes after ice storms encrusted the mid-Atlantic, two young teens got busy building community spirit—by building an igloo. They constructed their igloo in front of a house that was destroyed by a house fire a few months ago. Adeline Sutich and her friend Maeve Ritchotte carved dozens […]\nThe post Teens Build Igloo That Brings Together the Neighborhood After Difficult Ice Storm – LOOK appeared first on Good News Network.",
    "pubDate": "Sun, 01 Feb 2026 21:46:11 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/teens-build-igloo-that-brings-the-community-together-after-ice-storm/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny",
    "link": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-1-31-2026/",
    "description": "Our partner Rob Brezsny, who has a new book out, Astrology Is Real: Revelations from My Life as an Oracle, provides his weekly wisdom to enlighten our thinking and motivate our mood. Rob’s Free Will Astrology, is a syndicated weekly column appearing in over a hundred publications. He is also the author of Pronoia Is the Antidote […]\nThe post Your Weekly Horoscope – ‘Free Will Astrology’ by Rob Brezsny appeared first on Good News Network.",
    "pubDate": "Sat, 31 Jan 2026 11:00:34 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/horoscope-from-rob-brezsnys-free-will-astrology-1-31-2026/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "Good News in History, January 31",
    "link": "https://www.goodnewsnetwork.org/events070131/",
    "description": "56 years ago today, My Sweet Lord by George Harrison reached number 1 on the UK pop charts. It would hold the same position in the US, Ireland, Canada, Australia, Belgium, Sweden, Switzerland, West Germany, Japan, and others. His first single as a solo artist, the song was the first number-one single by an ex-Beatle. It […]\nThe post Good News in History, January 31 appeared first on Good News Network.",
    "pubDate": "Sat, 31 Jan 2026 08:30:00 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/events070131/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Spark: How To Protest",
    "link": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "description": "Welcome back to The Spark, our monthly celebration of how people just like you are creating positive change, one meaningful step at a time. The Spark is generously supported by Laura Rice. Sign up to Reasons to be Cheerful’s weekly newsletter here and you’ll get The Spark in your inbox...\nThe post The Spark: How To Protest appeared first on Reasons to be Cheerful.",
    "pubDate": "Mon, 02 Feb 2026 14:05:22 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/the-spark-how-to-protest/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Affordable Daycare That Keeps Parents Close",
    "link": "https://reasonstobecheerful.world/little-break-coworking-space-on-site-child-care-michigan/",
    "description": "Saja Khuder was set to return to her job with a pharmaceutical firm after maternity leave. At the last minute, her child care plans fell through. Chase Mateusiak, a bioinformatician, was using a daycare that was “fine” but expensive — and which left his 18-month-old son “exhausted and unhappy” after...\nThe post The Affordable Daycare That Keeps Parents Close appeared first on Reasons to be Cheerful.",
    "pubDate": "Thu, 29 Jan 2026 08:00:43 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/little-break-coworking-space-on-site-child-care-michigan/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "What We’re Reading: The Payphone Experiment Bridging Political Divides",
    "link": "https://reasonstobecheerful.world/what-were-reading-payphone-experiment-bridging-political-divides/",
    "description": "Welcome back to our weekly behind-the-scenes glimpse at what’s getting our team talking. Tell us what you’ve been reading at info@reasonstobecheerful.world and we just might feature it here. So call me maybe A simple but compelling experiment has been launched to help bridge political division and boost happiness: Two payphones,...\nThe post What We’re Reading: The Payphone Experiment Bridging Political Divides appeared first on Reasons to be Cheerful.",
    "pubDate": "Wed, 28 Jan 2026 15:22:55 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/what-were-reading-payphone-experiment-bridging-political-divides/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "The Whimsical Floating Schools of Kashmir",
    "link": "https://reasonstobecheerful.world/floating-schools-of-kashmir-dal-lake/",
    "description": "Each weekday morning, as mist lifts off Dal Lake, a quiet movement begins. Wooden boats set out from houseboats and island homes carrying children dressed in school uniforms, their backpacks tucked between oars and lunch pails. Some row themselves, others are ferried by family. In this part of Kashmir, the...\nThe post The Whimsical Floating Schools of Kashmir appeared first on Reasons to be Cheerful.",
    "pubDate": "Thu, 22 Jan 2026 08:00:45 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/floating-schools-of-kashmir-dal-lake/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "What We’re Reading: ‘Tax Us More’ Say The Super-Rich",
    "link": "https://reasonstobecheerful.world/what-were-reading-tax-us-more-say-the-super-rich/",
    "description": "Welcome back to our weekly behind-the-scenes glimpse at what’s getting our team talking. Tell us what you’ve been reading at info@reasonstobecheerful.world and we just might feature it here. The price we pay “A handful of global oligarchs with extreme wealth have bought up our democracies; taken over our governments; gagged...\nThe post What We’re Reading: ‘Tax Us More’ Say The Super-Rich appeared first on Reasons to be Cheerful.",
    "pubDate": "Wed, 21 Jan 2026 15:33:21 +0000",
    "source": "Reasons to be Cheerful",
    "sourceUrl": "https://reasonstobecheerful.world/what-were-reading-tax-us-more-say-the-super-rich/",
    "category": "general",
    "positivityScore": 7
  },
  {
    "title": "A fish that ages in months reveals how kidneys grow old",
    "link": "https://www.sciencedaily.com/releases/2026/01/260129080428.htm",
    "description": "A fast-aging fish is giving scientists a rare, accelerated look at how kidneys grow old—and how a common drug may slow that process down. Researchers found that SGLT2 inhibitors, widely used to treat diabetes and heart disease, preserved kidney structure, blood vessels, and energy production as the fish aged, while also calming inflammation. The results help explain why these drugs protect kidneys and hearts so reliably in people, even beyond blood sugar control.",
    "pubDate": "Fri, 30 Jan 2026 07:31:31 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260129080428.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "This spider’s “pearl necklace” was living parasites",
    "link": "https://www.sciencedaily.com/releases/2026/01/260127112139.htm",
    "description": "What looked like a pearl necklace on a tiny spider turned out to be parasitic mite larvae. Scientists identified the mites as a new species, marking the first record of its family in Brazil. The larvae attach to juvenile spiders and feed on lymph through a weak spot in the spider’s body. The discovery came from long-stored specimens, suggesting many more species remain hidden in collections.",
    "pubDate": "Wed, 28 Jan 2026 01:16:02 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260127112139.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "Scientists found the soil secret that doubles forest regrowth",
    "link": "https://www.sciencedaily.com/releases/2026/01/260115220612.htm",
    "description": "New research shows tropical forests can recover twice as fast after deforestation when their soils contain enough nitrogen. Scientists followed forest regrowth across Central America for decades and found that nitrogen plays a decisive role in how quickly trees return. Faster regrowth also means more carbon captured from the atmosphere. The study points to smarter reforestation strategies that work with nature rather than relying on fertilizers.",
    "pubDate": "Thu, 15 Jan 2026 22:31:47 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260115220612.htm",
    "category": "climate",
    "positivityScore": 6
  },
  {
    "title": "UK launches plan to tackle 'forever chemicals' amid growing concerns",
    "link": "https://www.bbc.com/news/articles/cz9vz249keno?at_medium=RSS&at_campaign=rss",
    "description": "Increasing testing for PFAS is part of the UK's first ever national plan for tackling the substances.",
    "pubDate": "Tue, 03 Feb 2026 00:06:49 GMT",
    "source": "BBC Science",
    "sourceUrl": "https://www.bbc.com/news/articles/cz9vz249keno?at_medium=RSS&at_campaign=rss",
    "category": "science",
    "positivityScore": 6
  },
  {
    "title": "Virtual Science AI launches the life science industry's first medical congress AI solution for real-time event conversational intelligence",
    "link": "https://www.prnewswire.co.uk/news-releases/virtual-science-ai-launches-the-life-science-industrys-first-medical-congress-ai-solution-for-real-time-event-conversational-intelligence-302676593.html",
    "description": "LONDON, Feb. 2, 2026 /PRNewswire/ -- Virtual Science AI announces the launch of Medical Congress AI, a conversational AI solution that captures and analyses insights from medical congress conversations – an industry first. Medical Congress AI has successfully…",
    "pubDate": "2026-02-02T17:56:00Z",
    "source": "PR Newswire UK",
    "sourceUrl": "https://www.prnewswire.co.uk/news-releases/virtual-science-ai-launches-the-life-science-industrys-first-medical-congress-ai-solution-for-real-time-event-conversational-intelligence-302676593.html",
    "category": "science",
    "author": null,
    "positivityScore": 6
  },
  {
    "title": "Medical Billing Outsourcing Market to Reach US$ 46.17 Billion by 2033 Driven by Revenue Cycle Automation, AI-Based Claims Processing, and Healthcare Digitalization Says Astute Analytica",
    "link": "https://www.globenewswire.com/news-release/2026/02/02/3230075/0/en/Medical-Billing-Outsourcing-Market-to-Reach-US-46-17-Billion-by-2033-Driven-by-Revenue-Cycle-Automation-AI-Based-Claims-Processing-and-Healthcare-Digitalization-Says-Astute-Analyti.html",
    "description": "This growth is driven by healthcare organizations increasingly modernizing revenue cycle management through automation, AI, and advanced analytics to improve billing accuracy, accelerate claim processing, and reduce administrative burdens. Large hospital netw…",
    "pubDate": "2026-02-02T11:01:00Z",
    "source": "GlobeNewswire",
    "sourceUrl": "https://www.globenewswire.com/news-release/2026/02/02/3230075/0/en/Medical-Billing-Outsourcing-Market-to-Reach-US-46-17-Billion-by-2033-Driven-by-Revenue-Cycle-Automation-AI-Based-Claims-Processing-and-Healthcare-Digitalization-Says-Astute-Analyti.html",
    "category": "health",
    "author": "AstuteAnalytica India Pvt. Ltd.",
    "positivityScore": 6
  },
  {
    "title": "Injury-specific effect of Schwann cell-derived exosome treatment for peripheral nerve injury",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340322",
    "description": "Peripheral nerve injury (PNI) is characterized by a loss of cellular and axonal integrity that can lead to limited functional recovery. Because many PNIs are not amenable to repair with traditional techniques, cell therapies have emerged as a treatment option…",
    "pubDate": "2026-02-02T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0340322",
    "category": "wildlife",
    "author": "Ericka A. Schaeffer, Emily L. Errante, Samuel Nodal, Lisandra Vazquez Diaz, Adham M. Khalafallah, Aisha Khan, W. Dalton Dietrich, Allan D Levi, Stephen Shelby Burks",
    "positivityScore": 6
  },
  {
    "title": "3,500-year-old rhino bone fragments found in Western Ghats rewrite India’s wildlife map",
    "link": "https://timesofindia.indiatimes.com/city/chennai/3500-year-old-rhino-bone-fragments-found-in-western-ghats-rewrite-indias-wildlife-map/articleshow/127857597.cms",
    "description": "Archaeological findings of rhino bones near Coimbatore reveal the species once roamed southern India, significantly expanding its known ancient range. This discovery contrasts with current conservation data showing the one-horned rhinoceros is now confined to…",
    "pubDate": "2026-02-02T09:31:15Z",
    "source": "The Times of India",
    "sourceUrl": "https://timesofindia.indiatimes.com/city/chennai/3500-year-old-rhino-bone-fragments-found-in-western-ghats-rewrite-indias-wildlife-map/articleshow/127857597.cms",
    "category": "wildlife",
    "author": "Lairenlakpam Warli",
    "positivityScore": 6
  },
  {
    "title": "Can you save a coral that is dying?",
    "link": "https://www.lifesciencesworld.com/can-you-save-a-coral-that-is-dying/",
    "description": "Can You Save a Coral That Is Dying? Yes, under certain circumstances, you can save a dying coral, although it requires intervention, specific expertise, and favorable environmental conditions to facilitate recovery. The effectiveness of saving coral is heavil…",
    "pubDate": "2026-01-15T06:40:45Z",
    "source": "Lifesciencesworld.com",
    "sourceUrl": "https://www.lifesciencesworld.com/can-you-save-a-coral-that-is-dying/",
    "category": "wildlife",
    "author": "Noah Whitman",
    "positivityScore": 6
  },
  {
    "title": "Mexico moves to combat pollution following Guardian investigations",
    "link": "https://www.theguardian.com/us-news/2026/feb/01/mexico-moves-to-combat-pollution-following-guardian-investigations",
    "description": "After stories revealed high levels of contamination in neighborhood around factory processing US toxic waste, government announces sweeping array of tactics\nThe Mexican government has announced it will pursue a sweeping array of tactics to combat industrial pollution, from $4.8m in fines against a plant processing US hazardous waste to the rollout of a new industrial air-monitoring system, following investigations by the Guardian and Quinto Elemento Lab, a Mexican investigative unit.\nThose stories revealed high levels of heavy-metal contamination in the neighborhood around the factory, Zinc Nacional, in the Monterrey metropolitan area, and showed the broader extent of industrial pollution in the region, linked to Monterrey’s role in manufacturing and recycling goods for the US market.\n Continue reading...",
    "pubDate": "Sun, 01 Feb 2026 17:08:27 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2026/feb/01/mexico-moves-to-combat-pollution-following-guardian-investigations",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Mexico factory that imports US toxic waste to relocate after Guardian report",
    "link": "https://www.theguardian.com/us-news/2025/may/03/mexico-zinc-nacional-factory-hazardous-waste-relocation",
    "description": "Zinc Nacional will move ‘most polluting’ operations after joint investigation found heavy-metals pollution in area\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nA factory processing US hazardous waste in Mexico has promised to relocate what authorities call its “most polluting” operations following a Guardian investigation.\nThe plant in the Monterrey metropolitan area recycles toxic steel dust sent by the US steel industry and recovers zinc, according to that reporting, which was produced in partnership with Quinto Elemento Lab, a Mexico investigative journalism unit. It revealed evidence of heavy-metals pollution in the surrounding neighborhoods.\n Continue reading...",
    "pubDate": "Sat, 03 May 2025 15:00:41 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2025/may/03/mexico-zinc-nacional-factory-hazardous-waste-relocation",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Baby dinosaurs were the backbone of the Jurassic food chain",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201223727.htm",
    "description": "Despite growing into the largest animals ever to walk on land, sauropods began life small, exposed, and alone. Fossil evidence suggests their babies were frequently eaten by multiple predators, making them a key part of the Jurassic food chain. This steady supply of easy prey may explain why early predators thrived without needing extreme hunting adaptations. The findings offer a rare glimpse into how dinosaur ecosystems truly worked.",
    "pubDate": "Sun, 01 Feb 2026 22:50:10 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201223727.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "750-year-old Indian poems reveal a landscape scientists got wrong",
    "link": "https://www.sciencedaily.com/releases/2026/01/260131084622.htm",
    "description": "Old Indian poems and folk songs are revealing a surprising truth about the land. Scientists found that descriptions of thorny trees and open grasslands in texts written as far back as the 1200s closely match today’s savannas in western India. This suggests these landscapes are ancient and natural—not ruined forests. The discovery could reshape how conservation and tree-planting efforts are planned.",
    "pubDate": "Sun, 01 Feb 2026 09:28:51 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260131084622.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Ancient tools in China are forcing scientists to rethink early humans",
    "link": "https://www.sciencedaily.com/releases/2026/01/260131082428.htm",
    "description": "Archaeologists in central China have uncovered evidence that early humans were far more inventive than long assumed. Excavations at the Xigou site reveal advanced stone tools, including the earliest known examples of tools fitted with handles in East Asia, dating back as far as 160,000 years. These discoveries show that ancient populations in the region carefully planned, crafted, and adapted their tools to meet changing environments.",
    "pubDate": "Sat, 31 Jan 2026 08:24:28 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260131082428.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "A century-old Stonehenge mystery may finally be solved",
    "link": "https://www.sciencedaily.com/releases/2026/01/260127010208.htm",
    "description": "Scientists have found compelling new evidence that humans, not glaciers, brought Stonehenge’s bluestones to the site. Using advanced mineral analysis, researchers searched nearby river sediments for signs glaciers once passed through the area—and found none. That missing signature strongly suggests the stones were intentionally moved by people. How they did it remains a mystery, but ice is now largely ruled out.",
    "pubDate": "Tue, 27 Jan 2026 03:32:55 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260127010208.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Rare rocks beneath Australia reveal the origins of a critical metal",
    "link": "https://www.sciencedaily.com/releases/2026/01/260122074028.htm",
    "description": "Rare rocks buried deep in central Australia have revealed how a valuable niobium deposit formed during the breakup of an ancient supercontinent. More than 800 million years ago, tectonic rifting opened pathways that allowed metal-rich magma to rise from the mantle. These unusual rocks contain niobium, a key ingredient in high-strength steel, electric vehicles, and emerging energy technologies. The discovery offers fresh insight into how some of Earth’s most important mineral resources reach the surface.",
    "pubDate": "Fri, 23 Jan 2026 07:07:44 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260122074028.htm",
    "category": "climate",
    "positivityScore": 4
  },
  {
    "title": "Scientists find hidden pathways pancreatic cancer uses to spread",
    "link": "https://www.sciencedaily.com/releases/2026/01/260129080432.htm",
    "description": "Researchers have discovered how pancreatic cancer reprograms its surroundings to spread quickly and stealthily. By using a protein called periostin, the tumor remodels nearby tissue and invades nerves, which helps cancer cells travel and form metastases. This process also creates a tough, fibrous barrier that makes treatments less effective. Targeting periostin could help stop this invasion before it starts.",
    "pubDate": "Fri, 30 Jan 2026 07:44:14 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260129080432.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Brain waves could help paralyzed patients move again",
    "link": "https://www.sciencedaily.com/releases/2026/01/260124073926.htm",
    "description": "People with spinal cord injuries often lose movement even though their brains still send the right signals. Researchers tested whether EEG brain scans could capture those signals and reroute them to spinal stimulators. The system can detect when a patient is trying to move, though finer control remains a challenge. Scientists hope future improvements could turn intention into action.",
    "pubDate": "Sat, 24 Jan 2026 09:35:20 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260124073926.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "The hidden health impact of growing up with ADHD traits",
    "link": "https://www.sciencedaily.com/releases/2026/01/260124073920.htm",
    "description": "A large, decades-long study suggests that signs of ADHD in childhood may have consequences that extend well beyond school and behavior. Researchers followed nearly 11,000 people from childhood into midlife and found that those with strong ADHD traits at age 10 were more likely to experience multiple physical health problems and health-related disability by their mid-40s.",
    "pubDate": "Sat, 24 Jan 2026 07:39:20 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260124073920.htm",
    "category": "health",
    "positivityScore": 4
  },
  {
    "title": "Scientists are hunting for a forbidden antimatter transformation",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201231159.htm",
    "description": "MACE is a next-generation experiment designed to catch muonium transforming into its antimatter twin, a process that would rewrite the rules of particle physics. The last search for this effect ended more than two decades ago, and MACE plans to leap far beyond it using cutting-edge beams, targets, and detectors. A discovery would point to entirely new forces or particles operating at extreme energy scales.",
    "pubDate": "Mon, 02 Feb 2026 07:44:45 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201231159.htm",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "NASA’s Perseverance rover completes the first AI-planned drive on Mars",
    "link": "https://www.sciencedaily.com/releases/2026/01/260131084555.htm",
    "description": "NASA’s Perseverance rover has just made history by driving across Mars using routes planned by artificial intelligence instead of human operators. A vision-capable AI analyzed the same images and terrain data normally used by rover planners, identified hazards like rocks and sand ripples, and charted a safe path across the Martian surface. After extensive testing in a virtual replica of the rover, Perseverance successfully followed the AI-generated routes, traveling hundreds of feet autonomously.",
    "pubDate": "Sat, 31 Jan 2026 08:45:55 EST",
    "source": "Science Daily Top",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260131084555.htm",
    "category": "science",
    "positivityScore": 4
  },
  {
    "title": "ChatGPT: Vaccine Pimp Extraordinaire",
    "link": "https://www.globalresearch.ca/chatgpt-vaccine-pimp-extraordinaire/5914448",
    "description": "Enjoy the below conversation between Yours Truly and OpenAI chatbot founded by accused sister-diddler Sam Altman, ChatGPT, on the subject of injecting children with a pharmaceutical product to, ostensibly, protect against a disease nearly exclusively spread v…",
    "pubDate": "2026-02-02T14:14:04Z",
    "source": "Globalresearch.ca",
    "sourceUrl": "https://www.globalresearch.ca/chatgpt-vaccine-pimp-extraordinaire/5914448",
    "category": "science",
    "author": "Ben Bartee",
    "positivityScore": 4
  },
  {
    "title": "HPV vaccine: Jab that could save future of Kenyan girls",
    "link": "https://www.standardmedia.co.ke/health/health-opinion/article/2001539831/hpv-vaccine-jab-that-could-save-future-of-kenyan-girls",
    "description": "Countries that introduced HPV vaccination early are already reporting dramatic reductions in severe cervical disease and cancer.",
    "pubDate": "2026-02-02T05:54:06Z",
    "source": "Standard Digital",
    "sourceUrl": "https://www.standardmedia.co.ke/health/health-opinion/article/2001539831/hpv-vaccine-jab-that-could-save-future-of-kenyan-girls",
    "category": "science",
    "author": "Dr Musa Misiani",
    "positivityScore": 4
  },
  {
    "title": "A tiny light trap could unlock million qubit quantum computers",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201223737.htm",
    "description": "A new light-based breakthrough could help quantum computers finally scale up. Stanford researchers created miniature optical cavities that efficiently collect light from individual atoms, allowing many qubits to be read at once. The team has already demonstra…",
    "pubDate": "2026-02-02T05:01:14Z",
    "source": "Science Daily",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201223737.htm",
    "category": "science",
    "author": null,
    "positivityScore": 4
  },
  {
    "title": "EXCLUSIVE: Trump Announces New Resources for Combatting Drug Abuse",
    "link": "https://www.dailysignal.com/2026/02/02/exclusive-trump-announces-new-resources-combatting-drug-abuse/",
    "description": "FIRST ON THE DAILY SIGNAL—The Department of Health and Human Services announced new resources to make drug abuse treatment more affordable and accessible for families... Read More\nThe post EXCLUSIVE: Trump Announces New Resources for Combatting Drug Abuse app…",
    "pubDate": "2026-02-02T16:00:00Z",
    "source": "Daily Signal",
    "sourceUrl": "https://www.dailysignal.com/2026/02/02/exclusive-trump-announces-new-resources-combatting-drug-abuse/",
    "category": "health",
    "author": "Elizabeth Troutman Mitchell",
    "positivityScore": 4
  },
  {
    "title": "Iodine increases pulmonary type I interferon responses and decreases covid-19 disease severity: Results from an open label randomized clinical trial",
    "link": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0341126",
    "description": "Objective To investigate whether oral treatment with 12.5 mg iodine additional to standard of care is effective in reducing mortality and clinical deterioration of patients hospitalized with COVID-19.   Methods We performed a single center, randomized clinica…",
    "pubDate": "2026-02-02T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0341126",
    "category": "health",
    "author": "René Traksel, Jasper Broen, Arjen van Henten, Marc Königs, Arjun Raj, Laura van Eyndhoven, Richard Verheesen",
    "positivityScore": 4
  },
  {
    "title": "METLEN secures financing for new solar project in Italy",
    "link": "https://www.naftemporiki.gr/english/2066890/metlen-secures-financing-for-new-solar-project-in-italy/",
    "description": "METLEN has secured 16.6 million euros in project financing for the development of the Bicinicco solar park, a 20.75 MWp large-scale photovoltaic project located in the Friuli Venezia Giulia region…\nMETLEN secures financing for new solar project in Italy - Η Ν…",
    "pubDate": "2026-02-02T05:32:47Z",
    "source": "Naftemporiki.gr",
    "sourceUrl": "https://www.naftemporiki.gr/english/2066890/metlen-secures-financing-for-new-solar-project-in-italy/",
    "category": "climate",
    "author": "Γιάννα Βαρδαλαχάκη",
    "positivityScore": 4
  },
  {
    "title": "It’s nesting season for Olive Ridley turtles’ across Maharashtra coastline: 407 nests recorded so far; previously tagged Olive Ridleys return",
    "link": "https://indianexpress.com/article/cities/mumbai/its-nesting-season-for-olive-ridley-turtles-across-maharashtra-coastline-407-nests-recorded-so-far-previously-tagged-olive-ridleys-return-10508579/",
    "description": "Deriving their name from the olive hue of their shells, Olive Ridley turtles are amongst the most abundant sea species, yet remain vulnerable and are protected under Schedule 1 of India’s Wildlife Protection Act of 1972.",
    "pubDate": "2026-02-02T04:44:04Z",
    "source": "The Indian Express",
    "sourceUrl": "https://indianexpress.com/article/cities/mumbai/its-nesting-season-for-olive-ridley-turtles-across-maharashtra-coastline-407-nests-recorded-so-far-previously-tagged-olive-ridleys-return-10508579/",
    "category": "wildlife",
    "author": "Nayonika Bose",
    "positivityScore": 4
  },
  {
    "title": "The Island Assassin: How the Small Indian Mongoose Became One of Conservation’s Biggest Mistakes",
    "link": "https://a-z-animals.com/articles/the-island-assassin-how-the-small-indian-mongoose-became-one-of-conservations-biggest-mistakes/",
    "description": "The idea sounded sensible at the time. Sugar plantations were losing money to rats, who were chewing through crops and infrastructure. But nature had an...",
    "pubDate": "2026-02-01T13:30:00Z",
    "source": "A-z-animals.com",
    "sourceUrl": "https://a-z-animals.com/articles/the-island-assassin-how-the-small-indian-mongoose-became-one-of-conservations-biggest-mistakes/",
    "category": "wildlife",
    "author": "Neal McLaughlin",
    "positivityScore": 4
  },
  {
    "title": "The regenerative period of somatosensory nerves is closed by a DCC signaling axis",
    "link": "https://journals.plos.org/plosgenetics/article?id=10.1371/journal.pgen.1012033",
    "description": "Author summary The regenerative capacity of organs and tissues declines with age. The closure of regenerative periods often occurs during early developmental stages and severely limits the recovery from injuries and disease. While regenerative periods are def…",
    "pubDate": "2026-02-02T14:00:00Z",
    "source": "Plos.org",
    "sourceUrl": "https://journals.plos.org/plosgenetics/article?id=10.1371/journal.pgen.1012033",
    "category": "wildlife",
    "author": "Jacob Hammer, Cody J. Smith",
    "positivityScore": 4
  },
  {
    "title": "30-year survey records decline in migratory waterbirds",
    "link": "https://www.rte.ie/news/2026/0202/1556270-wetland-birds/",
    "description": "A landmark study charting wetland birds coming here for wintertime over the past 30 years has revealed mixed fortunes for 63 species of migratory waterbirds in Ireland.",
    "pubDate": "2026-02-02T07:00:00Z",
    "source": "RTE",
    "sourceUrl": "https://www.rte.ie/news/2026/0202/1556270-wetland-birds/",
    "category": "wildlife",
    "author": "George Lee",
    "positivityScore": 4
  },
  {
    "title": "World Wetlands Day 2026: Integrating Traditional Knowledge for Climate Resilience",
    "link": "https://www.archdaily.com/1038317/world-wetlands-day-2026-integrating-traditional-knowledge-for-climate-resilience",
    "description": "Observed annually on February 2, World Wetlands Day marks the adoption of the Ramsar Convention in 1971 and provides an international framework for recognizing the role of wetlands in environmental protection and sustainable development. The 2026 edition is h…",
    "pubDate": "2026-02-02T06:30:00Z",
    "source": "ArchDaily",
    "sourceUrl": "https://www.archdaily.com/1038317/world-wetlands-day-2026-integrating-traditional-knowledge-for-climate-resilience",
    "category": "wildlife",
    "author": "Reyyan Dogan",
    "positivityScore": 4
  },
  {
    "title": "Hamas hails reopening of Rafah crossing as big gain",
    "link": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260202-presstv01.htm",
    "description": "Hamas has hailed the reopening of the Rafah crossing in southern Gaza Strip as a significant achievement of Palestinian resilience, pledging to make every effort to restore the vital crossing to full operation.",
    "pubDate": "2026-02-02T10:06:25Z",
    "source": "Globalsecurity.org",
    "sourceUrl": "https://www.globalsecurity.org/military/library/news/2026/02/mil-260202-presstv01.htm",
    "category": "people",
    "author": "John Pike",
    "positivityScore": 4
  },
  {
    "title": "18 Outdoor Dogs Rescued from Winter Storm–and One Gives Birth Safe and Warm Inside Shelter",
    "link": "https://www.goodnewsnetwork.org/18-outdoor-dogs-rescued-from-winter-storm-and-one-gives-birth-safe-and-warm-inside-shelter/",
    "description": "In southeast Missouri, the nonprofit Animal Rescue Corps helped save a pregnant female dog along with 17 others from the snow and freezing temperatures that battered so much of the United States. Safe and warm at their rescue center outside Nashville, the ARC staff helped her welcome a litter of 9 adorable puppies into the […]\nThe post 18 Outdoor Dogs Rescued from Winter Storm–and One Gives Birth Safe and Warm Inside Shelter appeared first on Good News Network.",
    "pubDate": "Fri, 30 Jan 2026 19:30:38 +0000",
    "source": "Good News Network",
    "sourceUrl": "https://www.goodnewsnetwork.org/18-outdoor-dogs-rescued-from-winter-storm-and-one-gives-birth-safe-and-warm-inside-shelter/",
    "category": "general",
    "positivityScore": 3
  },
  {
    "title": "‘Shameful’: Trump’s EPA accused of prioritizing big business over public health",
    "link": "https://www.theguardian.com/us-news/2026/jan/28/trump-epa-environmental-rollbacks",
    "description": "A year into Trump’s second term, critics say the EPA is rolling back dozens of protections and giving a leg up to polluters\nAfter a tumultuous year under the Trump administration, the Environmental Protection Agency (EPA) has adopted a new, almost unrecognizable guise – one that tears up environmental rules and cheerleads for coal, gas-guzzling cars and artificial intelligence.\nWhen Donald Trump took power, it was widely anticipated the EPA would loosen pollution rules from sources such as cars, trucks and power plants, as part of a longstanding back and forth between administrations over how strict such standards should be.\n Continue reading...",
    "pubDate": "Wed, 28 Jan 2026 12:00:10 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/us-news/2026/jan/28/trump-epa-environmental-rollbacks",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Human-made materials found in up to half of some UK urban beaches’ coarse sediments",
    "link": "https://www.theguardian.com/environment/2026/feb/03/human-made-materials-uk-beaches-sediments-study-climate-breakdown",
    "description": "Researchers say changes to make-up of coarse sediment are due to waste dumping and climate breakdown\nAs much as half of some British beaches’ coarse sediments may consist of human-made materials such as brick, concrete, glass and industrial waste, a study has found.\nClimate breakdown, which has caused more frequent and destructive coastal storms, has led to an increase in these substances on beaches. Six sites on the Firth of Forth, an estuary on Scotland’s east coast joining the River Forth to the North Sea, were surveyed to better understand the makeup of “urban beaches”.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 13:56:04 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/human-made-materials-uk-beaches-sediments-study-climate-breakdown",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Mysterious bags of ‘hazardous’ materials appeared in Mexico. Then we found more",
    "link": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "description": "An investigation found thousands of white bags near Monterrey, but aerial footage shows a bigger problem\n\nRevealed: US hazardous waste is sent to Mexico – where a ‘toxic cocktail’ of pollution emerges\n\nCall it the mystery of the white bags. After they were found to be sprawling across acres of land near the Mexican city of Monterrey, authorities ordered their “urgent” removal. Now visual evidence suggests the problem is more extensive than previously known.\nAn investigation by the Guardian and Quinto Elemento Lab first identified the bags in January, piling up around a factory that recycles toxic waste imported from the US. Based on this finding, Mexican authorities demanded a cleanup of what they said was 30,000 tons of stored material with “hazardous characteristics”.\n Continue reading...",
    "pubDate": "Fri, 21 Mar 2025 12:00:22 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/world/2025/mar/21/hazardous-materials-mexico",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Some experts say the new US dietary guidelines have ‘conflicting messaging’. Here’s who will be affected most",
    "link": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "description": "It will take years for changes to take effect, but children who eat school meals and seniors served by Meals on Wheels will feel the DGA ripple effects\nMost Americans ignore the country’s dietary guidelines, but millions will be directly affected by upcoming changes to these recommendations.\nOn 6 January, after months of proclamations about seismic improvements to the country’s dietary recommendations, the US Department of Health and Human Services and the US Department of Agriculture released those updated Dietary Guidelines for Americans (DGA). This document – once visually presented to millennial schoolchildren as a food pyramid and to today’s zoomers and gen Alpha as a segmented lunch plate – synthesizes the latest nutritional research and offers revamped eating advice every five years.\n Continue reading...",
    "pubDate": "Tue, 03 Feb 2026 17:00:19 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/feb/03/us-dietary-guidelines",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Huge amounts of extra land needed for RFK Jr’s meat-heavy diet guidelines",
    "link": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "description": "Even 25% increase in meat and dairy consumption would require 100m more acres of agricultural land, analysis says\nThe Trump administration’s new dietary guidelines urging Americans to eat far more meat and dairy products will, if followed, come at a major cost to the planet via huge swathes of habitat razed for farmland and millions of tons of extra planet-heating emissions.\nA new inverted food pyramid recently released by Donald Trump’s health department emphasizes pictures of steak, poultry, ground beef and whole milk, alongside fruits and vegetables, as the most important foods to eat.\n Continue reading...",
    "pubDate": "Tue, 20 Jan 2026 12:30:03 GMT",
    "source": "The Guardian Environment",
    "sourceUrl": "https://www.theguardian.com/environment/2026/jan/20/rfk-jr-trump-meat-diet-guidelines-land",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Hundreds of new species found in a hidden world beneath the Pacific",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201231230.htm",
    "description": "As demand for critical metals grows, scientists have taken a rare, close look at life on the deep Pacific seabed where mining may soon begin. Over five years and 160 days at sea, researchers documented nearly 800 species, many previously unknown. Test mining reduced animal abundance and diversity significantly, though the overall impact was smaller than expected. The study offers vital clues for how future mining could reshape one of the planet’s most fragile ecosystems.",
    "pubDate": "Mon, 02 Feb 2026 10:22:57 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201231230.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "One of Earth’s most abundant lifeforms has a fatal flaw",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201231205.htm",
    "description": "SAR11 bacteria dominate the world’s oceans by being incredibly efficient, shedding genes to survive in nutrient-poor waters. But that extreme streamlining appears to backfire when conditions change. Under stress, many cells keep copying their DNA without dividing, creating abnormal cells that grow large and die. This vulnerability may explain why SAR11 populations drop during phytoplankton blooms and could become more important as oceans grow less stable.",
    "pubDate": "Mon, 02 Feb 2026 09:21:36 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201231205.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "This AI app can tell which dinosaur made a footprint",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201062455.htm",
    "description": "Dinosaur footprints have always been mysterious, but a new AI app is cracking their secrets. DinoTracker analyzes photos of fossil tracks and predicts which dinosaur made them, with accuracy rivaling human experts. Along the way, it uncovered footprints that look strikingly bird-like—dating back more than 200 million years. That discovery could push the origin of birds much deeper into prehistory.",
    "pubDate": "Sun, 01 Feb 2026 08:37:50 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201062455.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Gray wolves are hunting sea otters and no one knows how",
    "link": "https://www.sciencedaily.com/releases/2026/01/260129080446.htm",
    "description": "On a remote Alaskan island, gray wolves are rewriting the rulebook by hunting sea otters — a behavior few scientists ever expected to see. Researchers are now uncovering how these coastal wolves adapted to marine hunting, what it means for land–sea ecosystems, and whether this ancient predator–prey relationship is re-emerging as sea otters recover.",
    "pubDate": "Fri, 30 Jan 2026 10:29:41 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260129080446.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "A breakthrough that turns exhaust CO2 into useful materials",
    "link": "https://www.sciencedaily.com/releases/2026/01/260128230509.htm",
    "description": "Scientists have created a device that captures carbon dioxide and transforms it into a useful chemical in a single step. The new electrode works with realistic exhaust gases rather than requiring purified CO2. It converts the captured gas into formic acid, which is used in energy and manufacturing. The system even functions at CO2 levels found in normal air.",
    "pubDate": "Thu, 29 Jan 2026 00:28:18 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260128230509.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "New DNA analysis rewrites the story of the Beachy Head Woman",
    "link": "https://www.sciencedaily.com/releases/2026/01/260125083421.htm",
    "description": "A Roman-era skeleton discovered in southern England has finally given up her secrets after more than a decade of debate. Known as the Beachy Head Woman, she was once thought to have roots in sub-Saharan Africa or the Mediterranean—an idea that sparked global attention. But new, high-quality DNA analysis paints a different picture: she was most likely a local woman from Roman Britain.",
    "pubDate": "Sun, 25 Jan 2026 10:04:57 EST",
    "source": "Science Daily Environment",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260125083421.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Forty years of forest data reveal a changing Amazon",
    "link": "https://www.sciencedaily.com/releases/2026/01/260125081133.htm",
    "description": "After analyzing 40 years of tree records across the Andes and Amazon, researchers found that climate change is reshaping tropical forests in uneven ways. Some regions are steadily losing tree species, especially where conditions are hotter and drier, while others are seeing gains. Rainfall patterns turned out to be just as important as rising temperatures.",
    "pubDate": "Sun, 25 Jan 2026 08:27:34 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260125081133.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "This new building material pulls carbon out of the air",
    "link": "https://www.sciencedaily.com/releases/2026/01/260121034148.htm",
    "description": "A new building material developed by engineers at Worcester Polytechnic Institute could change how the world builds. Made using an enzyme that turns carbon dioxide into solid minerals, the material cures in hours and locks away carbon instead of releasing it. It’s strong, repairable, recyclable, and far cleaner than concrete. If adopted widely, it could slash emissions across the construction industry.",
    "pubDate": "Wed, 21 Jan 2026 03:41:48 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260121034148.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "Microplastics are undermining the ocean’s power to absorb carbon",
    "link": "https://www.sciencedaily.com/releases/2026/01/260116035322.htm",
    "description": "Tiny plastic particles drifting through the oceans may be quietly weakening one of Earth’s most powerful climate defenses. New research suggests microplastics are disrupting marine life that helps oceans absorb carbon dioxide, while also releasing greenhouse gases as they break down. By interfering with plankton, microbes, and natural carbon cycles, these pollutants reduce the ocean’s ability to regulate global temperatures.",
    "pubDate": "Sat, 17 Jan 2026 21:58:02 EST",
    "source": "Science Daily Climate",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260116035322.htm",
    "category": "climate",
    "positivityScore": 2
  },
  {
    "title": "A silent brain disease can quadruple dementia risk",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201223732.htm",
    "description": "Researchers studying nearly 2 million older adults found that cerebral amyloid angiopathy sharply raises the risk of developing dementia. Within five years, people with the condition were far more likely to be diagnosed than those without it. The increased risk was present even without a history of stroke. Experts say this makes early screening for memory and thinking changes especially important.",
    "pubDate": "Sun, 01 Feb 2026 23:08:47 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201223732.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Middle age is becoming a breaking point in the U.S.",
    "link": "https://www.sciencedaily.com/releases/2026/02/260201062457.htm",
    "description": "Middle age is becoming a tougher chapter for many Americans, especially those born in the 1960s and early 1970s. Compared with earlier generations, they report more loneliness and depression, along with weaker physical strength and declining memory. These troubling trends stand out internationally, as similar declines are largely absent in other wealthy nations, particularly in Nordic Europe, where midlife well-being has improved.",
    "pubDate": "Sun, 01 Feb 2026 10:25:53 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260201062457.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists discover how to turn gut bacteria into anti-aging factories",
    "link": "https://www.sciencedaily.com/releases/2026/01/260131085024.htm",
    "description": "Researchers found that small doses of an antibiotic can coax gut bacteria into producing a life-extending compound. In worms, this led to longer lifespans, while mice showed healthier cholesterol and insulin changes. Because the drug stays in the gut, it avoids toxic side effects. The study points to a new way of promoting health by targeting microbes rather than the body itself.",
    "pubDate": "Sun, 01 Feb 2026 02:49:48 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260131085024.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Scientists finally explain statin muscle pain",
    "link": "https://www.sciencedaily.com/releases/2026/01/260131084610.htm",
    "description": "Statins are a cornerstone of heart health, but muscle pain and weakness cause many patients to quit taking them. Scientists have now identified the precise molecular trigger behind these side effects. They found that statins jam open a critical muscle protein, causing a toxic calcium leak. The discovery could lead to safer statins that keep their life-saving benefits without the muscle damage.",
    "pubDate": "Sat, 31 Jan 2026 10:39:49 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260131084610.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "A quiet change in everyday foods could save thousands of lives",
    "link": "https://www.sciencedaily.com/releases/2026/01/260131082433.htm",
    "description": "Lowering salt in everyday foods could quietly save lives. Researchers found that modest sodium reductions in bread, packaged foods, and takeout meals could significantly reduce heart disease and stroke rates in France and the U.K. The key advantage is that people would not need to alter their eating habits at all. Small changes to the food supply could deliver large, long-term health benefits.",
    "pubDate": "Sat, 31 Jan 2026 09:27:42 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260131082433.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "A simple blood test could spot Parkinson’s years before symptoms",
    "link": "https://www.sciencedaily.com/releases/2026/01/260129080424.htm",
    "description": "Scientists in Sweden and Norway have uncovered a promising way to spot Parkinson’s disease years—possibly decades—before its most damaging symptoms appear. By detecting subtle biological signals in the blood tied to how cells handle stress and repair DNA, the team identified a brief early window when Parkinson’s quietly leaves a measurable fingerprint.",
    "pubDate": "Thu, 29 Jan 2026 09:26:14 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260129080424.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "Long-term alcohol use linked to a sharp rise in rectal cancer",
    "link": "https://www.sciencedaily.com/releases/2026/01/260128230514.htm",
    "description": "Drinking heavily over many years is linked to a higher risk of colorectal cancer, especially rectal cancer, according to new research tracking U.S. adults for two decades. People who drank heavily throughout adulthood faced sharply higher risks than light drinkers. Former drinkers did not show increased cancer risk and had fewer precancerous tumors. The results suggest that quitting alcohol may help lower long-term cancer risk.",
    "pubDate": "Thu, 29 Jan 2026 01:09:04 EST",
    "source": "Science Daily Health",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260128230514.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "This brain discovery is forcing scientists to rethink how memory works",
    "link": "https://www.sciencedaily.com/releases/2026/02/260203020203.htm",
    "description": "A new brain imaging study reveals that remembering facts and recalling life events activate nearly identical brain networks. Researchers expected clear differences but instead found strong overlap across memory types. The finding challenges decades of memory research. It may also help scientists better understand conditions like Alzheimer’s and dementia.",
    "pubDate": "Tue, 03 Feb 2026 02:17:32 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/02/260203020203.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "The fat you can’t see could be shrinking your brain",
    "link": "https://www.sciencedaily.com/releases/2026/01/260127112127.htm",
    "description": "Where your body stores fat may matter just as much as how much you carry—especially for your brain. Using advanced MRI scans and data from nearly 26,000 people, researchers identified two surprising fat patterns tied to faster brain aging, cognitive decline, and higher neurological disease risk. One involves unusually high fat buildup in the pancreas, even without much liver fat, while the other—often called “skinny fat”—affects people who don’t appear severely obese but carry excess fat relative to muscle.",
    "pubDate": "Wed, 28 Jan 2026 07:33:30 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260127112127.htm",
    "category": "health",
    "positivityScore": 2
  },
  {
    "title": "A common parasite in the brain is far more active than we thought",
    "link": "https://www.sciencedaily.com/releases/2026/01/260127112124.htm",
    "description": "A common parasite long thought to lie dormant is actually much more active and complex. Researchers found that Toxoplasma gondii cysts contain multiple parasite subtypes, not just one sleeping form. Some are primed to reactivate and cause disease, which helps explain why infections are so hard to treat. The discovery could reshape efforts to develop drugs that finally eliminate the parasite for good.",
    "pubDate": "Tue, 27 Jan 2026 23:11:20 EST",
    "source": "Science Daily Mind",
    "sourceUrl": "https://www.sciencedaily.com/releases/2026/01/260127112124.htm",
    "category": "health",
    "positivityScore": 2
  }
]